{
  "data": [{
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCcwsOiQ_CAHoh_Y",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Hack.Developers, ecco i vincitori della categoria Fast Rabbit",
        "subtitle": "Da Roma e Trento i due progetti vincitori, le interviste con i membri dei team",
        "release-date": "2017-10-23 16:00:00 +0000",
        "tags": ["hackathon", "eventi", "sviluppatori"],
        "author": "Giovanni Bajo",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": [null],
        "slug": "hack-developers-ecco-i-vincitori-fast-rabbit",
        "ext": ".md",
        "excerpt": "<p>Abbiamo annunciato i primi due team vincitori di <a href=\"https://hack.developers.italia.it/\">Hack.Developers</a>! Non è stato davvero facile scegliere tra <strong>96 proposte</strong> che in alcuni casi hanno persino superato le nostre migliori aspettative. Alla fine i mentor di tutta Italia hanno individuato <a href=\"https://hack.developers.italia.it/premiazione-fast-rabbit/\">i due gruppi che si sono aggiudicati il premio Fast Rabbit</a>, avendo sottoposto le loro <em>pull request</em> <strong>entro le 48 ore del code sprint</strong> (<a href=\"https://hack.developers.italia.it/premi/\">qui i criteri di selezione</a>).</p>\n\n",
        "id": "/news/2017/10/23/hack-developers-ecco-i-vincitori-fast-rabbit",
        "url": "/news/2017/10/23/hack-developers-ecco-i-vincitori-fast-rabbit.html",
        "text": " Oct 23, 2017 Hack.Developers, ecco i vincitori della categoria Fast Rabbit Da Roma e Trento i due progetti vincitori, le interviste con i membri dei team di Giovanni Bajo condividi su Twitter Abbiamo annunciato i primi due team vincitori di Hack.Developers! Non è stato davvero facile scegliere tra 96 proposte che in alcuni casi hanno persino superato le nostre migliori aspettative. Alla fine i mentor di tutta Italia hanno individuato i due gruppi che si sono aggiudicati il premio Fast Rabbit, avendo sottoposto le loro pull request entro le 48 ore del code sprint (qui i criteri di selezione). I team i cui progetti hanno ottenuto i migliori punteggi sono: Stacks out for Haramble, che ha sviluppato una libreria di Python per inviare comandi di basso livello a una Carta di Identità Elettronica (challenge: cie-nis-sdk) RomaJS che ha sviluppato un prototipo di toolkit per React per aggiornare il framework CSS di riferimento per le linee guida di design della PA (challenge: design-react) “Questo è stato il nostro primo hackathon in assoluto, avevamo già fatto gare insieme ma mai così lunghe!”, ci racconta Alekos Filini, membro del team Stacks out for Haramble insieme a Daniela Brozzoni, entrambi studenti a Trento. “Possiamo dire di aver imparato come gestire una situazione del genere, che effettivamente non è banale come cosa: bisogna pianificare bene quante ore di sonno fare e bisogna anche imparare a dividersi bene il lavoro ed essere ‘sincronizzati’. Sul lato pratico, possiamo dire di aver aumentato le nostre conoscenze nell’ambito della tecnologia NFC, basti pensare che una buona parte della gara è stata passata su GitHub o altri siti cercando di capire come funzionasse…” Sugli stessi toni il racconto di Matteo Manchi, portavoce della Community RomaJS: “Seduti insieme al tavolo, abbiamo deciso di approcciare alle challenge con lo spirito di un code-sprint: divertiamoci insieme, ma puntiamo su qualcosa su cui abbiamo l’esperienza tale da creare qualcosa di veramente utile in futuro. Abbiamo lavorato tutta la notte (su Roma credo fossimo l’unico team rimasto a fare nottata), concedendoci tre ore di sonno verso le cinque, e alla fine abbiamo consegnato un progetto che rispecchiava i nostri obiettivi”. Un grazie speciale da parte dell’organizzazione va anche a tutti i membri degli altri team del Fast Rabbit, che hanno contribuito in modo davvero valido a tutte le challenge, da SPID a 18app, dal DAF all’ANPR (qui le 30 migliori proposte). C’è tempo fino al 30 Ottobre per vincere un premio! Come sapete Hack.Developers non finisce qui. Molti gruppi sono ancora al lavoro fino al 30 ottobre, per portare a termine i progetti candidati ai premi Wise Turtle, con i mentor che resteranno a disposizione sul canale Slack dell’Hackathon fino alla fine del mese. I cinque team vincitori saranno annunciati entro metà Novembre, quando avverrà la premiazione anche dei due team vincitori del Fast Rabbit. A presto! condividi su Twitter argomenti hackathon eventi sviluppatori ",
        "html": "<p>Abbiamo annunciato i primi due team vincitori di <a href=\"https://hack.developers.italia.it/\">Hack.Developers</a>! Non è stato davvero facile scegliere tra <strong>96 proposte</strong> che in alcuni casi hanno persino superato le nostre migliori aspettative. Alla fine i mentor di tutta Italia hanno individuato <a href=\"https://hack.developers.italia.it/premiazione-fast-rabbit/\">i due gruppi che si sono aggiudicati il premio Fast Rabbit</a>, avendo sottoposto le loro <em>pull request</em> <strong>entro le 48 ore del code sprint</strong> (<a href=\"https://hack.developers.italia.it/premi/\">qui i criteri di selezione</a>).</p>\n\n<p>I team i cui progetti hanno ottenuto i migliori punteggi sono:</p>\n\n<ul>\n  <li><strong>Stacks out for Haramble</strong>, che ha sviluppato <a href=\"https://github.com/italia/cie-nis-sdk/pull/3\">una libreria di Python</a> per inviare comandi di basso livello a una Carta di Identità Elettronica (challenge: <a href=\"https://github.com/italia/cie-nis-sdk\">cie-nis-sdk</a>)</li>\n  <li><strong>RomaJS</strong> che ha sviluppato <a href=\"https://github.com/italia/design-react/pull/4\">un prototipo di toolkit per React</a> per aggiornare il framework CSS di riferimento per le linee guida di design della PA (challenge: <a href=\"https://github.com/italia/design-react/issues/1\">design-react</a>)</li>\n</ul>\n\n<p>“Questo è stato il nostro primo hackathon in assoluto, avevamo già fatto gare insieme ma mai così lunghe!”, ci racconta <strong>Alekos Filini</strong>, membro del team Stacks out for Haramble insieme a <strong>Daniela Brozzoni</strong>, entrambi studenti a Trento. “Possiamo dire di aver imparato come gestire una situazione del genere, che effettivamente non è banale come cosa: bisogna pianificare bene quante ore di sonno fare e bisogna anche imparare a dividersi bene il lavoro ed essere ‘sincronizzati’. Sul lato pratico, possiamo dire di aver aumentato le nostre conoscenze nell’ambito della tecnologia NFC, basti pensare che una buona parte della gara è stata passata su GitHub o altri siti cercando di capire come funzionasse…”</p>\n\n<p>Sugli stessi toni il racconto di <strong>Matteo Manchi</strong>, portavoce della Community RomaJS: “Seduti insieme al tavolo, abbiamo deciso di approcciare alle challenge con lo spirito di un code-sprint: divertiamoci insieme, ma puntiamo su qualcosa su cui abbiamo l’esperienza tale da creare qualcosa di veramente utile in futuro. Abbiamo lavorato tutta la notte (su Roma credo fossimo l’unico team rimasto a fare nottata), concedendoci tre ore di sonno verso le cinque, e alla fine abbiamo consegnato un progetto che rispecchiava i nostri obiettivi”.\nUn grazie speciale da parte dell’organizzazione va anche a tutti i membri degli altri team del Fast Rabbit, che hanno contribuito in modo davvero valido a  tutte le challenge, da SPID a 18app, dal DAF all’ANPR (<a href=\"https://hack.developers.italia.it/premiazione-fast-rabbit/\">qui le 30 migliori proposte</a>).</p>\n\n<h2 id=\"cè-tempo-fino-al-30-ottobre-per-vincere-un-premio\">C’è tempo fino al 30 Ottobre per vincere un premio!</h2>\n\n<p>Come sapete <strong>Hack.Developers non finisce qui</strong>. Molti gruppi sono ancora al lavoro fino al 30 ottobre, per portare a termine i progetti candidati ai <a href=\"https://hack.developers.italia.it/premi/\">premi Wise Turtle</a>, con i mentor che resteranno a disposizione sul canale Slack dell’Hackathon fino alla fine del mese.</p>\n\n<p>I cinque team vincitori saranno annunciati entro metà Novembre, quando avverrà la premiazione anche dei due team vincitori del <em>Fast Rabbit</em>.</p>\n\n<p>A presto!</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCkdsOiQ_CAHoh_e",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Un webinar per le software house sull'acquisizione e il riuso del software",
        "subtitle": "Appuntamento mercoledì 23 maggio alle ore 16",
        "release-date": "2018-05-16 09:00:00 +0000",
        "tags": ["developers", "software", "opensource"],
        "author": "Francesco De Augustinis",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": [null],
        "slug": "un-webinar-per-le-software-house-sull-acquisizione-e-il-riuso-del-software",
        "ext": ".md",
        "excerpt": "<p><strong>Mercoledì 23 maggio alle 16</strong> si terrà un webinar a cura del <a href=\"https://teamdigitale.governo.it/\">Team per la Trasformazione Digitale</a> rivolto alle software house, per presentare le nuove <a href=\"https://lg-acquisizione-e-riuso-software-per-la-pa.readthedocs.io/it/latest/\">Linee guida sull’acquisizione e il riuso di software per la Pubblica Amministrazione</a> che <strong>aprono nuovi scenari e nuove opportunità</strong> per il mercato dei fornitori di software.</p>\n\n",
        "id": "/news/2018/05/16/un-webinar-per-le-software-house-sull-acquisizione-e-il-riuso-del-software",
        "url": "/news/2018/05/16/un-webinar-per-le-software-house-sull-acquisizione-e-il-riuso-del-software.html",
        "text": " May 16, 2018 Un webinar per le software house sull'acquisizione e il riuso del software Appuntamento mercoledì 23 maggio alle ore 16 di Francesco De Augustinis condividi su Twitter Mercoledì 23 maggio alle 16 si terrà un webinar a cura del Team per la Trasformazione Digitale rivolto alle software house, per presentare le nuove Linee guida sull’acquisizione e il riuso di software per la Pubblica Amministrazione che aprono nuovi scenari e nuove opportunità per il mercato dei fornitori di software. In particolare, il modello adottato, che è incentrato sulle licenze open source e su un catalogo dettagliato, incentiverà la domanda per attività di: modifica personalizzazione evoluzione di soluzioni già esistenti, spingendo verso il consolidamento delle soluzioni e l’innalzamento della qualità; il modello inoltre creerà spazio per gli operatori che non lavorano già con le PA ma hanno soluzioni open source da proporre. Raccomandiamo a tutte le software house che lavorano con la PA o interessate a farlo, e a tutte quelle che lavorano nell’open source, di partecipare al webinar. Sarà possibile interagire, porre domande e fornire feedback. La partecipazione è gratuita ma è necessaria l’iscrizione. Vi aspettiamo, a presto! Il team Developers Italia condividi su Twitter argomenti developers software opensource ",
        "html": "<p><strong>Mercoledì 23 maggio alle 16</strong> si terrà un webinar a cura del <a href=\"https://teamdigitale.governo.it/\">Team per la Trasformazione Digitale</a> rivolto alle software house, per presentare le nuove <a href=\"https://lg-acquisizione-e-riuso-software-per-la-pa.readthedocs.io/it/latest/\">Linee guida sull’acquisizione e il riuso di software per la Pubblica Amministrazione</a> che <strong>aprono nuovi scenari e nuove opportunità</strong> per il mercato dei fornitori di software.</p>\n\n<p>In particolare, il modello adottato, che è incentrato sulle licenze <em>open source</em> e su un catalogo dettagliato, incentiverà la domanda per attività di:</p>\n\n<ul>\n  <li>modifica</li>\n  <li>personalizzazione</li>\n  <li>evoluzione</li>\n</ul>\n\n<p>di soluzioni già esistenti, spingendo verso il <strong>consolidamento delle soluzioni</strong> e l’<strong>innalzamento della qualità</strong>; il modello inoltre creerà spazio per gli operatori che non lavorano già con le PA ma hanno soluzioni <em>open source</em> da proporre.</p>\n\n<p>Raccomandiamo a tutte le software house che lavorano con la PA o interessate a farlo, e a tutte quelle che lavorano nell’open source, di partecipare al webinar.</p>\n\n<p>Sarà possibile interagire, porre domande e fornire feedback. La partecipazione è gratuita ma <a href=\"https://www.eventbrite.it/e/registrazione-le-nuove-linee-guida-per-lacquisizione-e-il-riuso-di-software-nella-pa-45845227309\">è necessaria l’iscrizione</a>.</p>\n\n<p>Vi aspettiamo, a presto!</p>\n\n<p>Il team Developers Italia</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCnwsOiQ_CAHoh_j",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "Google Summer of Code - Ideas list",
        "subtitle": "Want to get involved with Google Summer of Code? Here are a few ideas",
        "lang": "en",
        "layout": "page",
        "slug": "gsoc-ideas",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h1 id=\"information-for-students\">Information for Students</h1>\n<p>First of all, welcome!</p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/gsoc-ideas",
        "url": "/en/gsoc-ideas/",
        "text": "",
        "html": "<h1 id=\"information-for-students\">Information for Students</h1>\n<p>First of all, welcome!</p>\n\n<p>These ideas were contributed by our developers and users. They are sometimes vague or incomplete. If you wish to submit a proposal based on these ideas, you may wish to contact the developers and find out more about the particular suggestion you’re looking at.</p>\n\n<p>Being accepted as a Google Summer of Code student is quite competitive. Accepted students typically have thoroughly researched the technologies of their proposed project and have been in frequent contact with potential mentors. Simply copying and pasting an idea here will not work. On the other hand, creating a completely new idea without first consulting potential mentors is unlikely to work out.</p>\n\n<p>When writing your proposal or asking for help from the general community of Developers Italia, and don’t assume everyone is familiar with the ideas here.</p>\n\n<p>If there is no specific contact given you can ask questions on our <a href=\"https://slack.developers.italia.it/\">Slack</a>. You can get an invite <a href=\"https://slack.developers.italia.it/\">here</a>. If you don’t know who your point of contact should be, don’t be shy, there is a channel called <a href=\"https://developersitalia.slack.com/messages/C8U3ZSM5M\">#welcome</a> just for this!</p>\n\n<h2 id=\"open-ideas\">Open ideas</h2>\n\n<p>Well prepared proposals from capable students have an outstanding chance of getting selected. We consider proposals for all skill levels ranging from simple to crazy hard and everything in between. Introduce yourself, and we’ll help you plan one right for you.</p>\n\n<p>Remember that project descriptions are just initial ideas. You must expand with considerably more detail. Change the goals to fit your experience and interests.</p>\n\n<p>Note for the community: each project on the Ideas list should include: a) a project title/description b) more detailed description of the project (2-5 sentences) c) expected outcomes d) skills required/preferred e) possible mentors. And if possible, an easy, medium or hard rating of each project.</p>\n\n<table id=\"issues_table\" class=\"display responsive dataTable no-footer dtr-inline\" cellspacing=\"0\" width=\"100%\" role=\"grid\" style=\"width: 100%;\">\n    <thead>\n        <tr role=\"row\">\n            <th data-priority=\"2\" tabindex=\"0\" aria-controls=\"issues_table\" rowspan=\"1\" colspan=\"1\" style=\"width: 40px;\">Project</th>\n            <th data-priority=\"0\" tabindex=\"0\" aria-controls=\"issues_table\" rowspan=\"1\" colspan=\"1\" style=\"width: 400px;\">Brief description</th>\n            <th data-priority=\"11\" class=\"sorting_disabled\" rowspan=\"1\" colspan=\"1\" style=\"width: 30px;\">Difficulty</th>\n            <th data-priority=\"10\" tabindex=\"0\" aria-controls=\"issues_table\" rowspan=\"1\" colspan=\"1\" style=\"width: 64px;\">Contact</th>\n        </tr>\n    </thead>\n\n\n    <tbody>\n        <tr role=\"row\" class=\"odd\">\n            <td tabindex=\"0\">DAF</td>\n            <td>\n                <b>Create a new pipeline for ingesting data into DAF </b><br /> Data &amp; Analytics Framework (DAF in short) is an infrastructure to consume and distribute many different kind of datasets coming from many different sources. Find an interesting\n                data source (with a certain platform) and convert it so it's usable within DAF. We have several mentors available, with different expertises, so make sure you discuss with your mentor which kind of application would be useful.\n                <br />\n                <b>Mentor:</b> Ask on the #daf channel on our slack once you start having a basic idea\n                <br />\n                <b>Expected outcome:</b> A working pipeline to ingest data into DAF\n                <br />\n                <b>Required skills:</b>\n                <ul>\n                    <li>- Scala</li>\n                    <li>- Data management</li>\n                    <li>- (preferred) Kylo</li>\n                </ul>\n                <br /> Full description on the issue:\n                <a href=\"https://github.com/italia/daf/issues/215\">#215</a></td>\n            <td>Hard</td>\n            <td><a href=\"https://developersitalia.slack.com/messages/C760XQX9Q/\">#daf</a></td>\n        </tr>\n        <tr role=\"row\" class=\"even\">\n            <td tabindex=\"0\">DAF</td>\n            <td>\n                <b>Create a data product based on a DAF dataset</b><br /> Create an application based on a DAF dataset You can choose any technology you want, but you should be creating an interesting dashboard, visualization, or useful program which\n                exploits the possibilities of the DAF framework. We have several mentors available, with different expertises, so make sure you discuss with your mentor which kind of application would be useful. We have several mentors available, with\n                different expertises, so make sure you discuss with your mentor which kind of application would be useful.\n                <br />\n                <b>Mentor:</b> Ask on the #daf channel on our slack once you start having a basic idea\n                <br />\n                <b>Expected outcome:</b> An application (web or otherwise) which makes use of DAF datasets\n                <br />\n                <b>Required skills:</b>\n                <ul>\n                    <li>- (preferred) Data visualization</li>\n                    <li>- Data management</li>\n                </ul>\n                <br /> Full description on the issue:\n                <a href=\"https://github.com/italia/daf/issues/214\">#214</a></td>\n            <td>Medium</td>\n            <td><a href=\"https://developersitalia.slack.com/messages/C760XQX9Q/\">#daf</a></td>\n        </tr>\n        <tr role=\"row\" class=\"odd\">\n\n            <td tabindex=\"0\">OpenFisca</td>\n            <td>\n                <b>Adapt OpenFisca to the Italian Fiscal system</b><br />\n                <a href=\"http://openfisca.org/doc/index.html\">OpenFisca</a> is an open source project created by the French government<br /><br /> It supports multiple countries. Implement an \"Italia\" country which implements the Italian fiscal laws.\n                This task is interesting to students with a background in\n                <br />\n                <b>Mentor:</b> You will have two mentors from the Digital Transformation Team: one for the python code and an expert of the tax system. Find them on #welcome.\n                <br />\n                <b>Expected outcome:</b> A working implementation of Italy in the OpenFisca system.\n                <br />\n                <b>Required skills:</b>\n                <ul>\n                    <li>- Python</li>\n                    <li>- A general understanding of taxation systems</li>\n                </ul>\n                <br /> Full description on the issue:\n                <a href=\"https://github.com/italia/developers.italia.it/issues/105\">#105</a></td>\n            <td>Easy</td>\n            <td><a href=\"https://developersitalia.slack.com/messages/C8U3ZSM5M\">#welcome</a></td>\n        </tr>\n        <tr role=\"row\" class=\"even\">\n            <td tabindex=\"0\">Design</td>\n            <td>\n                <b>Create a Joomla theme that implements the Italia Design Guidelines</b><br /> Create a theme for Joomla based on the User Interface design guidelines. Do include the design web toolkit as a dependency, and make sure you write your code\n                in a way which is generic enough so that, later on, it be replaced by another toolkit (e.g. bootstrap) without too much effort.\n                <br />\n                <b>Mentor:</b> Francesco Zaia, with the help of others in the #design team\n                <br />\n                <b>Expected outcome:</b> A working implementation of the Italia Design System as a Joomla theme.\n                <br />\n                <b>Required skills:</b>\n                <ul>\n                    <li>- CSS</li>\n                    <li>- Frontend development</li>\n                    <li>- Joomla</li>\n                </ul>\n                <br /> Full description on the issue:\n                <a href=\"https://github.com/italia/design-joomla-theme/issues/1\">#1</a></td>\n            <td>Medium</td>\n            <td><a href=\"https://developersitalia.slack.com/messages/C7658JRJR\">#design</a>\n                <a href=\"https://developersitalia.slack.com/messages/C7VPAUVB3\">#design-js</a></td>\n        </tr>\n        <tr role=\"row\" class=\"odd\">\n            <td tabindex=\"0\">Design</td>\n            <td>\n                <b>Create a Drupal theme that implements the Italia Design Guidelines</b><br /> Create a theme for Drupal based on the User Interface design guidelines. Do include the design web toolkit as a dependency, and make sure you write your code\n                in a way which is generic enough so that, later on, it be replaced by another toolkit (e.g. bootstrap) without too much effort.\n                <br />\n                <b>Mentor:</b> Francesco Zaia, with the help of others in the #design team\n                <br />\n                <b>Expected outcome:</b> A working implementation of the Italia Design System as a Drupal theme.\n                <br />\n                <b>Required skills:</b>\n                <ul>\n                    <li>- CSS</li>\n                    <li>- Frontend development</li>\n                    <li>- Drupal</li>\n                </ul>\n                <br /> Full description on the issue:\n                <a href=\"https://github.com/italia/design-drupal-theme/issues/1\">#1</a></td>\n            <td>Medium</td>\n            <td><a href=\"https://developersitalia.slack.com/messages/C7658JRJR\">#design</a>\n                <a href=\"https://developersitalia.slack.com/messages/C7VPAUVB3\">#design-js</a></td>\n        </tr>\n        <tr role=\"row\" class=\"even\">\n            <td tabindex=\"0\">General</td>\n            <td>\n                <b>Your own idea!!</b><br /> Something that you're totally excited about!<br />Do you have an awesome idea you want to work on with Developers Italia but that is not among the ideas below? That's cool. We love that! But please do us a\n                favor: Get in touch with a mentor early on and make sure your project is realistic and within the scope of Developers Italia. That will spare you and us a lot of frustration.\n                <br />\n                <b>Mentor:</b> Propose your idea and ask who in Developers Italia is interested in what you want to work on and approach them. If you are unsure you can always ask in <a href=\"https://developersitalia.slack.com/messages/C8U3ZSM5M\">#welcome</a>.\n                <br />\n                <b>Expected outcome:</b> To be discussed with your mentor...\n                <br />\n                <b>Required skills:</b>\n                <ul>\n                    <li>- Up to you :-)</li>\n                </ul>\n                </td>\n                <td>Up to you</td>\n                <td><a href=\"https://developersitalia.slack.com/messages/C8U3ZSM5M\">#welcome</a></td>\n        </tr>\n        <tr role=\"row\" class=\"odd\">\n            <td tabindex=\"0\">DAF</td>\n            <td>\n                <b>CI and Automation for DAF</b><br /> DAF is currently organized as a number of microservices with a complex deploy structure. It is not the most developer-friendly environment to set-up. Write a series of CI/CD pipelines to automate the testing and development phases, and complement it with some ansible sugar to configure hacking and production environments.\n                <br />\n                <b>Mentor:</b> Our dev-ops are always hanging on the #daf channel. Fabio Fumarola or Alessandro Ercolani will help you get started.\n                <br />\n                <b>Expected outcome:</b> A set of pipelines to create a more structured DAF infrastructure.\n                <br />\n                <b>Required skills:</b>\n                <ul>\n                    <li>- A CI/CD system</li>\n                    <li>- Ansible</li>\n                </ul></td>\n            <td>Medium</td>\n            <td><a href=\"https://developersitalia.slack.com/messages/C760XQX9Q/\">#daf</a></td>\n        </tr>\n        <tr role=\"row\" class=\"even\">\n            <td tabindex=\"0\">DAF</td>\n            <td>\n                <b>Data science - datastories</b><br /> DAF offers Jupiter notebooks for data scientists to explore public datasets. The whole environment is set up in a way so that you can create your \"data stories\", combining notebooks, Metabase plots and other visualization from Superset. Use the platform to create new dashboards useful to citizens and journalists.\n                <br />\n                <b>Mentor:</b> Data science team #daf channel. Fabiana Lanotte.\n                <br />\n                <b>Expected outcome:</b> A set of datastories that create insights on public data.\n                <br />\n                <b>Required skills:</b>\n                <ul>\n                    <li>- Python</li>\n                    <li>- Data Science</li>\n                </ul></td>\n            <td>Easy</td>\n            <td><a href=\"https://developersitalia.slack.com/messages/C760XQX9Q/\">#daf</a></td>\n        </tr>\n        <tr role=\"row\" class=\"odd\">\n            <td tabindex=\"0\">General</td>\n            <td>\n                <b>Plan and develop a novel <i>electronic class register</i> for the hospital school</b><br /> The Italian <i>hospital schools</i> need a specialized class register with features slightly different from the traditional registers. Together with an ad-hoc team of the Polytechnic University of Turin, you should analyze the current solutions in the FOSS panorama, design the novel architecture, develop the code and define a deployment strategy. The starting point of the project will be the working solution already deployed by the team several years ago (that needs restyling).\n                <br />\n                <b>Mentor:</b> The Open Education team at Politecnico di Torino\n                <br />\n                <b>Expected outcome:</b> A working alpha release.\n                <br />\n                <b>Required skills:</b>\n                <ul>\n                    <li>- Python</li>\n                    <li>- Django</li>\n                    <li>- PostgreSQL</li>\n                    <li>- GNU/Linux</li>\n                    <li>- Web development/deployment techniques</li>\n                </ul>\n                Meet me on Slack in the #welcome channel.</td>\n            <td>Medium</td>\n            <td><a href=\"https://developersitalia.slack.com/messages/C8U3ZSM5M\">#welcome</a></td>\n        </tr>\n    </tbody>\n</table>\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_t",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "FAQ - Domande frequenti",
        "lang": "it",
        "layout": "faqs",
        "pills": [{
          "title": "tag",
          "link": "#"
        }, {
          "title": "label",
          "link": "#"
        }],
        "slug": "faq",
        "ext": ".md",
        "tags": [],
        "excerpt": "\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/faq",
        "url": "/it/faq/",
        "text": "",
        "html": "\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_u",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "layout": "home",
        "lang": "it",
        "title": "Developers Italia",
        "description": "La comunità italiana degli sviluppatori di servizi pubblici",
        "permalink": "/",
        "top_projects_link": "/it/progetti",
        "image": "/assets/icons/logo-it.png",
        "redirect_from": ["/it", "/it/"],
        "slug": "index",
        "ext": ".md",
        "tags": [],
        "excerpt": "\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/index",
        "url": "/",
        "text": "",
        "html": "\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_x",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "Progetti",
        "layout": "projects",
        "lang": "it",
        "redirect_from": ["/it/projects"],
        "slug": "progetti",
        "ext": ".md",
        "tags": [],
        "excerpt": "\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/progetti",
        "url": "/it/progetti/",
        "text": "",
        "html": "\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_4",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "FatturaPA",
        "subtitle": "The electronic invoice",
        "logo": "/assets/images/logo-fatturapa@2x.png",
        "payoff": "The electronic invoice between the Governemnt and the private sector",
        "description": "An XML format to describe without ambiguity an invoice: discover how this can be useful, even between the businesses in the private sector, and how integrate this in your software.\n",
        "lang": "en",
        "order": 5,
        "highlight": false,
        "comingsoon": true,
        "layout": "project",
        "slug": "fatturapa",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"coming-soon\">Coming soon…</h2>\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/fatturapa",
        "url": "/en/fatturapa/",
        "text": "",
        "html": "<h2 id=\"coming-soon\">Coming soon…</h2>\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoh_9",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "CIE",
        "subtitle": "Carta d'Identità Elettronica",
        "logo": "/assets/images/logo-cie@2x.png",
        "payoff": "Carta d'Identità Elettronica",
        "description": "La nuova CIE è molto più che un documento d'identità: grazie al microprocessore RF può essere letta da dispositivi NFC (es. smartphone), usata per accedere ai varchi e per creare connessioni sicure (TLS) verso i servizi in rete.\n",
        "lang": "it",
        "order": 9,
        "highlight": true,
        "comingsoon": false,
        "layout": "project",
        "github_team": "cie",
        "slug": "cie",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"intro\">Intro</h2>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/cie",
        "url": "/it/cie/",
        "text": "",
        "html": "<h2 id=\"intro\">Intro</h2>\n\n<p>La <a href=\"http://www.cartaidentita.interno.gov.it\">Carta d’Identità Elettronica</a>\n(CIE) è giunta alla revisione 3.0, e viene già distribuita potenzialmente a\ncirca il 50% dei cittadini italiani. Entro l’estate 2018, tutte i comuni\nitaliani rilasceranno la CIE.</p>\n\n<p>CIE non è solo un documento d’identità, ma una tecnologia utile per la\nrealizzazione di nuovi servizi offerti ai cittadini, fruibili anche tramite\nsmartphone e tablet, grazie alla presenza di un microchip NFC. Se pensate che\nogni italiano, entro 10 anni, avrà nelle proprie tasche un documento d’identità\nche è anche un token NFC unico e sicuro, è facile immaginare numerose applicazioni:</p>\n\n<ul>\n  <li>\n    <p>Varchi elettronici a basso livello di sicurezza, come per esempio l’accesso alla palestra,\nsemplicemente avvicinando la carta ad un lettore.</p>\n  </li>\n  <li>\n    <p>Attraversamento veloce e sicuro di varchi ad alto livello di sicurezza,\ncome per esempio l’accesso agli stadi.</p>\n  </li>\n  <li>\n    <p>Accesso al trasporto pubblico, magari associato ad un portafoglio virtuale\nper pagare il biglietto.</p>\n  </li>\n  <li>\n    <p>Conferma della presenza sul luogo di lavoro.</p>\n  </li>\n  <li>\n    <p>Check-in in un hotel, senza bisogno di fare fotocopie.</p>\n  </li>\n</ul>\n\n<p>Tutto ciò verrà reso possibile grazie alle funzionalità di identificazione\ne sicurezza contenute nel microprocessore, le cui specifiche sono\naperte e disponibili sia sul portale ufficiale del Ministero degli Interni,\nsia in questa pagina.</p>\n\n<p>Su Developers Italia, infatti, troverai tutte le informazioni tecniche e le librerie\nsoftware per iniziare subito a sviluppare nuovi servizi. Sul forum, avrai anche\naccesso diretto ai progettisti della CIE per avere tutti i chiarimenti tecnici\nnecessari.</p>\n\n<h2 id=\"documentazione\">Documentazione</h2>\n\n<p>Attualmente, la documentazione è disponibile in PDF ma la stiamo convertendo\nsecondo lo standard di Developers Italia:</p>\n\n<p><a href=\"http://www.cartaidentita.interno.gov.it/caratteristiche-del-documento/\">Sezione di informazioni tecniche sul sito ufficiale</a></p>\n\n<p><a href=\"http://www.cartaidentita.interno.gov.it/wp-content/uploads/2016/07/cie_3.0_-_specifiche_chip.pdf\">Specifiche del microprocessore</a></p>\n\n<p><a href=\"\">Progettazione di servizi basati su CIE (in arrivo)</a></p>\n\n<h2 id=\"codice-sorgente\">Codice sorgente</h2>\n\n<p>Abbiamo rilasciato in beta il primo middleware della CIE per Windows, che\nesporta le interfacce CSP e PKCS11. Sono in fase di sviluppo i middleware\nper macOS e Linux, e una libreria di supporto per Android:</p>\n\n<p><a href=\"https://github.com/italia/cie-middleware\">Middleware per Windows</a></p>\n\n<h2 id=\"collaborazione\">Collaborazione</h2>\n\n<p>Utilizziamo il nostro forum per discutere delle tematiche tecniche, per la\nprogettazione di nuovi servizi, e per riportare problemi. Contattaci pure\nnel canale dedicato alla CIE.</p>\n\n<p><a href=\"https://forum.italia.it/c/cie\">Sezione CIE sul Forum</a></p>\n\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAB",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "Devops Italia",
        "subtitle": "Comunità DevOps per il Cloud della PA",
        "logo": "/assets/images/logo-devops@2x.png",
        "payoff": "Comunità DevOps della PA",
        "description": "DevOps Italia è il punto di riferimento per lo sviluppo delle pratiche di DevOps e del Cloud della pubblica amministrazione - linee guida, strumenti e un forum per favorire la collaborazione e promuovere il paradigma del Cloud nello sviluppo dei servizi pubblici.",
        "lang": "it",
        "order": 4,
        "highlight": true,
        "comingsoon": false,
        "layout": "project",
        "github_team": "devops",
        "maintainers": ["paolo", "giuseppe"],
        "socials": [{
          "name": "twitter",
          "icon": "twitter",
          "link": "//twitter.com/DevopsITA"
        }],
        "slug": "devops",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"intro-e-manifesto\">Intro e Manifesto</h2>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/devops",
        "url": "/it/devops/",
        "text": "",
        "html": "<h2 id=\"intro-e-manifesto\">Intro e Manifesto</h2>\n\n<p>Le inarrestabili innovazioni del Cloud computing hanno messo in discussione molti dei tradizionali modelli tecnologici e organizzativi delle infrastrutture IT. In particolare scalabilità, affidabilità ed elasticità sono diventate proprietà imprescindibili per le moderne infrastrutture.</p>\n\n<p>Sulla base di queste nuove esigenze l’organizzazione delle infrastrutture IT sta cambiando ed è in atto una vera e propria rivoluzione che impatta radicalmente sui profili, sull’attitudine e sulle competenze degli stakeholder coinvolti.</p>\n\n<p>Questo cambiamento sta dando vita ad una comunità tecnica allargata composta da System Administrator, Network Architect, DevOps, Site Reliability Engineering, Operations Manager che è sempre alla continua ricerca dei modi migliori per costruire e amministrare infrastrutture IT,  mettendo a fattore comune le esperienze acquisite ed aiutando gli altri a fare lo stesso.</p>\n\n<p>La Pubblica Amministrazione (PA) italiana ha avviato un importante processo di trasformazione digitale attraverso il Piano Triennale 2017-2019 che richiede un cambio di paradigma caratterizzato dall’adozione del Cloud e delle metodologie agile. Saranno le competenze della PA nell’ambito di questi processi e tecnologie a determinare il successo di questo rinnovamento tecnologico, organizzativo e culturale.</p>\n\n<p>Da queste necessità nasce la comunità DevOps dei servizi digitali che avrà il compito di costruire, condividere, promuovere e consolidare le nuove competenze tecnologiche nel settore pubblico per guidare e sostenere la trasformazione digitale del Paese.</p>\n\n<p>La comunità è aperta a tutte e tutti i lavoratori, professionisti, esperti, cultori e promotori di tecnologie nel settore IT che vogliano contribuire al mantenimento ed allo sviluppo armonico dell’insieme dei servizi digitali pubblici.</p>\n\n<p>I partecipanti si propongono di:</p>\n\n<ol>\n  <li>condividere informazioni, soluzioni e competenze utili per mantenere, aggiornare, aumentare l’affidabilità dei sistemi e per automatizzare le procedure;</li>\n  <li>implementare, promuovere e diffondere l’utilizzo di tecnologie open e open infrastructure nell’ambito della PA;</li>\n  <li>discutere e proporre standard e regolamenti dei servizi digitali.</li>\n</ol>\n\n<h3 id=\"a-chi-si-rivolge-la-comunità\">A chi si rivolge la comunità?</h3>\n\n<p>Potresti essere interessato a partecipare alla comunità se:</p>\n\n<ul>\n  <li>sei un amministratore di sistema di servizi digitali della PA e vuoi portare i tuoi servizi sul cloud della PA;</li>\n  <li>devi progettare un nuovo servizio digitale o portare un servizio esistente sul Cloud della PA;</li>\n  <li>sviluppi soluzioni e/o hai un ruolo di consulenza per soluzioni utilizzate nella infrastruttura di rete e di servizi della PA;</li>\n  <li>vuoi condividere tecnologie, soluzioni, esperienze o anche semplicemente una tua indicazione/segnalazione utile per lo sviluppo ed il mantenimento dell’infrastruttura IT della PA.</li>\n</ul>\n\n<h3 id=\"come-contribuire\">Come contribuire</h3>\n\n<p>La <a href=\"https://forum.italia.it/c/piano-triennale/data-center-e-cloud\">sezione Cloud e Data Center del forum</a>, aperta a tutti, è dedicata a discutere e condividere informazioni sul Cloud della PA, mentre <a href=\"https://github.com/italia\">Github</a> è dedicato alla raccolta di codice, documentazione e blueprints per lo sviluppo delle infrastrutture Cloud e del processo di Cloud Enablement della PA.</p>\n\n<p>Per tutti i System Administrator, Network Architect, DevOps, Site Reliability Engineering e Operations Manager è aperto il <a href=\"https://developersitalia.slack.com/messages/C9TCMU07R/\">canale Slack #devops</a> sullo <a href=\"https://slack.developers.italia.it\">Slack di Developers Italia</a>.</p>\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAN",
      "_score": 1,
      "_source": {
        "title": "Qual è l'obiettivo di questo sito?",
        "text": "",
        "order": 1,
        "lang": "it",
        "id": "/faqs/it/1",
        "url": "/faqs/it/1.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAW",
      "_score": 1,
      "_source": {
        "title": "Posso proporre di portare in Developers Italia un nuovo progetto?",
        "text": "",
        "order": 70,
        "lang": "it",
        "id": "/faqs/it/70",
        "url": "/faqs/it/70.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCcwsOiQ_CAHoh_T",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Vuoi lavorare per Developers Italia?",
        "subtitle": "Al via una serie di gare per sviluppare codice 100% open-source",
        "release-date": "2017-06-01 16:00:00 +0000",
        "tags": ["progetti", "sviluppatori"],
        "author": "Giovanni Bajo",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": ["/progetti/sviluppatori/2017/06/01/vuoi-lavorare-developers-italia.html"],
        "slug": "vuoi-lavorare-developers-italia",
        "ext": ".md",
        "excerpt": "<p>Vuoi lavorare per Developers Italia? Sei un’azienda specializzata in tecnologie e framework open source, e vuoi aiutare il tuo Paese a sviluppare servizi digitali innovativi? Allora stiamo cercando proprio te!</p>\n\n",
        "id": "/news/2017/06/01/vuoi-lavorare-developers-italia",
        "url": "/news/2017/06/01/vuoi-lavorare-developers-italia.html",
        "text": " Jun 1, 2017 Vuoi lavorare per Developers Italia? Al via una serie di gare per sviluppare codice 100% open-source di Giovanni Bajo condividi su Twitter Vuoi lavorare per Developers Italia? Sei un’azienda specializzata in tecnologie e framework open source, e vuoi aiutare il tuo Paese a sviluppare servizi digitali innovativi? Allora stiamo cercando proprio te! Perché la comunità di Developers Italia possa crescere, il Team per la Trasformazione Digitale ha stanziato un budget di un milione di euro da investire nello sviluppo di codice 100% open source, tramite alcune gare rivolte a piccole aziende e startup con una forte componente tecnologica e con lo sviluppo open source nel proprio DNA. Per aiutarci a selezionare le aziende specializzate in queste tecnologie nell’ampio panorama digitale italiano, abbiamo chiesto l’aiuto alle numerose community tecnologiche presenti sul territorio. In questo post sul forum troverete tutti i dettagli. condividi su Twitter argomenti progetti sviluppatori ",
        "html": "<p>Vuoi lavorare per Developers Italia? Sei un’azienda specializzata in tecnologie e framework open source, e vuoi aiutare il tuo Paese a sviluppare servizi digitali innovativi? Allora stiamo cercando proprio te!</p>\n\n<p>Perché la comunità di Developers Italia possa crescere, il Team per la Trasformazione Digitale ha stanziato un budget di un milione di euro da investire nello sviluppo di codice 100% open source, tramite alcune gare rivolte a piccole aziende e startup con una forte componente tecnologica e con lo sviluppo open source nel proprio DNA.</p>\n\n<p>Per aiutarci a selezionare le aziende specializzate in queste tecnologie nell’ampio panorama digitale italiano, abbiamo chiesto l’aiuto alle numerose community tecnologiche presenti sul territorio.</p>\n\n<p>In questo <a href=\"https://forum.italia.it/t/vuoi-lavorare-per-developers-italia-questo-e-il-tuo-momento/311\">post sul forum</a> troverete tutti i dettagli.</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCcwsOiQ_CAHoh_U",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Nasce Hack.Developers, il più grande code sprint mai realizzato in Italia",
        "subtitle": "Il 7 e 8 Ottobre, partecipa in più di 20 sedi nel territorio per costruire una PA a misura di cittadino",
        "release-date": "2017-07-27 16:00:00 +0000",
        "tags": ["hackathon", "eventi", "sviluppatori"],
        "author": "Giovanni Bajo",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": ["/hackathon/eventi/sviluppatori/2017/07/27/hack-developers-hackathon-per-pubblica-amministrazione.html"],
        "slug": "hack-developers-hackathon-per-pubblica-amministrazione",
        "ext": ".md",
        "excerpt": "<p>Probabilmente sarete pronti a partire per le vacanze, ma prima segnate in agenda le date del <strong>7 e 8 ottobre 2017</strong> perché il <a href=\"https://teamdigitale.governo.it/\">Team per la Trasformazione Digitale</a>, in collaborazione con <a href=\"https://codemotionworld.com/\">Codemotion</a>, organizza <a href=\"https://hack.developers.italia.it\">Hack Developers Italia</a>, il più grande code sprint mai realizzato in Italia.</p>\n\n",
        "id": "/news/2017/07/27/hack-developers-hackathon-per-pubblica-amministrazione",
        "url": "/news/2017/07/27/hack-developers-hackathon-per-pubblica-amministrazione.html",
        "text": " Jul 27, 2017 Nasce Hack.Developers, il più grande code sprint mai realizzato in Italia Il 7 e 8 Ottobre, partecipa in più di 20 sedi nel territorio per costruire una PA a misura di cittadino di Giovanni Bajo condividi su Twitter Probabilmente sarete pronti a partire per le vacanze, ma prima segnate in agenda le date del 7 e 8 ottobre 2017 perché il Team per la Trasformazione Digitale, in collaborazione con Codemotion, organizza Hack Developers Italia, il più grande code sprint mai realizzato in Italia. Durante quel weekend tutte le tech community italiane e gli sviluppatori potranno partecipare alla maratona di programmazione organizzata in contemporanea in oltre 20 città su tutto il territorio nazionale. L’obiettivo è costruire insieme una Pubblica Amministrazione a misura di cittadino, rendendo i servizi pubblici più accessibili, semplici ed efficaci. All’hackathon si può partecipare in due modi: iscrivendosi come partecipante oppure candidandosi come host per una sede locale su territorio Le challenge saranno pubblicate nel corso dei prossimi mesi, ma per una prima indicazione dei contenuti tecnologici abbiamo creato una pagina dedicata. Le sedi dirette organizzate da Codemotion saranno Torino, Milano, Firenze, Roma e Bari. Per le altre sedi è aperta da oggi una Call 4 Hosts. Per qualsiasi altra informazione, abbiamo creato una pagina di FAQ. Vi aspettiamo! UPDATE: c’è anche un thread nel forum per avere maggiori informazioni. condividi su Twitter argomenti hackathon eventi sviluppatori ",
        "html": "<p>Probabilmente sarete pronti a partire per le vacanze, ma prima segnate in agenda le date del <strong>7 e 8 ottobre 2017</strong> perché il <a href=\"https://teamdigitale.governo.it/\">Team per la Trasformazione Digitale</a>, in collaborazione con <a href=\"https://codemotionworld.com/\">Codemotion</a>, organizza <a href=\"https://hack.developers.italia.it\">Hack Developers Italia</a>, il più grande code sprint mai realizzato in Italia.</p>\n\n<p>Durante quel weekend tutte le tech community italiane e gli sviluppatori potranno partecipare alla maratona di programmazione organizzata <strong>in contemporanea in oltre 20 città</strong> su tutto il territorio nazionale. L’obiettivo è costruire insieme una Pubblica Amministrazione a misura di cittadino, rendendo i servizi pubblici più accessibili, semplici ed efficaci.</p>\n\n<p><img src=\"/assets/posts/hackdevelopers.png\" alt=\"Developers\" /></p>\n\n<p>All’hackathon si può partecipare in due modi:</p>\n\n<ul>\n  <li><a href=\"http://codemotion.us2.list-manage.com/subscribe?u=a31186bb93e8a168030b2c424&amp;id=32376a094a\">iscrivendosi come partecipante</a></li>\n</ul>\n\n<p>oppure</p>\n\n<ul>\n  <li><a href=\"https://hack.developers.italia.it/call-4-hosts/\">candidandosi come host per una sede locale su territorio</a></li>\n</ul>\n\n<p>Le challenge saranno pubblicate nel corso dei <a href=\"https://hack.developers.italia.it/roadmap/\">prossimi mesi</a>, ma per una prima indicazione dei contenuti tecnologici abbiamo creato una <a href=\"https://hack.developers.italia.it/challenge/\">pagina dedicata</a>. Le <a href=\"https://hack.developers.italia.it/#text-7\">sedi</a> dirette organizzate da Codemotion saranno Torino, Milano, Firenze, Roma e Bari. Per le altre sedi è aperta da oggi una <a href=\"https://hack.developers.italia.it/call-4-hosts/\">Call 4 Hosts</a>.</p>\n\n<p>Per qualsiasi altra informazione, abbiamo creato una pagina di <a href=\"https://hack.developers.italia.it/faq/\">FAQ</a>.</p>\n\n<p>Vi aspettiamo!</p>\n\n<p><em>UPDATE</em>: c’è anche un <a href=\"https://forum.italia.it/t/hack-developers-lhackathon-di-developers-italia/1135/4\">thread nel forum</a> per avere maggiori informazioni.</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCkdsOiQ_CAHoh_f",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Un ambiente di test aperto a tutti per ANPR",
        "subtitle": "Da oggi chiunque può sviluppare dei client che si interfacciano all'anagrafe nazionale",
        "release-date": "2018-05-23 09:00:00 +0000",
        "tags": ["developers", "opensource", "anpr"],
        "author": "Francesco De Augustinis",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": [null],
        "slug": "un-ambiente-di-test-aperto-a-tutti-per-anpr",
        "ext": ".md",
        "excerpt": "<p>Abbiamo rilasciato <strong>il codice e le credenziali</strong> per poter accedere all’ambiente di test dell’Anagrafe nazionale della popolazione residente (<a href=\"https://teamdigitale.governo.it/it/projects/anpr.htm\">ANPR</a>).</p>\n\n",
        "id": "/news/2018/05/23/un-ambiente-di-test-aperto-a-tutti-per-anpr",
        "url": "/news/2018/05/23/un-ambiente-di-test-aperto-a-tutti-per-anpr.html",
        "text": " May 23, 2018 Un ambiente di test aperto a tutti per ANPR Da oggi chiunque può sviluppare dei client che si interfacciano all'anagrafe nazionale di Francesco De Augustinis condividi su Twitter Abbiamo rilasciato il codice e le credenziali per poter accedere all’ambiente di test dell’Anagrafe nazionale della popolazione residente (ANPR). Si tratta di un passaggio molto importante per lo sviluppo dell’anagrafe nazionale, perché permette a qualsiasi sviluppatore di lavorare più liberamente all’integrazione con ANPR, anche senza disporre delle credenziali di un comune Da questo momento infatti è disponibile una pagina dove richiedere le credenziali per accedere all’ambiente di test di ANPR. Grazie a queste credenziali e alla condivisione del codice sorgente di un client, da oggi chiunque potrà sviluppare un proprio client che si interfacci ad ANPR, utilizzando un Comune di test fittizio. Una vera e propria apertura, che potrà accelerare il processo di diffusione dell’anagrafe e di servizi che si integrano con essa su tutto il territorio nazionale. Approfondimenti: Tutti i numeri di ANPR La guida per i Comuni ad ANPR A presto! Il team Developers Italia condividi su Twitter argomenti developers opensource anpr ",
        "html": "<p>Abbiamo rilasciato <strong>il codice e le credenziali</strong> per poter accedere all’ambiente di test dell’Anagrafe nazionale della popolazione residente (<a href=\"https://teamdigitale.governo.it/it/projects/anpr.htm\">ANPR</a>).</p>\n\n<p>Si tratta di un passaggio molto importante per lo sviluppo dell’<strong>anagrafe nazionale</strong>, perché permette a qualsiasi sviluppatore di lavorare più liberamente all’integrazione con ANPR, anche senza disporre delle credenziali di un comune</p>\n\n<p>Da questo momento infatti è disponibile <a href=\"https://anpr-test.bobuild.com/request\">una pagina</a> dove richiedere le credenziali per accedere all’ambiente di test di ANPR. Grazie a queste credenziali e <a href=\"https://github.com/italia/anpr-client-example\">alla condivisione del codice sorgente di un client</a>, da oggi chiunque potrà sviluppare un proprio client che si interfacci ad ANPR, utilizzando <strong>un Comune di test fittizio</strong>.</p>\n\n<p>Una vera e propria apertura, che potrà accelerare il processo di diffusione dell’anagrafe e di servizi che si integrano con essa su tutto il territorio nazionale.</p>\n\n<p><strong>Approfondimenti:</strong></p>\n<ul>\n  <li><a href=\"https://teamdigitale.governo.it/it/projects/anpr.htm\">Tutti i numeri di ANPR</a></li>\n  <li><a href=\"https://anpr.interno.it/guida-anpr\">La guida per i Comuni ad ANPR</a></li>\n</ul>\n\n<p>A presto!</p>\n\n<p>Il team Developers Italia</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCrcsOiQ_CAHoh_m",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "Privacy Policy",
        "lang": "en",
        "layout": "page",
        "slug": "privacy-policy",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h3 id=\"privacy-policy\">Privacy Policy</h3>\n<p>In questa pagina si descrivono le modalità e le condizioni del trattamento dei dati personali degli utenti (di seguito, anche gli Utenti) che consultano e utilizzano il sito: <a href=\"http://developers.italia.it\">http://developers.italia.it</a> (di seguito, anche il Sito).\nL’informativa è resa ai sensi dell’art. 13 del D. Lgs. n. 196/2003 - Codice in materia di protezione dei dati personali a tutti gli Utenti che, interagendo con il Sito, forniscono al gestore dello stesso i propri dati personali.\nLa validità dell’informativa contenuta nella presente pagina è limitata al solo Sito e non si estende ad altri siti web eventualmente consultabili mediante collegamento ipertestuale.</p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/privacy-policy",
        "url": "/en/privacy-policy/",
        "text": "",
        "html": "<h3 id=\"privacy-policy\">Privacy Policy</h3>\n<p>In questa pagina si descrivono le modalità e le condizioni del trattamento dei dati personali degli utenti (di seguito, anche gli Utenti) che consultano e utilizzano il sito: <a href=\"http://developers.italia.it\">http://developers.italia.it</a> (di seguito, anche il Sito).\nL’informativa è resa ai sensi dell’art. 13 del D. Lgs. n. 196/2003 - Codice in materia di protezione dei dati personali a tutti gli Utenti che, interagendo con il Sito, forniscono al gestore dello stesso i propri dati personali.\nLa validità dell’informativa contenuta nella presente pagina è limitata al solo Sito e non si estende ad altri siti web eventualmente consultabili mediante collegamento ipertestuale.</p>\n\n<p>Il Titolare del trattamento per i dati raccolti attraverso il Sito è AgID - Agenzia per l’Italia Digitale, con sede in via Liszt 21 - 00144 Roma, indirizzo email <a href=\"mailto:protocollo@pec.agid.gov.it\">protocollo@pec.agid.gov.it</a>.\nEventuali soggetti terzi ai quali i dati potrebbero essere comunicati per l’esecuzione di operazioni di trattamento connesse con le finalità specificate nella presente informativa, saranno preventivamente designati dal Titolare quali Responsabili del trattamento ai sensi dell’art. 29 del Codice in materia di protezione dei dati personali.\nI dati personali degli utenti diversi da quelli che l’utente pubblicherà direttamente sul sito nell’apposita area di discussione non formeranno oggetto di discussione.</p>\n\n<p>Tutti i dati personali forniti attraverso il Sito saranno trattati in modo lecito e secondo correttezza al fine di fornire i servizi richiesti nonché di rispondere alle comunicazioni ed alle domande degli Utenti, sempre nel perseguimento degli scopi istituzionali dell’Agenzia così come previsti dalla Legge.</p>\n\n<p>I dati personali sono trattati con strumenti automatizzati per il tempo strettamente necessario a conseguire gli scopi per cui sono stati raccolti secondo quanto previsto dall’art. 11, lett. e) del Codice privacy. L’Agenzia adotta tutte le misure di sicurezza previste dal Codice privacy per proteggere i dati raccolti, al fine di scongiurare i rischi di perdita o furto dei dati, accessi non autorizzati, usi illeciti e non corretti.\nGli Utenti possono esercitare in qualsiasi momento i diritti previsti dall’art. 7 del Codice privacy, al fine di ottenere la conferma dell’esistenza o meno dei loro dati personali e di conoscerne il contenuto e l’origine, verificarne l’esattezza o chiederne l’integrazione o l’aggiornamento, oppure la rettificazione. Ai sensi della medesima disposizione l’Utente potrà inoltre chiedere la cancellazione, la trasformazione in forma anonima o il blocco dei dati trattati in violazione di legge, nonché opporsi in ogni caso, per motivi legittimi, al loro trattamento.\nLe richieste vanno inviate al seguente indirizzo: <a href=\"mailto:protocollo@pec.agid.gov.it\">protocollo@pec.agid.gov.it</a>. Attraverso il medesimo indirizzo, l’Utente potrà chiedere inoltre la lista aggiornata di tutti i Responsabili del trattamento nominati dal Titolare.\nLa presente Privacy Policy è soggetta ad aggiornamenti; gli Utenti sono pertanto invitati a verificarne periodicamente il contenuto.</p>\n\n<h3 id=\"cookies-policy\">Cookies policy</h3>\n<p>I cookies sono piccoli file di testo che i siti visitati inviano al terminale dell’Utente, dove vengono memorizzati, per poi essere ritrasmessi agli stessi siti alla visita successiva.\nIl sito utilizza:</p>\n<ul>\n  <li>\n    <p>cookies analytics utilizzati per raccogliere informazioni, in forma aggregata, sul numero degli Utenti e su come gli stessi visitano il Sito. Il sito dell’Agenzia dell’Italia Digitale si avvale del servizio Google Analytics, la cui cookie policy può essere visionata a <a href=\"https://developers.google.com/analytics/devguides/collection/analyticsjs/cookie-usage\">questo link</a>. Al fine di rispettare la privacy dei nostri utenti, il servizio è utilizzato con la modalità “_anonymizeIp” che consente di mascherare gli indirizzi IP degli utenti che navigano sul sito internet: <a href=\"https://support.google.com/analytics/answer/2763052?hl=it\">maggiori informazioni sulla funzionalità</a>. I dati sono raccolti all’unico fine di elaborare informazioni statistiche anonime sull’uso del Sito e per verificare il corretto funzionamento dello stesso.\nI cookies utilizzati dal Sito non consentono la raccolta di informazioni personali relative all’utente e si cancellano automaticamente con la chiusura del browser di navigazione.\nI dati di navigazione sono cancellati subito dopo la relativa elaborazione statistica e in ogni caso non vengono conservati per oltre 7 giorni dal momento della raccolta, salvo che la loro ulteriore conservazione non si renda necessaria per l’accertamento di reati.\nI cookies non sono utilizzati per attività di profilazione dell’Utente.\nL’Utente può scegliere di abilitare o disabilitare i cookies intervenendo sulle impostazioni del proprio browser di navigazione secondo le istruzioni rese disponibili dai relativi fornitori ai link di seguito indicati.</p>\n\n    <ul>\n      <li><a href=\"https://support.google.com/chrome/answer/95647?co=GENIE.Platform%3DDesktop&amp;hl=en\">Chrome</a></li>\n      <li><a href=\"https://support.mozilla.org/it/kb/Attivare%20e%20disattivare%20i%20cookie\">Firefox</a></li>\n      <li><a href=\"https://support.apple.com/en-us/HT201265\">Safari</a></li>\n      <li><a href=\"https://support.microsoft.com/en-us/help/17442/windows-internet-explorer-delete-manage-cookies\">Internet Explorer</a></li>\n      <li><a href=\"http://help.opera.com/Windows/10.00/en/cookies.html\">Opera</a></li>\n    </ul>\n  </li>\n</ul>\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDeEsOiQ_CAHoh_n",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "Projects",
        "layout": "projects",
        "lang": "en",
        "redirect_from": ["/en/projects"],
        "slug": "projects",
        "ext": ".md",
        "tags": [],
        "excerpt": "\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/projects",
        "url": "/en/projects/",
        "text": "",
        "html": "\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_p",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "What can I do?",
        "subtitle": "Open issues in the Developers Italia repositories",
        "lang": "en",
        "layout": "github-issues",
        "slug": "to-do",
        "ext": ".md",
        "tags": [],
        "excerpt": "<p>Do you want to help us but you don’t know what to do?\nHere’s a list of issues from our GitHub organization <a href=\"https://github.com/italia\" title=\"Italia on Github\">@italia</a> with the <em>help wanted</em> label. You can use the filters to find what activity could suit you best!</p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/to-do",
        "url": "/en/to-do/",
        "text": "",
        "html": "<p>Do you want to help us but you don’t know what to do?\nHere’s a list of issues from our GitHub organization <a href=\"https://github.com/italia\" title=\"Italia on Github\">@italia</a> with the <em>help wanted</em> label. You can use the filters to find what activity could suit you best!</p>\n\n<h2 class=\"u-textWeight-400 u-margin-top-l\" id=\"open-issues\">Open issues</h2>\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_q",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "API",
        "subtitle": "Presentiamo qui una selezione di API della Pubblica Amministrazione su cui Developers Italia è al lavoro, in vista della creazione del catalogo delle API previsto dal Piano Triennale.",
        "lang": "it",
        "layout": "api",
        "slug": "api",
        "ext": ".md",
        "tags": [],
        "excerpt": "",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/api",
        "url": "/it/api/",
        "text": "",
        "html": "",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_v",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "Note Legali",
        "lang": "it",
        "layout": "page",
        "slug": "note-legali",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h3 id=\"note-legali\">Note Legali</h3>\n<p><a href=\"https://developers.italia.it\">https://developers.italia.it</a> è un sito che ha l’obiettivo di contribuire alla crescita e al coordinamento di una community di sviluppatori interessati allo sviluppo di codice strumentale al funzionamento dei servizi online della pubblica amministrazione.\nIl sito è gestito dall’Agenzia per l’Italia Digitale.</p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/note-legali",
        "url": "/it/note-legali/",
        "text": "",
        "html": "<h3 id=\"note-legali\">Note Legali</h3>\n<p><a href=\"https://developers.italia.it\">https://developers.italia.it</a> è un sito che ha l’obiettivo di contribuire alla crescita e al coordinamento di una community di sviluppatori interessati allo sviluppo di codice strumentale al funzionamento dei servizi online della pubblica amministrazione.\nIl sito è gestito dall’Agenzia per l’Italia Digitale.</p>\n\n<p>In taluni casi (forum di discussione) per accedere ai contenuti e/o fruire dei Servizi potrebbe essere necessario utilizzare delle credenziali rilasciate dai gestori di altri servizi (es: github o google) o registrarsi, richiedendo l’attribuzione di nuove credenziali.\nL’utente prende atto che l’Agenzia, nel corso dell’intero rapporto, lo identificherà quale titolare dei suoi diritti e doveri esclusivamente sulla base dell’identità digitale attribuitagli e rappresentata dalle credenziali (user ID/email e password) che avrà indicato e/o scelto di utilizzare. L’utente si impegna pertanto a custodire tali credenziali e a segnalare immediatamente all’Agenzia – qualora avesse scelto di registrarsi direttamente al Sito – all’indirizzo <a href=\"mailto:protocollo@pec.agid.gov.it\">protocollo@pec.agid.gov.it</a> l’eventuale perdita del controllo esclusivo sulle stesse, prendendo atto della circostanza che, in difetto di tale segnalazione e sino al momento del suo ricevimento, sarà responsabile di ogni azione e condotta posta in essere utilizzando tali credenziali (es: pubblicazione di un contenuto online, richiesta di un Servizio ecc.) e non potrà in alcun modo contestare la fruizione dei servizi o l’accesso ai contenuti connessi all’utilizzo delle citate credenziali.</p>\n\n<p>Qualora l’utente, attraverso taluni Servizi disponibili sul Sito (es. forum di discussione), possa procedere alla pubblicazione, diffusione o comunicazione di contenuti, si impegna a pubblicare, diffondere o comunicare esclusivamente contenuti inidonei a violare la legge e/o qualsivoglia diritto di terzi. \nIn tal caso, inoltre, l’utente dichiara e garantisce di disporre di tutti i diritti necessari alla pubblicazione dei contenuti (testi, immagini, fotografie e/o ritratti, filmati, materiale audiovisivo), avendo, eventualmente, preventivamente ottenuto, ove necessario, tutti i consensi e le liberatorie previsti dalla disciplina vigente, con particolare – ma non esclusivo – riferimento alla legge sul diritto d’autore e alla disciplina sulla privacy.\nL’Utente si impegna sin d’ora a manlevare e mantenere garantite ed indenni l’Agenzia per l’Italia digitale da ogni richiesta, anche risarcitoria, proposta e/o derivante, direttamente ovvero indirettamente, dall’utilizzo da parte dell’utente medesimo dei Servizi e/o dalla pubblicazione di qualsivoglia contenuto. Ai fini di tale manleva, si considererà imputabile all’utente qualsivoglia condotta posta in essere utilizzando le credenziali a quest’ultimo attribuite, salvo non ne venga comunicata la perdita alla Società in epoca anteriore alla citata condotta. \nResta inteso che l’Agenzia per l’Italia digitale si riserva il diritto di rimuovere in qualsiasi momento qualsiasi contenuto pubblicato dall’utente attraverso i servizi a fronte della segnalazione di una pretesa violazione di diritti di terzi o comunque a proprio insindacabile giudizio. \nL’Utente concede all’Agenzia per l’Italia digitale il diritto e la licenza, non soggetti ad alcun compenso – e come tali completamente gratuiti – e non esclusivi, di utilizzare, adattare, pubblicare, distribuire, riprodurre ed eseguire senza limitazioni territoriali e/o temporali quanto trasmesso, inviato e pubblicato dall’Utente attraverso i servizi. \nLe previsioni che precedono relative alla pubblicazione di contenuti attraverso il sito non si applicano alla pubblicazione di codice sorgente attraverso il servizio Github richiamato dal sito. Tale pubblicazione rimane assoggettata alle condizioni di utilizzo accettate dagli utenti all’atto dell’accesso alla relativa piattaforma di discussione.</p>\n\n<p>La titolarità di tutti i documenti e contenuti (testi, presentazioni, immagini, foto, video, ecc.) è dell’Agenzia per l’Italia Digitale.\nLa visualizzazione, il download e qualunque utilizzo dei dati pubblicati sul Sito comporta accettazione delle presenti note legali e delle condizioni della licenza con cui sono pubblicati.\nSalvo ove diversamente indicato, i contenuti pubblicati sul presente sito sono messi a disposizione con licenza CC–BY 3.0, il cui testo integrale è disponibile al seguente indirizzo: <a href=\"https://creativecommons.org/licenses/by/3.0/it/legalcode\">https://creativecommons.org/licenses/by/3.0/it/legalcode</a>.\nQuesto significa che, ove non diversamente specificato, i contenuti di questo sito sono liberamente distribuibili e riutilizzabili, a patto che sia sempre citata la fonte e – ove possibile – riportato l’indirizzo web della pagina originale.\nIl codice sorgente del Sito è invece disponibile qui sulla piattaforma Github e, pertanto, riutilizzabile nei limiti di cui alla relativa licenza.\nL’Agenzia per l’Italia Digitale si impegna costantemente per assicurare la qualità delle informazioni pubblicate sul sito, nonché la loro integrità, aggiornamento , completezza, tempestività , semplicità di consultazione e accessibilità.\nPer qualunque segnalazione o suggerimento è possibile scrivere all’indirizzo <a href=\"mailto:protocollo@pec.agid.gov.it\">protocollo@pec.agid.gov.it</a>.\nIn nessun caso l’Agenzia per l’Italia Digitale può essere ritenuta responsabile dei danni di qualsiasi natura causati direttamente o indirettamente dall’accesso al sito, dall’incapacità o impossibilità di accedervi.\nI collegamenti a siti esterni, indicati nel presente sito, sono forniti come semplice servizio agli utenti, con esclusione di ogni responsabilità sulla correttezza e sulla completezza dell’insieme dei collegamenti indicati.\nL’indicazione dei collegamenti non implica da parte dell’Agenzia per l’Italia Digitale alcun tipo di approvazione o condivisione di responsabilità in relazione alla legittimità, alla completezza e alla correttezza delle informazioni contenute nei siti indicati.</p>\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_z",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "18App and Carta Docente",
        "subtitle": "Bonus culture and education",
        "logo": "/assets/images/logo-18app-cartadocente@2x.png",
        "payoff": "The platform where to spend the culture and education's bonus",
        "description": "If you are a business owner and want to integrate with the platform here you can find all the detailed information about how to do it efficiently\n",
        "lang": "en",
        "order": 3,
        "highlight": false,
        "comingsoon": false,
        "layout": "project",
        "github_team": "18app",
        "socials": [{
          "name": "twitter",
          "icon": "twitter",
          "link": "//twitter.com/18app"
        }, {
          "name": "facebook",
          "icon": "facebook",
          "link": "//facebook.com/18app/"
        }],
        "slug": "18app",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"coming-soon\">Coming soon…</h2>\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/18app",
        "url": "/en/18app/",
        "text": "",
        "html": "<h2 id=\"coming-soon\">Coming soon…</h2>\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_2",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "DAF",
        "subtitle": "Data & Analytics Framework",
        "logo": "/assets/images/logo-daf-temp.png",
        "payoff": "Mine the value of public datasets",
        "description": "DAF's vision is to make public data easy to access and understand by PAs to support them in their data driven decision making, and to facilitate access to information that can be made public by citizens and businesses.\n",
        "lang": "en",
        "order": 3,
        "highlight": true,
        "comingsoon": false,
        "layout": "project",
        "github_team": "daf",
        "maintainers": ["alessandro", "fabiana"],
        "slug": "daf",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"intro\">Intro</h2>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/daf",
        "url": "/en/daf/",
        "text": "",
        "html": "<h2 id=\"intro\">Intro</h2>\n\n<p>The <a href=\"http://pianotriennale-ict.readthedocs.io/en/latest/doc/09_data-analytics-framework.html\">Data &amp; Analytics Framework (DAF)</a> is part of the activities aimed\nat enhancing the national public information heritage. DAF aims to\ndevelop and simplify the interoperability of public data between PAs,\nstandardize and promote the dissemination of <em>open data</em>, optimize data\nanalysis processes and generate knowledge. The idea is to open the world\nof public administration to the benefits offered by modern platforms for\nmanaging and analysing <em>big data</em>.</p>\n\n<p>The DAF is based on a <strong>big data platform</strong>, composed of: a <em>data lake,</em>\na set of <em>data engines</em> and tools for data communication.</p>\n\n<p>In the <em>data lake</em> personal data such as: (i) data bases that PA\ngenerates in order to carry out its institutional mandate, in compliance\nwith personal data protection regulations; (ii) data generated by Public\nAdministration’s IT systems such as logs and usage data that do not fall\nunder the previous definition; (iii) authorized data from the web and\nsocial networks of potential public interest, are stored.</p>\n\n<p>The <em>Big Data Engines</em> are useful for harmonizing and processing, both\nin <em>batch</em> mode and <em>real-time</em>, the raw data stored in the <em>Data lake,</em>\nand implementing models of <em>machine learning</em>.</p>\n\n<p>Lastly, data communication tools are useful in favouring the use of data\nprocessed by stakeholders, including through APIs that display data and\nfunctionality to third-party applications.</p>\n\n<h2 id=\"documentation-and-source-code\">Documentation and source code</h2>\n\n<ul>\n  <li><a href=\"https://daf-docs.readthedocs.io/en/latest/\">Technical documentation of DAF</a></li>\n  <li><a href=\"https://github.com/italia?q=daf\">All DAF repositories</a></li>\n  <li><a href=\"https://dataportal.daf.teamdigitale.it/\">Data Portal</a></li>\n</ul>\n\n<h2 id=\"get-in-touch\">Get in touch!</h2>\n\n<p>There are two ways you can get in touch with our team. The first one, for all generic enquiries, is the forum:</p>\n\n<ul>\n  <li><a href=\"https://forum.italia.it/c/daf\">DAF on Forum Italia</a></li>\n</ul>\n\n<p>The second one, for development, is the Slack chat. Just join the <a href=\"https://developersitalia.slack.com/messages/C760XQX9Q\">#daf</a> channel on <a href=\"https://slack.developers.italia.it\">Developers Italia’s Slack</a></p>\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_3",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "dati.gov.it",
        "subtitle": "The open data of the Public Administration",
        "logo": "/assets/images/logo-dati.gov.it@2x.png",
        "payoff": "The open data of the Public Administration",
        "description": "Dati.gov.it is the national list of the open data of the Italian Public Administrations.  It has been created with the aim to aggregate in a single portal most of the open data displayed by the various administrations both local and national.\n",
        "lang": "en",
        "order": 2,
        "highlight": true,
        "comingsoon": false,
        "layout": "project",
        "maintainers": ["alessandro", "fabiana", "giorgia", "marcello"],
        "socials": [{
          "name": "twitter",
          "icon": "twitter",
          "link": "//twitter.com/datigovit"
        }, {
          "name": "youtube",
          "icon": "youtube",
          "link": "//www.youtube.com/channel/UCHsqR2YhxeKgFT4rAKVcAAQ"
        }],
        "slug": "datigov",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"intro\">Intro</h2>\n<p>Transparency, reuse and participation are some of the key words that guide the process of the opening of the data and they are inherited from the free software community, which produces for years a high quality software code development model based on the principles of sharing and openness.\nOur aim is to evolve the current online portal of open data to a system that provides developed tools and services shared with the community to extend the potentialities.</p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/datigov",
        "url": "/en/datigov/",
        "text": "",
        "html": "<h2 id=\"intro\">Intro</h2>\n<p>Transparency, reuse and participation are some of the key words that guide the process of the opening of the data and they are inherited from the free software community, which produces for years a high quality software code development model based on the principles of sharing and openness.\nOur aim is to evolve the current online portal of open data to a system that provides developed tools and services shared with the community to extend the potentialities.</p>\n\n<p>As with all the projects of Developers Italia, the portal of open data follows a development model based on a collaborative process  which is typical of the community of developers. The tools that we want to use to structure the development process are:</p>\n\n<ul>\n  <li>A development roadmap agile and public</li>\n  <li>Source code open from the start</li>\n  <li>A public tracking system of the errors</li>\n  <li>Clear documentation of the code and the API</li>\n</ul>\n\n<h2 id=\"documentation\">Documentation</h2>\n\n<p>Waiting for a publication of a further documentation concerning the project, in the meantime here you can find the architectural document:</p>\n\n<p><a href=\"https://docs.google.com/document/d/1dCfbpwmkl-U2kreykRY8YXJct6GOe-r_3qjism5wI2Y/edit\">Architectural document for evolution of dati.gov.it (ITA)</a></p>\n\n<h2 id=\"source-code\">Source code</h2>\n\n<p>Here you can find the actual source code based on DKAN (Drupal), and soon we will publish a document to help you to create the development environment to contribute:</p>\n\n<p><a href=\"https://github.com/FormezPA/dkan\">Repo GitHub for current dati.gov.it</a></p>\n\n<p>While here you can find the repositories related to the evolution of dati.gov.it according to the architectural document:</p>\n\n<p><a href=\"https://github.com/italia/dati.gov.it\">Repo GitHub for evoution of dati.gov.it</a></p>\n\n<p><a href=\"https://github.com/italia/dati-frontendserver\">New frontend server</a></p>\n\n<h2 id=\"collaboration\">Collaboration</h2>\n\n<p>We have already open a mailing list to debate about data and open data, so there you can find the archive of previous discussions and you can sign up to participate. In addition, we have also arranged a public tracker on GitHub:</p>\n\n<p><a href=\"https://groups.google.com/a/teamdigitale.governo.it/forum/#!forum/data\">Mailing-list OpenData &amp; Analytics (ITA)</a></p>\n\n<p><a href=\"https://github.com/italia/dati.gov.it/issues\">Issue tracking</a></p>\n\n<p><a href=\"https://github.com/italia/dati.gov.it/projects\">Development roadmap</a></p>\n\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoh_-",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "DAF",
        "subtitle": "Data & Analytics Framework",
        "logo": "/assets/images/logo-daf-temp.png",
        "payoff": "Valorizziamo il patrimonio informativo pubblico nazionale",
        "description": "La vision del DAF è rendere i dati pubblici di facile accesso e comprensione da parte delle PA per supportarle nel proprio data driven decision making, e di facilitare l'accesso alle informazioni che possono essere rese pubbliche da parte di cittadini e imprese.\n",
        "lang": "it",
        "order": 3,
        "highlight": true,
        "comingsoon": false,
        "layout": "project",
        "github_team": "daf",
        "maintainers": ["alessandro", "fabiana"],
        "slug": "daf",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"intro\">Intro</h2>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/daf",
        "url": "/it/daf/",
        "text": "",
        "html": "<h2 id=\"intro\">Intro</h2>\n\n<p>Il <a href=\"https://pianotriennale-ict.readthedocs.io/it/latest/doc/09_data-analytics-framework.html\">Data &amp; Analytics Framework (DAF)</a> è una delle\nattività atte a valorizzare il patrimonio informativo pubblico nazionale\napprovata dal Governo italiano nell’ambito del <a href=\"https://pianotriennale-ict.italia.it/\">Piano Triennale per\nl’Informatica nella PA (2017-2019)</a>. La\nvision del progetto è quella di rendere i dati pubblici di facile accesso e\ncomprensione da parte delle PA per supportarle nel proprio processo\ndecisionale, e di facilitare l’accesso alle informazioni che possono essere\nrese pubbliche ai cittadini e alle imprese.</p>\n\n<p>Il DAF si compone di:</p>\n\n<ul>\n  <li>Una <strong>Piattaforma Big Data</strong> costituita da:\n    <ul>\n      <li>un <em>data lake</em> dove vengono memorizzati, nel rispetto delle normative in\nmateria di protezione dei dati personali, dati di potenziale interesse\nquali, ad esempio: le basi di dati che le PA generano per svolgere il\nproprio mandato istituzionale; i dati generati dai sistemi informatici\ndelle Pubbliche Amministrazioni come log e dati di utilizzo che non\nrientrano nella definizione precedente; i dati autorizzati provenienti\ndal web e dai social network di potenziale interesse della Pubblica\nAmministrazione;</li>\n      <li>un <em>big data engine</em>, utile ad armonizzare ed elaborare, sia in modalità\nbatch che real-time, i dati grezzi memorizzati nel data lake e a\nimplementare modelli di machine learning;</li>\n      <li><em>strumenti per l’interscambio dei dati</em>, utili a favorire la fruizione\ndei dati elaborati da parte dei soggetti interessati, anche attraverso\nAPI che espongono dati e funzionalità ad applicazioni terze;</li>\n      <li><em>strumenti di analisi e visualizzazione</em> dei dati offerti in modalità\nself-service agli utilizzatori del DAF;</li>\n    </ul>\n  </li>\n  <li>Un <strong>Dataportal</strong>, che rappresenta l’interfaccia utente per l’utilizzo delle\nfunzionalità implementate nel DAF. In particolare, il dataportal si compone\ndi:\n    <ul>\n      <li>un catalogo dei dataset basato su CKAN, che gestisce i metadati relativi\nsia ai dati contenuti nel DAF che agli open data harvestati dai siti\ndelle PA;</li>\n      <li>interfacce utente per accedere ai tool di analisi e data visualization\nmenzionati sopra;</li>\n      <li>un modulo riservato alle PA per gestire il processo di ingestion e\ngestione dei dati e metadati nel DAF;</li>\n      <li>un modulo per data stories, attraverso il quale gli utenti possono\npubblicare le proprie analisi e collaborare con altri utenti.</li>\n    </ul>\n  </li>\n  <li>Un <strong>team di esperti di dati</strong>, composto da data scientist, data engineer e\nbig data architect che provvedono al disegno e all’evoluzione concettuale\ndella piattaforma big data, alla costruzione di modelli di interconnessione\ndelle diverse sorgenti dati, all’analisi dei dati, allo sviluppo di modelli\ndi machine learning, al coordinamento dello sviluppo di data application e\nall’incentivazione della ricerca scientifica su tematiche di interesse per\nla PA.</li>\n</ul>\n\n<h2 id=\"documentazione\">Documentazione</h2>\n\n<p>Qui puoi trovare la documentazione tecnica attualmente disponibile:</p>\n\n<p><a href=\"http://daf-piano-di-sviluppo.readthedocs.io/it/latest/\">Piano di sviluppo</a></p>\n\n<p><a href=\"https://daf-docs.readthedocs.io/en/latest/\">Documentazione tecnica per sviluppatori</a></p>\n\n<h2 id=\"codice-sorgente\">Codice sorgente</h2>\n\n<p>Attualmente, il DAF è in fase di pieno sviluppo, in tutti i suoi componenti, e i\nprogressi possono essere seguiti direttamente sui vari repositori GitHub:</p>\n\n<p><a href=\"https://github.com/italia/daf\">DAF core (piattaforma big-data)</a></p>\n\n<p><a href=\"https://github.com/italia/daf-dataportal\">Data portal</a></p>\n\n<p><a href=\"https://github.com/italia/daf-publicdata\">Nuovo sito dati.gov.it (opendata)</a></p>\n\n<h2 id=\"collaborazione\">Collaborazione</h2>\n\n<p>Utilizziamo una sezione del forum per discutere di dati, open data e DAF. In precedenza,\navevamo aperto una mailing-list per trattare i temi di dati e opendata, per cui puoi trovare là\nl’archivio delle precedenti discussioni e iscriverti per partecipare. A breve, migreremo l’archivio\ndella mailing-list nel forum.</p>\n\n<p><a href=\"https://forum.italia.it/c/daf\">Discussioni su DAF nel forum</a></p>\n\n<p>Per gli sviluppatori è aperto il canale <a href=\"https://developersitalia.slack.com/messages/C760XQX9Q\">#daf</a> sullo <a href=\"https://slack.developers.italia.it\">Slack di Developers Italia</a></p>\n\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAA",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "Designers Italia",
        "subtitle": "Il Design System della Pubblica Amministrazione Italiana",
        "logo": "/assets/images/logo-design@2x.png",
        "payoff": "Designers dalla parte dei cittadini",
        "description": "designers.italia.it è il punto di riferimento per il design della pubblica amministrazione - linee guida, strumenti e un forum per favorire la collaborazione e promuovere il ruolo dello human centered design nello sviluppo dei servizi pubblici.",
        "lang": "it",
        "order": 4,
        "highlight": true,
        "comingsoon": false,
        "layout": "project",
        "github_team": "design",
        "maintainers": ["matteo", "lorenzo", "danilo", "davide"],
        "socials": [{
          "name": "twitter",
          "icon": "twitter",
          "link": "//twitter.com/DesignersITA"
        }, {
          "name": "behance",
          "icon": "behance",
          "link": "//behance.net/italia"
        }],
        "slug": "design",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"intro\">Intro</h2>\n<p>Il progetto Designers Italia ha anche l’obiettivo  di fornire una serie di strumenti operativi che possano aiutare le pubbliche amministrazioni ad applicare le <a href=\"https://design-italia.readthedocs.io/it/stable/\">Linee Guida di Design</a> dei servizi pubblici digitali.\nL’idea di fondo è fonire dei kit, in alcuni casi del software, che facciano risparmiare tempo e denaro alle PA e che costuiscano una solida base di partenza per lo sviluppo di app (web e mobile) e siti internet.\nAlcune di questi progetti sono già attivi o sono in via di attivazione, altri sono ancora in fase “esplorativa”.\nPer restare aggiornati sull’evoluzione dei progetti consigliamo di seguire la <a href=\"https://designers.italia.it/user-interface/\">roadmap sull’Interface Design</a> e di iscriversi alla <a href=\"https://designers.italia.it/\">newsletter di Designers Italia</a></p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/design",
        "url": "/it/design/",
        "text": "",
        "html": "<h2 id=\"intro\">Intro</h2>\n<p>Il progetto Designers Italia ha anche l’obiettivo  di fornire una serie di strumenti operativi che possano aiutare le pubbliche amministrazioni ad applicare le <a href=\"https://design-italia.readthedocs.io/it/stable/\">Linee Guida di Design</a> dei servizi pubblici digitali.\nL’idea di fondo è fonire dei kit, in alcuni casi del software, che facciano risparmiare tempo e denaro alle PA e che costuiscano una solida base di partenza per lo sviluppo di app (web e mobile) e siti internet.\nAlcune di questi progetti sono già attivi o sono in via di attivazione, altri sono ancora in fase “esplorativa”.\nPer restare aggiornati sull’evoluzione dei progetti consigliamo di seguire la <a href=\"https://designers.italia.it/user-interface/\">roadmap sull’Interface Design</a> e di iscriversi alla <a href=\"https://designers.italia.it/\">newsletter di Designers Italia</a></p>\n\n<h3 id=\"lo-ui-kit\">Lo UI Kit</h3>\n<p>La community dei designers svilupperà un UI Kit basato su Sketch e costruito in maniera aperta e collaborativa su github.\nLa è utile anche per mappare i componenti che a tendere confluiranno nei vari kit che seguono. L’allineamento di Ui Kit e web toolkit è previsto entro fine 2017.</p>\n\n<p>Repo\n <a href=\"https://github.com/italia/design-ui-kit\">https://github.com/italia/design-ui-kit</a></p>\n\n<p>Roadmap su <a href=\"https://docs.google.com/spreadsheets/d/183hI6EBJo3EeiEcQPGZIe3hNN7EerTU5Udk6SkrH2OU/edit?usp=sharing\">Google Spreadsheet</a></p>\n\n<p>Il progetto <a href=\"https://www.behance.net/gallery/53244611/UI-Kit-designers-italia\">su Behance</a></p>\n\n<p><em>Progetti attivi</em></p>\n\n<h2 id=\"italia-web-toolkit\">Italia Web Toolkit</h2>\n<p>Il toolkit rappresenta l’implementazione di riferimento delle linee guida di design della PA.\nContiene fogli di stile CSS, componenti Javascript accessibili e snippet HTML riutilizzabili per lo sviluppo del frontend di siti web della Pubblica Amministrazione conformi alle linee guida di design.</p>\n\n<p>Il toolkit comprende:</p>\n<ul>\n  <li>fogli di stile CSS</li>\n  <li>componenti interattivi (Javascript)</li>\n  <li>snippet e template HTML</li>\n</ul>\n\n<p>Il repository è <a href=\"https://github.com/italia/design-web-toolkit\">https://github.com/italia/design-web-toolkit</a></p>\n\n<p>Per chi vuole utilizzare il toolkit o contribuire allo sviluppo è disponibile la <a href=\"https://italia.github.io/design-web-toolkit/\">documentazione</a></p>\n\n<p>Qui la descrizione completa delle <a href=\"https://italia.github.io/design-web-toolkit/docs/tecnologie.html\">tecnologie utilizate</a></p>\n\n<h2 id=\"designersitaliait\">designers.italia.it</h2>\n<p>Il sito <a href=\"https://designers.italia.it/\">designers.italia.it</a> è lo strumento a supporto della comunità italiana dei Designers.\nIl sito costituisce un importante complemento alle linee guida di design. In esso verranno progressivamente pubblicati blog-post, altri kit non basati sul software, dettagli sui progetti specifici, etc.\nIl sito è basato su (Jekyll)[https://github.com/jekyll/jekyll] ed è basato su <a href=\"https://github.com/italia/designers.italia.it\">questo repository</a>, ovviamente pubblico.</p>\n\n<p><em>Progetti in fase di avvio</em></p>\n\n<h2 id=\"italia-react-toolkit\">Italia React Toolkit</h2>\n<p>Il progetto, ancora in fase di definizione della roadmap, ha come obiettivo quello d costruire un set di componenti ed un layer di presentazione comune  basato su <a href=\"https://github.com/facebook/react/\">React</a> e coerente con le <a href=\"https://design-italia.readthedocs.io/it/stable/\">Linee Guida di Design</a>.\nIl focus del progetto saranno, almeno in una fase iniziale, le web app e/o le applicazione mobile ibride basate su <a href=\"https://facebook.github.io/react-native/\">React Native</a>.\nI pattern di interazione da sviluppare/portare in questo primo tempo saranno appunto quelli tipici di questi casi d’uso.\nE’ ancora in fase di valutazione la possibilità di utilizzare come base o come esempio i progetti <a href=\"https://github.com/ant-design/ant-design/\">Ant Design</a> o <a href=\"https://github.com/callemall/material-ui/tree/v1-beta\">UI Material</a></p>\n\n<h2 id=\"italia-bootstrap-4-toolkit\">Italia Bootstrap 4 Toolkit</h2>\n<p>Il progetto, ancora nella fase di definizione della roadmap, ha come obiettivo quello di portare tutti i componenti e gli elementi di interfaccia presenti nell’<em>Italia Web Toolkit</em> in un kit che abbia <a href=\"https://github.com/twbs/bootstrap\">Bootstrap4</a> come base, da poco entrato in beta.\nLo scopo principale è mettere a disposizione della comunità di sviluppatori, coerentemente con le <a href=\"https://design-italia.readthedocs.io/it/stable/\">Linee Guida di Design</a>, la sintassi, i tool, il parco di plugin e le convenzioni tipiche di uno stumento da molti già consosciuto ed utilizzato, quale appunto Bootstrap.</p>\n\n<p>Il repository di questo progetto è <a href=\"https://github.com/italia/design-bootstrap4\">https://github.com/italia/design-bootstrap4</a></p>\n\n<h2 id=\"i-progetti-futuri\">I progetti futuri</h2>\n\n<p>Alcuni altri progetti sono in valutazione.\nMolti di questi vedranno sicuramente la luce nel 2018, ma al momento non abbiamo ancora una roadmap precisa nè sono state allocate risorse o individuati i potenziali maintainers.\nPer questo ogni contributo è benvenuto, sia anche semplicemente un suggerimento sulla impostazione iniziale o sul set di strumenti che andrebbero integrato. Di seguito la lista dei repositories che nel frattempo abbiamo già creato.</p>\n\n<p><em>Progetti in fase di valutazione</em></p>\n\n<h3 id=\"italia-angular-toolkit\">Italia Angular Toolkit</h3>\n<p>Ovviamente accanto a react saremmo felicid i mettere a disposizione un toolkit per lo sviluppo di web app basate su Angular. Non sono ancora state prese decisioni circa la versione, l’impostazione generale nè l’eventuale (e forse auspicata) compatibilità con il framework <a href=\"https://github.com/ionic-team/ionic\">ionic</a></p>\n\n<p>Repo <a href=\"https://github.com/italia/design-angular\">https://github.com/italia/design-angular</a></p>\n\n<h3 id=\"template-base-per-cms\">Template base per CMS</h3>\n\n<p>Alcuni dei progetti che seguono hanno come obiettivo quello di sviluppare un tema di partenza per i principali CMS. Per tema di partenza intendiamo un tema base o starter theme, una ossatura solida e basata su strumenti di build diffusi che consenta poi lo sviluppo di moduli e template dedicati a determinate situzione o content types.\nOvviamente sarebbe importante che il tema avesse come dipendenza uno dei toolkit che già sono stati presentati, in modo da non bloccare o rischiare di restare disallineati rispetto alla evoluzione dei componenti di UI.</p>\n\n<h3 id=\"tema-joomla-secondo-linee-guida\">Tema Joomla secondo linee guida</h3>\n\n<p>Repo <a href=\"https://github.com/italia/design-joomla-theme\">https://github.com/italia/design-joomla-theme</a></p>\n\n<h3 id=\"tema-drupal-secondo-linee-guida\">Tema Drupal secondo linee guida</h3>\n\n<p>Repo <a href=\"https://github.com/italia/design-drupal-theme\">https://github.com/italia/design-drupal-theme</a></p>\n\n<h3 id=\"tema-wordpress-secondo-linee-guida\">Tema Wordpress secondo linee guida</h3>\n\n<p>Repo <a href=\"https://github.com/italia/design-wordpress-theme\">https://github.com/italia/design-wordpress-theme</a></p>\n\n<h3 id=\"tema-liferay-secondo-linee-guida\">Tema Liferay secondo linee guida</h3>\n<p><a href=\"https://github.com/italia/design-liferay-theme\">https://github.com/italia/design-liferay-theme</a></p>\n\n<h3 id=\"tema-jekyll-secondo-linee-guida\">Tema Jekyll secondo linee guida</h3>\n<p><a href=\"https://github.com/italia/design-jekyll-theme\">https://github.com/italia/design-jekyll-theme</a></p>\n\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAC",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "FatturaPA",
        "subtitle": "La fattura elettronica",
        "logo": "/assets/images/logo-fatturapa@2x.png",
        "payoff": "La fatturazione elettronica verso lo Stato e tra privati",
        "description": "Un formato XML per descrivere in modo non ambiguo una fattura: scopri come può essere utile, anche tra privati, e come integrarlo nei tuoi software gestionali.\n",
        "lang": "it",
        "order": 5,
        "highlight": false,
        "comingsoon": true,
        "layout": "project",
        "slug": "fatturapa",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"in-arrivo\">In arrivo…</h2>\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/fatturapa",
        "url": "/it/fatturapa/",
        "text": "",
        "html": "<h2 id=\"in-arrivo\">In arrivo…</h2>\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAD",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "PagoPA",
        "subtitle": "Nodo di pagamento verso la Pubblica Amministrazione",
        "logo": "/assets/images/logo-pagopa@2x.png",
        "payoff": "Nodo dei Pagamenti verso la Pubblica Amministrazione",
        "description": "Un unico nodo di pagamento, con un'unica interfaccia verso il cittadino, per pagare dai tributi alla gita scolastica dei figli con carte di credito, bonifici o anche via app.",
        "lang": "it",
        "order": 2,
        "highlight": true,
        "comingsoon": false,
        "layout": "project",
        "github_team": "pagopa",
        "slug": "pagopa",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"intro\">Intro</h2>\n<p>PagoPA è il nodo di pagamenti della Pubblica Amministrazione. È una piattaforma che connette tra loro cittadini, Pubblica Amministrazione e i Prestatori di Servizi di Pagamento (PSP) per effettuare pagamenti verso la Pubblica Amministrazione in sicurezza e con semplicità.</p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/pagopa",
        "url": "/it/pagopa/",
        "text": "",
        "html": "<h2 id=\"intro\">Intro</h2>\n<p>PagoPA è il nodo di pagamenti della Pubblica Amministrazione. È una piattaforma che connette tra loro cittadini, Pubblica Amministrazione e i Prestatori di Servizi di Pagamento (PSP) per effettuare pagamenti verso la Pubblica Amministrazione in sicurezza e con semplicità.</p>\n\n<p>Integrare PagoPA rappresenta un grosso vantaggio per le Pubbliche Amministrazioni perché i pagamenti vengono accreditati in tempo reale, vengono correttamente rendicontati e di conseguenza può immediatamente essere rilasciato al cittadino la quietanza con valore legale.</p>\n\n<p>Per un cittadino, PagoPA permette di scegliere il metodo di pagamento tra i diversi a disposizione, a seconda delle comodità e del livello di digitalizzazione. È possibile pagare tramite:</p>\n\n<ul>\n  <li>carta di credito</li>\n  <li>addebito in conto</li>\n  <li>bollettino postale o altre avvisature cartacee</li>\n  <li>forme innovative di pagamenti presenti sul mercato</li>\n</ul>\n\n<p>Stiamo facendo evolvere il sistema in una ottica di mercato integrando canali di pagamento innovativi ed evolvendo l’interfaccia utente e le funzionalità del sistema verso gli standard consolidati sul mercato.</p>\n\n<p>In particolare l’evoluzione più importante riguarda la UI (User Interface) e la UX (User Experience) che entro la fine dell’anno risulteranno pesantemente rinnovate e molto più usabili per il cttadino.</p>\n\n<p>Trovate maggiori informazioni sulla piattaforma <a href=\"https://designers.italia.it/progetti/pagopa/\">Designers Italia</a>.</p>\n\n<h2 id=\"documentazione\">Documentazione</h2>\n<p>Stiamo lavorando ad una revisione profonda della documentazione. Per ora, siamo riusciti a pubblicare in formato più facilmente consultabile i primi documenti che potete leggere di seguito.</p>\n\n<ul>\n  <li><a href=\"https://pagopa-specifichepagamenti.readthedocs.io\">Specifiche Attuative del Nodo dei Pagamenti-SPC</a></li>\n  <li><a href=\"http://pagopa-docs-faq.readthedocs.io\">FAQ</a></li>\n</ul>\n\n<h3 id=\"per-i-comuni\">Per i Comuni</h3>\n<p>Di seguito il link al questionario da completare per comunicare lo stato di avanzamento relativo al progetto pagoPA e i piani di attivazione dei vari servizi</p>\n<ul>\n  <li><a href=\"https://goo.gl/forms/fv0cde8rAFoDNG433\">Link al questionario per i Comuni</a></li>\n</ul>\n\n<h2 id=\"app-di-esempio\">App di esempio</h2>\n\n<p>Ci sono due app di esempio, già perfettamente funzionanti, che contengono anche gli SDK utili agli sviluppatori che volessero realizzare le loro applicazioni per PagoPA.</p>\n\n<ul>\n  <li><a href=\"https://github.com/italia/pagopa-ios-example\">App di esempio iOS</a></li>\n  <li><a href=\"https://github.com/italia/pagopa-android-example\">App di esempio Android</a></li>\n</ul>\n\n<h2 id=\"newsletter\">Newsletter</h2>\n\n\n<form class=\"Form Form--spaced u-padding-all-l u-background-grey-10 u-text-r-xs u-layout-prose u-margin-bottom-xl\"\n      action=\"http://a0x0b4.emailsp.com/frontend/subscribe.aspx\">\n\n        <div class=\"Form-field\">\n            <label class=\"Form-label is-required\" for=\"email\" >Email *</label>\n            <input class=\"Form-input\" id=\"email\" type=\"email\" name=\"email\" aria-required=\"true\" required placeholder=\"Inserisci la tua e-mail\">\n        </div>\n        <fieldset class=\"Form-field Form-field--choose Grid-cell\">\n        \t<legend class=\"Form-legend is-required\">Privacy *</legend>\n        \t<label class=\"Form-label is-required\" for=\"privacy\">\n        \t<input type=\"checkbox\" class=\"Form-input\" id=\"privacy\" name=\"privacy\" aria-required=\"true\" required>\n        \t<span class=\"Form-fieldIcon\" role=\"presentation\"></span>\n        \tAccetto la <a target=\"_blank\" href=\"https://developers.italia.it/it/privacy-policy\">Privacy Policy</a>\n        \t</label>\n        </fieldset>\n    \t<div class=\"Form-field Grid-cell\">\n    \t\t<p class=\"u-text-r-xxs u-margin-bottom-m\" >Quando invii il modulo, controlla la tua inbox per confermare l'iscrizione</p>\n        \t<button type=\"submit\" class=\"Button Button--default u-text-xs\" value=\"true\">Iscriviti</button>\n    \t</div>\n\n    <input type=\"hidden\" name=\"list\" value=\"5\">\n</form>\n\n\n\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAG",
      "_score": 1,
      "_source": {
        "title": "Who is managing this website?",
        "text": "",
        "order": 2,
        "lang": "en",
        "id": "/faqs/en/10",
        "url": "/faqs/en/10.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAI",
      "_score": 1,
      "_source": {
        "title": "How do you choose a project's maintainer?",
        "text": "",
        "order": 4,
        "lang": "en",
        "id": "/faqs/en/30",
        "url": "/faqs/en/30.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCcwsOiQ_CAHoh_R",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Consultazione pubblica sulle linee guida per lo sviluppo e l'acquisizione del software",
        "subtitle": "Pubblicate in consultazione le linee guida in attuazione dell'art. 68 e 69 del CAD",
        "release-date": "2017-04-05 16:00:00 +0000",
        "tags": ["developers", "daf", "gsoc"],
        "author": "Riccardo Iaconelli",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": [null],
        "slug": "linee-guida-in-consultazione",
        "ext": ".md",
        "excerpt": "<p>Ciao a tutti!\nInizia oggi (fino al 5 Maggio 2018) la consultazione sulle <a href=\"https://lg-acquisizione-e-riuso-software-per-la-pa.readthedocs.io/it/latest/\">Linee Guida sul Riuso e Acquisizione del Software nelle Pubbliche Amministrazioni</a> che coprono due temi:</p>\n\n",
        "id": "/news/2017/04/05/linee-guida-in-consultazione",
        "url": "/news/2017/04/05/linee-guida-in-consultazione.html",
        "text": " Apr 5, 2017 Consultazione pubblica sulle linee guida per lo sviluppo e l'acquisizione del software Pubblicate in consultazione le linee guida in attuazione dell'art. 68 e 69 del CAD di Riccardo Iaconelli condividi su Twitter Ciao a tutti! Inizia oggi (fino al 5 Maggio 2018) la consultazione sulle Linee Guida sul Riuso e Acquisizione del Software nelle Pubbliche Amministrazioni che coprono due temi: Il processo di pubblicazione in open source di tutto il software di cui le Pubbliche Amministrazioni abbiano titolarità (realizzato in passato o in futuro), come vuole l’Art 69 del CAD. In particolare, descriviamo come scegliere una licenza, come effettuare un rilascio ai fini del riuso, come prendere a riuso un software open source e come modificarlo, utilizzano Developers Italia come piattaforma di riferimento. Il processo che le amministrazioni dovranno seguire prima di acquisire un software di qualunque tipo, descrivendo quando indicato nell’Art 68 del CAD. Qui abbiamo cercato di indicare in modo chiaro le fasi del processo decisionale che comincia dal chiarire le proprie necessità e verificare la presenza di soluzioni open-source a riuso disponibili, valutando la loro maturità e le personalizzazioni necessarie. Essendo il tema molto tecnico, abbiamo preparato una serie di guide pratiche, da considerarsi allegati alle linee guida ma che seguiranno un processo di evoluzione potenzialmente più rapido, con l’aggiornarsi della tecnologia. Le guide sono pensate per essere usate anche come allegati a gare d’appalto, così da indicare al fornitore il processo corretto da seguire per mettere a riuso o prendere a riuso un software, semplificando quindi l’adempimento. Queste Linee Guida sono frutto di un lavoro congiunto del Team Digitale e AgID. Riteniamo che possa rappresentare un punto di svolta sulla condivisione del software dentro la Pubblica Amministrazione. Per partecipare alla consultazione, potete inviare i vostri commenti nella sezione dedicata del forum Il Team Developers Italia condividi su Twitter argomenti developers daf gsoc ",
        "html": "<p>Ciao a tutti!\nInizia oggi (fino al 5 Maggio 2018) la consultazione sulle <a href=\"https://lg-acquisizione-e-riuso-software-per-la-pa.readthedocs.io/it/latest/\">Linee Guida sul Riuso e Acquisizione del Software nelle Pubbliche Amministrazioni</a> che coprono due temi:</p>\n\n<ul>\n  <li>Il processo di pubblicazione in open source di tutto il software di cui le Pubbliche Amministrazioni abbiano titolarità (realizzato in passato o in futuro), come vuole l’<a href=\"http://cad.readthedocs.io/it/v2017-12-13/_rst/capo6_art69.html\">Art 69 del CAD</a>. In particolare, descriviamo come scegliere una licenza, come effettuare un rilascio ai fini del riuso, come prendere a riuso un software open source e come modificarlo, utilizzano <a href=\"https://developers.italia.it/\">Developers Italia</a> come piattaforma di riferimento.</li>\n  <li>Il processo che le amministrazioni dovranno seguire prima di acquisire un software di qualunque tipo, descrivendo quando indicato nell’<a href=\"http://cad.readthedocs.io/it/v2017-12-13/_rst/capo6_art68.html\">Art 68 del CAD</a>. Qui abbiamo cercato di indicare in modo chiaro le fasi del processo decisionale che comincia dal chiarire le proprie necessità e verificare la presenza di soluzioni open-source a riuso disponibili, valutando la loro maturità e le personalizzazioni necessarie.</li>\n</ul>\n\n<p>Essendo il tema molto tecnico, abbiamo preparato una serie di guide pratiche, da considerarsi allegati alle linee guida ma che seguiranno un processo di evoluzione potenzialmente più rapido, con l’aggiornarsi della tecnologia. Le guide sono pensate per essere usate anche come allegati a gare d’appalto, così da indicare al fornitore il processo corretto da seguire per mettere a riuso o prendere a riuso un software, semplificando quindi l’adempimento.</p>\n\n<p>Queste Linee Guida sono frutto di un lavoro congiunto del Team Digitale e AgID. Riteniamo che possa rappresentare un punto di svolta sulla condivisione del software dentro la Pubblica Amministrazione.</p>\n\n<p>Per partecipare alla consultazione, potete inviare i vostri commenti nella <a href=\"https://forum.italia.it/c/documenti-in-consultazione/lg-acquisizione-e-riuso-di-software-per-la-pa\">sezione dedicata del forum</a></p>\n\n<p>Il Team Developers Italia</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCcwsOiQ_CAHoh_W",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Hack.Developers, ti aspettiamo tra pochi giorni",
        "subtitle": "Sabato e domenica appuntamento in 26 città con Hack.Developers",
        "release-date": "2017-10-03 16:00:00 +0000",
        "tags": ["hackathon", "eventi", "sviluppatori"],
        "author": "Team Developers Italia",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": [null],
        "slug": "hack-developers-ti-aspettiamo",
        "ext": ".md",
        "excerpt": "<p>Ciao a tutti,</p>\n\n<p>Ci siamo! Tra pochi giorni, il <strong>7 e l’8 ottobre 2017</strong>, in venticinque città italiane (e nella “sede estera” di San Francisco) avrà inizio l’atteso <a href=\"https://hack.developers.italia.it\">Hack.Developers</a>, il più grande <em>code sprint</em> mai realizzato in Italia, organizzato dal Team per la Trasformazione Digitale, in collaborazione con <a href=\"https://www.codemotionworld.com\">Codemotion</a>. Due giorni per un solo obiettivo: costruire <strong>una Pubblica Amministrazione a misura di cittadino</strong>, che offra servizi più accessibili, più semplici e più efficaci.</p>\n\n",
        "id": "/news/2017/10/03/hack-developers-ti-aspettiamo",
        "url": "/news/2017/10/03/hack-developers-ti-aspettiamo.html",
        "text": " Oct 3, 2017 Hack.Developers, ti aspettiamo tra pochi giorni Sabato e domenica appuntamento in 26 città con Hack.Developers di Team Developers Italia condividi su Twitter Ciao a tutti, Ci siamo! Tra pochi giorni, il 7 e l’8 ottobre 2017, in venticinque città italiane (e nella “sede estera” di San Francisco) avrà inizio l’atteso Hack.Developers, il più grande code sprint mai realizzato in Italia, organizzato dal Team per la Trasformazione Digitale, in collaborazione con Codemotion. Due giorni per un solo obiettivo: costruire una Pubblica Amministrazione a misura di cittadino, che offra servizi più accessibili, più semplici e più efficaci. 80 community tecnologiche e oltre 800 sviluppatori si sfideranno nello sviluppo di un ecosistema di codice open-source, destinato a diventare il motore per la digitalizzazione del Paese. Se sei un programmatore, un professionista o uno studente dell’IT e non ti sei ancora iscritto, non perdere questa occasione: trova la sede più vicina a te! Ti aspettiamo! condividi su Twitter argomenti hackathon eventi sviluppatori ",
        "html": "<p>Ciao a tutti,</p>\n\n<p>Ci siamo! Tra pochi giorni, il <strong>7 e l’8 ottobre 2017</strong>, in venticinque città italiane (e nella “sede estera” di San Francisco) avrà inizio l’atteso <a href=\"https://hack.developers.italia.it\">Hack.Developers</a>, il più grande <em>code sprint</em> mai realizzato in Italia, organizzato dal Team per la Trasformazione Digitale, in collaborazione con <a href=\"https://www.codemotionworld.com\">Codemotion</a>. Due giorni per un solo obiettivo: costruire <strong>una Pubblica Amministrazione a misura di cittadino</strong>, che offra servizi più accessibili, più semplici e più efficaci.</p>\n\n<p><strong>80 community tecnologiche e oltre 800 sviluppatori</strong> si sfideranno nello sviluppo di un ecosistema di codice open-source, <a href=\"https://hack.developers.italia.it/cose/\">destinato a diventare il motore per la digitalizzazione del Paese</a>. Se sei un programmatore, un professionista o uno studente dell’IT e <strong>non ti sei ancora iscritto</strong>, non perdere questa occasione: <a href=\"https://hack.developers.italia.it/#sedi-registrazioni\">trova la sede più vicina a te</a>!</p>\n\n<p>Ti aspettiamo!</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCcwsOiQ_CAHoh_X",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Hack.Developers, ecco come è andata",
        "subtitle": "800 sviluppatori e 96 proposte open source già disponibili pubblicamente. I numeri di Hack.Developers",
        "release-date": "2017-10-11 14:00:00 +0000",
        "tags": ["hackathon", "eventi", "sviluppatori"],
        "author": "Team Developers Italia",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": [null],
        "slug": "hack-developers-come-e-andata",
        "ext": ".md",
        "excerpt": "<p>Ciao a tutti,</p>\n\n<p>È con grande piacere che vi raccontiamo la bellissima esperienza di <a href=\"https://hack.developers.italia.it\">Hack.Developers</a>, il più grande <em>code sprint</em> mai realizzato in Italia, organizzato dal <a href=\"https://teamdigitale.governo.it/\">Team per la Trasformazione Digitale</a>, in collaborazione con <a href=\"https://www.codemotionworld.com\">Codemotion</a>, che si è tenuto il 7 e l’8 ottobre in 25 città italiane + San Francisco.</p>\n\n",
        "id": "/news/2017/10/11/hack-developers-come-e-andata",
        "url": "/news/2017/10/11/hack-developers-come-e-andata.html",
        "text": " Oct 11, 2017 Hack.Developers, ecco come è andata 800 sviluppatori e 96 proposte open source già disponibili pubblicamente. I numeri di Hack.Developers di Team Developers Italia condividi su Twitter Ciao a tutti, È con grande piacere che vi raccontiamo la bellissima esperienza di Hack.Developers, il più grande code sprint mai realizzato in Italia, organizzato dal Team per la Trasformazione Digitale, in collaborazione con Codemotion, che si è tenuto il 7 e l’8 ottobre in 25 città italiane + San Francisco. I numeri già rendono un’idea di quello che abbiamo vissuto per 48 ore di fila: oltre 800 sviluppatori, 116 team, 80 community, 200 mentor, 26 città, ma soprattutto tante idee e intuizioni, concretizzate in 96 proposte open source già disponibili pubblicamente su GitHub di Developers Italia. Tante proposte, equamente distribuite tra i vari progetti, che rappresentano un vero e proprio patrimonio per la costruzione del “sistema operativo del Paese”, verso l’obiettivo comune di sviluppare servizi digitali sempre più efficienti. Guarda il video! I mentor e gli esponenti del Team per la Trasformazione Digitale sono già al lavoro per valutare le proposte raccolte, anche in vista dell’assegnazione dei premi. Il 16 ottobre saranno annunciati i due team vincitori del premio “Fast Rabbit” (progetti ultimati e caricati entro i due giorni dell’evento), mentre i progetti più complessi (in corsa per i 5 premi “Wise Turtle”) potranno essere ultimati entro il 30 ottobre. A presto! condividi su Twitter argomenti hackathon eventi sviluppatori ",
        "html": "<p>Ciao a tutti,</p>\n\n<p>È con grande piacere che vi raccontiamo la bellissima esperienza di <a href=\"https://hack.developers.italia.it\">Hack.Developers</a>, il più grande <em>code sprint</em> mai realizzato in Italia, organizzato dal <a href=\"https://teamdigitale.governo.it/\">Team per la Trasformazione Digitale</a>, in collaborazione con <a href=\"https://www.codemotionworld.com\">Codemotion</a>, che si è tenuto il 7 e l’8 ottobre in 25 città italiane + San Francisco.</p>\n\n<p>I numeri già rendono un’idea di quello che abbiamo vissuto per 48 ore di fila: oltre 800 sviluppatori, 116 team, 80 community, 200 mentor, 26 città, ma soprattutto tante idee e intuizioni, concretizzate in <strong>96 proposte open source già disponibili pubblicamente</strong> su <a href=\"https://github.com/italia/\">GitHub di Developers Italia</a>. Tante proposte, equamente distribuite tra i <a href=\"https://hack.developers.italia.it/challenge/\">vari progetti</a>, che rappresentano un vero e proprio patrimonio per la costruzione del “<strong>sistema operativo del Paese</strong>”, verso l’obiettivo comune di sviluppare servizi digitali sempre più efficienti.</p>\n\n<p><a href=\"https://twitter.com/teamdigitaleIT/status/917058075877629954/video/1\">Guarda il video!</a></p>\n\n<p>I mentor e gli esponenti del Team per la Trasformazione Digitale sono già al lavoro per valutare le proposte raccolte, anche in vista dell’<a href=\"https://hack.developers.italia.it/premi/\">assegnazione dei premi</a>. Il <strong>16 ottobre</strong> saranno annunciati i due team vincitori del premio “Fast Rabbit” (progetti ultimati e caricati entro i due giorni dell’evento), mentre i progetti più complessi (in corsa per i 5 premi “Wise Turtle”) potranno essere ultimati <strong>entro il 30 ottobre</strong>.</p>\n\n<p>A presto!</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCh6sOiQ_CAHoh_a",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Developers Italia al Google Summer of Code 2018",
        "subtitle": "Studenti da tutto il mondo potranno partecipare ai progetti open source di Developers Italia. Scopri come partecipare",
        "release-date": "2018-02-21 16:00:00 +0000",
        "tags": ["developers", "daf", "gsoc"],
        "author": "Francesco De Augustinis",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": [null],
        "slug": "developers-italia-al-google-summer-or-code",
        "ext": ".md",
        "excerpt": "<p>Ciao a tutti!</p>\n\n",
        "id": "/news/2018/02/21/developers-italia-al-google-summer-or-code",
        "url": "/news/2018/02/21/developers-italia-al-google-summer-or-code.html",
        "text": " Feb 21, 2018 Developers Italia al Google Summer of Code 2018 Studenti da tutto il mondo potranno partecipare ai progetti open source di Developers Italia. Scopri come partecipare di Francesco De Augustinis condividi su Twitter Ciao a tutti! La community Developers Italia rientra tra le organizzazioni e i progetti open source che prenderanno parte al Google Summer of Code 2018. Grazie a questa opportunità, studenti e giovani sviluppatori da tutto il mondo potranno seguire i progetti open source sviluppati nella comunità di Developers Italia, affiancati da un mentor, durante i tre mesi del summer camp organizzato ogni anno da Google. Google Summer of Code, di che si tratta Il Google Summer of Code è un programma estivo di Google rivolto a studenti universitari in tutto il mondo. Leggi: I requisiti per essere ammessi al programma Il programma permette agli studenti ammessi di lavorare per tre mesi su dei progetti di sviluppo open source di una delle 212 organizzazioni aderenti al progetto, tra cui la community di Developers Italia. Agli studenti selezionati sarà riconosciuta una borsa di studio, oltre all’affiancamento di un mentor per tutto il periodo. L’obiettivo è quello di migliorare le proprie competenze nello sviluppo open source e di prendere parte alle attività della community di riferimento e -nel nostro caso- di contribuire con le proprie idee a… migliorare la vita dei cittadini italiani. Invia la tua candidatura! Il bando del Google Summer of Code 2018 è aperto a tutti gli studenti che abbiano superato i 18 anni di età. Le candidature possono essere inviate dal 12 al 27 marzo 2018. Sul sito del programma è possibile leggere l’elenco di tutte le 212 organizzazioni aderenti. Per partecipare ad un progetto legato a Developers Italia, le candidature dovranno includere un progetto di sviluppo sulla base della lista di idee che abbiamo pubblicato (ma siamo aperti anche a concordare altre idee di civic hacking). Per saperne di più, puoi metterti in contatto con noi attraverso il canale Slack di Developers Italia. Aspettiamo le tue proposte! Il Team Developers Italia condividi su Twitter argomenti developers daf gsoc ",
        "html": "<p>Ciao a tutti!</p>\n\n<p>La community <a href=\"https://developers.italia.it/\">Developers Italia</a> rientra tra <strong>le organizzazioni e i progetti open source</strong> che prenderanno parte al <a href=\"https://summerofcode.withgoogle.com/\">Google Summer of Code 2018</a>. Grazie a questa opportunità, studenti e giovani sviluppatori da tutto il mondo potranno seguire i progetti open source sviluppati nella comunità di Developers Italia, affiancati da un mentor, durante i <strong>tre mesi del summer camp</strong> organizzato ogni anno da Google.</p>\n\n<h2 id=\"google-summer-of-code-di-che-si-tratta\">Google Summer of Code, di che si tratta</h2>\n\n<p>Il <strong>Google Summer of Code</strong> è un programma estivo di Google rivolto a studenti universitari in tutto il mondo.</p>\n\n<p><strong>Leggi</strong>: <a href=\"https://summerofcode.withgoogle.com/terms/student\">I requisiti per essere ammessi al programma</a></p>\n\n<p>Il programma permette agli studenti ammessi di lavorare per tre mesi su dei progetti di sviluppo open source di una delle 212 organizzazioni aderenti al progetto, tra cui <a href=\"https://summerofcode.withgoogle.com/organizations/6723597649838080/\">la community di Developers Italia</a>.</p>\n\n<p>Agli studenti selezionati sarà riconosciuta una borsa di studio, oltre all’<strong>affiancamento di un mentor</strong> per tutto il periodo. L’obiettivo è quello di migliorare le proprie competenze nello sviluppo open source e di prendere parte alle attività della community di riferimento e -nel nostro caso- di <strong>contribuire con le proprie idee</strong> a… migliorare la vita dei cittadini italiani.</p>\n\n<h2 id=\"invia-la-tua-candidatura\">Invia la tua candidatura!</h2>\n\n<p>Il bando del Google Summer of Code 2018 è aperto a tutti gli studenti che abbiano superato i 18 anni di età. Le candidature possono essere inviate <strong>dal 12 al 27 marzo 2018</strong>. Sul sito del programma è possibile leggere l’elenco di <a href=\"https://summerofcode.withgoogle.com/organizations/\">tutte le 212 organizzazioni aderenti</a>.</p>\n\n<p>Per partecipare ad un progetto legato a Developers Italia, le candidature dovranno includere <strong>un progetto di sviluppo</strong> sulla base della <a href=\"https://developers.italia.it/en/gsoc-ideas/\">lista di idee che abbiamo pubblicato</a> (ma siamo aperti anche a concordare altre idee di <em>civic hacking</em>). Per saperne di più, puoi metterti in contatto con noi attraverso <a href=\"https://slack.developers.italia.it/\">il canale Slack di Developers Italia</a>.</p>\n\n<p>Aspettiamo le tue proposte!</p>\n\n<p>Il Team Developers Italia</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCh6sOiQ_CAHoh_d",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Linee guida sull’acquisizione e il riuso del software, aperta la consultazione",
        "subtitle": "La consultazione aperta dal 5 aprile al 5 maggio 2018",
        "release-date": "2018-04-16 09:00:00 +0000",
        "tags": ["developers", "software", "opensource"],
        "author": "Francesco De Augustinis",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": [null],
        "slug": "linee-guida-su-acquisizione-e-riuso-del-software",
        "ext": ".md",
        "excerpt": "<p>Dal <strong>5 aprile al 5 maggio</strong> su <a href=\"https://docs.developers.italia.it/\">Docs Italia</a> è possibile partecipare ad una consultazione pubblica sulle nuove “<a href=\"http://lg-acquisizione-e-riuso-software-per-la-pa.readthedocs.io/it/latest/\">Linee guida sull’acquisizione e il riuso di software per le pubbliche amministrazioni</a>”.</p>\n\n",
        "id": "/news/2018/04/16/linee-guida-su-acquisizione-e-riuso-del-software",
        "url": "/news/2018/04/16/linee-guida-su-acquisizione-e-riuso-del-software.html",
        "text": " Apr 16, 2018 Linee guida sull’acquisizione e il riuso del software, aperta la consultazione La consultazione aperta dal 5 aprile al 5 maggio 2018 di Francesco De Augustinis condividi su Twitter Dal 5 aprile al 5 maggio su Docs Italia è possibile partecipare ad una consultazione pubblica sulle nuove “Linee guida sull’acquisizione e il riuso di software per le pubbliche amministrazioni”. Il testo stabilisce regole e modalità di acquisizione e di condivisione del software tra tutti i soggetti pubblici. La consultazione è aperta a tutti, in particolare i fornitori e le pubbliche amministrazioni. Le nuove linee guida sul software, di che si tratta Le “Linee guida sull’acquisizione e il riuso di software per le pubbliche amministrazioni” sono espressamente previste dal Codice dell’amministrazione digitale (CAD). Servono per: Definire in che modo una pubblica amministrazione deve effettuare la valutazione comparativa obbligatoria per acquisire un software, preferendo il software open source all’acquisizione di software tramite licenza. Indicare in che modo le pubbliche amministrazioni possono condividere e riutilizzare il software sotto licenza aperta e i requisiti che le piattaforme per la pubblicazione e la condivisione (come GitHub e GitLab) devono avere. Partecipa alla consultazione! Puoi prendere parte alla consultazione direttamente su Docs Italia, cliccando l’apposito link in fondo ad ogni sezione delle linee guida ed aprendo la discussione. Tutti i contributi saranno presi in considerazione dall’Agenzia per l’Italia Digitale e dal Team per la trasformazione digitale per la redazione del testo definitivo. Approfondisci: Istruzioni per la consultazione pubblica su DocsItalia Partecipa subito alla consultazione! A presto! Il team di Developers Italia condividi su Twitter argomenti developers software opensource ",
        "html": "<p>Dal <strong>5 aprile al 5 maggio</strong> su <a href=\"https://docs.developers.italia.it/\">Docs Italia</a> è possibile partecipare ad una consultazione pubblica sulle nuove “<a href=\"http://lg-acquisizione-e-riuso-software-per-la-pa.readthedocs.io/it/latest/\">Linee guida sull’acquisizione e il riuso di software per le pubbliche amministrazioni</a>”.</p>\n\n<p>Il testo stabilisce regole e modalità di <strong>acquisizione</strong> e di <strong>condivisione</strong> del software tra tutti i soggetti pubblici. La consultazione è aperta a tutti, in particolare <strong>i fornitori e le pubbliche amministrazioni</strong>.</p>\n\n<h2 id=\"le-nuove-linee-guida-sul-software-di-che-si-tratta\">Le nuove linee guida sul software, di che si tratta</h2>\n\n<p>Le “<a href=\"http://lg-acquisizione-e-riuso-software-per-la-pa.readthedocs.io/it/latest/\">Linee guida sull’acquisizione e il riuso di software per le pubbliche amministrazioni</a>” sono espressamente previste dal <a href=\"https://cad.readthedocs.io/it/v2017-12-13/_rst/capo6.html\">Codice dell’amministrazione digitale</a> (CAD). Servono per:</p>\n\n<ul>\n  <li>\n    <p>Definire in che modo una pubblica amministrazione deve effettuare la <strong>valutazione comparativa</strong> obbligatoria per acquisire un software, preferendo il software open source all’acquisizione di software tramite licenza.</p>\n  </li>\n  <li>\n    <p>Indicare in che modo le pubbliche amministrazioni possono condividere e riutilizzare il software sotto licenza aperta e i requisiti che le piattaforme per la pubblicazione e la condivisione (come <a href=\"https://github.com/\">GitHub</a> e <a href=\"https://about.gitlab.com/\">GitLab</a>) devono avere.</p>\n  </li>\n</ul>\n\n<h2 id=\"partecipa-alla-consultazione\">Partecipa alla consultazione!</h2>\n\n<p>Puoi prendere parte alla consultazione direttamente su <a href=\"http://lg-acquisizione-e-riuso-software-per-la-pa.readthedocs.io/it/latest/\">Docs Italia</a>, cliccando l’apposito link in fondo ad ogni sezione delle linee guida ed aprendo la discussione. Tutti i contributi saranno presi in considerazione dall’<a href=\"http://www.agid.gov.it/\">Agenzia per l’Italia Digitale</a> e dal <a href=\"https://teamdigitale.governo.it/\">Team per la trasformazione digitale</a> per la redazione del testo definitivo.</p>\n\n<p><strong>Approfondisci</strong>: <a href=\"http://test-acquisizione-riuso.readthedocs.io/it/latest/istruzioni-per-la-consultazione-pubblica.html\">Istruzioni per la consultazione pubblica su DocsItalia</a></p>\n\n<p><a href=\"http://lg-acquisizione-e-riuso-software-per-la-pa.readthedocs.io/it/latest/\">Partecipa subito alla consultazione!</a></p>\n\n<p>A presto!</p>\n\n<p>Il team di Developers Italia</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCkdsOiQ_CAHoh_g",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "API",
        "subtitle": null,
        "lang": "en",
        "layout": "api",
        "slug": "api",
        "ext": ".md",
        "tags": [],
        "excerpt": "",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/api",
        "url": "/en/api/",
        "text": "",
        "html": "",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCpqsOiQ_CAHoh_k",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "layout": "home",
        "lang": "en",
        "title": "Developers Italia",
        "description": "The Italian community of developers of public services",
        "permalink": "/en/",
        "top_projects_link": "/en/projects",
        "image": "/assets/icons/logo-it.png",
        "slug": "index",
        "ext": ".md",
        "tags": [],
        "excerpt": "\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/index",
        "url": "/en/",
        "text": "",
        "html": "\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_r",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "Chi siamo",
        "lang": "it",
        "layout": "credits",
        "subtitle": null,
        "image": "http://placehold.it/1400x500",
        "slug": "chi-siamo",
        "ext": ".md",
        "tags": [],
        "excerpt": "<p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nullam quam arcu, pharetra sit amet sollicitudin vitae, mattis ac leo. Quisque eu arcu sed dui sagittis tristique eu porttitor lectus. Donec dignissim nisl turpis, ut eleifend diam porta et. Curabitur sagittis fringilla nisl varius malesuada. Vivamus dapibus consectetur urna id faucibus. Donec ac magna at turpis consectetur pellentesque ut in nibh. Aliquam convallis elementum suscipit. Nullam egestas dictum metus ut aliquet. Fusce laoreet hendrerit massa. Proin gravida neque ut neque blandit blandit. Curabitur posuere vehicula nibh, nec ultricies dolor eleifend non. Ut pulvinar purus ante, in interdum sapien auctor id. Maecenas elementum dictum facilisis.</p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/chi-siamo",
        "url": "/it/chi-siamo/",
        "text": " Chi siamo Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nullam quam arcu, pharetra sit amet sollicitudin vitae, mattis ac leo. Quisque eu arcu sed dui sagittis tristique eu porttitor lectus. Donec dignissim nisl turpis, ut eleifend diam porta et. Curabitur sagittis fringilla nisl varius malesuada. Vivamus dapibus consectetur urna id faucibus. Donec ac magna at turpis consectetur pellentesque ut in nibh. Aliquam convallis elementum suscipit. Nullam egestas dictum metus ut aliquet. Fusce laoreet hendrerit massa. Proin gravida neque ut neque blandit blandit. Curabitur posuere vehicula nibh, nec ultricies dolor eleifend non. Ut pulvinar purus ante, in interdum sapien auctor id. Maecenas elementum dictum facilisis. Donec id est metus. Interdum et malesuada fames ac ante ipsum primis in faucibus. Vivamus a vulputate quam. Nam faucibus nunc vel auctor bibendum. Vivamus eu mauris ut felis viverra vulputate eget ac lacus. Morbi non urna aliquam, pharetra diam ac, viverra odio. Praesent convallis augue non scelerisque ullamcorper. Curabitur vehicula dolor sit amet euismod maximus. Sed in tellus ac diam volutpat luctus. Vestibulum eu gravida lorem. Donec vel purus sed diam bibendum aliquet ac quis felis. Vivamus neque lectus, egestas ac ligula sed, placerat ornare massa. Duis ac tellus varius, placerat ipsum et, pharetra erat. Quisque aliquam dui velit, elementum finibus eros euismod vel. Etiam pharetra, orci ut venenatis accumsan, nulla mi euismod dui, et tincidunt tortor velit non metus. Duis hendrerit sapien sapien. Curabitur nec erat suscipit massa tincidunt elementum. Nullam orci odio, sagittis a condimentum eu, luctus a tellus. Donec ac convallis lorem. Sed congue sodales tellus. Curabitur quis posuere augue. Praesent iaculis eget nulla eget porta. Nam ut facilisis dui, id viverra orci. Fusce porta neque eget enim condimentum, in faucibus libero ornare. Cras dapibus justo sed nibh rhoncus, sit amet pellentesque urna vehicula. Fusce suscipit condimentum auctor. Come lo uso Come partecipo ",
        "html": "<p>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Nullam quam arcu, pharetra sit amet sollicitudin vitae, mattis ac leo. Quisque eu arcu sed dui sagittis tristique eu porttitor lectus. Donec dignissim nisl turpis, ut eleifend diam porta et. Curabitur sagittis fringilla nisl varius malesuada. Vivamus dapibus consectetur urna id faucibus. Donec ac magna at turpis consectetur pellentesque ut in nibh. Aliquam convallis elementum suscipit. Nullam egestas dictum metus ut aliquet. Fusce laoreet hendrerit massa. Proin gravida neque ut neque blandit blandit. Curabitur posuere vehicula nibh, nec ultricies dolor eleifend non. Ut pulvinar purus ante, in interdum sapien auctor id. Maecenas elementum dictum facilisis.</p>\n\n<p>Donec id est metus. Interdum et malesuada fames ac ante ipsum primis in faucibus. Vivamus a vulputate quam. Nam faucibus nunc vel auctor bibendum. Vivamus eu mauris ut felis viverra vulputate eget ac lacus. Morbi non urna aliquam, pharetra diam ac, viverra odio. Praesent convallis augue non scelerisque ullamcorper. Curabitur vehicula dolor sit amet euismod maximus. Sed in tellus ac diam volutpat luctus. Vestibulum eu gravida lorem. Donec vel purus sed diam bibendum aliquet ac quis felis. Vivamus neque lectus, egestas ac ligula sed, placerat ornare massa. <a href=\"http://google.it\">Duis ac tellus varius</a>, placerat ipsum et, pharetra erat. Quisque aliquam dui velit, elementum finibus eros euismod vel.</p>\n\n<p class=\"mb-5\">Etiam pharetra, orci ut venenatis accumsan, nulla mi euismod dui, et tincidunt tortor velit non metus. Duis hendrerit sapien sapien. Curabitur nec erat suscipit massa tincidunt elementum. Nullam orci odio, sagittis a condimentum eu, luctus a tellus. Donec ac convallis lorem. Sed congue sodales tellus. Curabitur quis posuere augue. Praesent iaculis eget nulla eget porta. Nam ut facilisis dui, id viverra orci. Fusce porta neque eget enim condimentum, in faucibus libero ornare. Cras dapibus justo sed nibh rhoncus, sit amet pellentesque urna vehicula. Fusce suscipit condimentum auctor.</p>\n\n<p><a href=\"http://google.it\" class=\"btn btn-primary font-base pl-5 pr-5\">Come lo uso</a>  <a href=\"http://google.it\" class=\"btn btn-outline-primary font-base pl-5 pr-5\">Come partecipo</a></p>\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_5",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "PagoPA",
        "subtitle": "Payment interface towards the Public Administration",
        "logo": "/assets/images/logo-pagopa@2x.png",
        "payoff": "Payment interface towards the Public Administration",
        "description": "A single way, with a single interface to the citizen, to pay with credit card, bank transfers or event via an app.\n",
        "lang": "en",
        "order": 4,
        "highlight": false,
        "comingsoon": false,
        "layout": "project",
        "github_team": "pagopa",
        "slug": "pagopa",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"coming-soon\">Coming soon…</h2>\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/pagopa",
        "url": "/en/pagopa/",
        "text": "",
        "html": "<h2 id=\"coming-soon\">Coming soon…</h2>\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoh_7",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "18App e Carta Docente",
        "subtitle": "Bonus cultura e formazione",
        "logo": "/assets/images/logo-18app-cartadocente@2x.png",
        "payoff": "La piattaforma dove spendere i bonus cultura e formazione",
        "description": "Se sei un esercente e vuoi integrarti con la piattaforma, qui puoi trovare le informazioni dettagliate per come integrarsi in modo efficace con la piattaforma.\n",
        "lang": "it",
        "order": 3,
        "highlight": false,
        "comingsoon": false,
        "layout": "project",
        "github_team": "18app",
        "slug": "18app",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"intro\">Intro</h2>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/18app",
        "url": "/it/18app/",
        "text": "",
        "html": "<h2 id=\"intro\">Intro</h2>\n\n<p>18App e Carta Docente sono due programmi previsti dalla legge con i quali\nviene assegnato un bonus economico (€500) a determinate categorie di persone\ndette beneficiari (rispettivamente, tutti i 18enni e i docenti di ruolo) da\nspendere con specifici vincoli (in cultura e formazione) presso esercenti\naccreditati.</p>\n\n<p>I beneficiari si identificano tramite SPID, e possono poi utilizzare una\nresponsive web application (quindi anche da smartphone) per spendere il\nproprio portafoglio virtuale creandosi dei buoni sconto (QRCode e codice\nalfanumerico), utilizzabili presso gli esercenti convenzionati, che rientrano\nin due categorie: esercenti fisici o esercenti online. L’esercente, verificato\nche il coupon è valido, effettua lo sconto per l’acquirente, e poi\nsuccessivamente emette fattura verso lo Stato per recuperare l’importo scontato.</p>\n\n<p>Per validare un coupon, l’esercente può collegarsi via API al sistema di\nbackend, effettuando quindi una integrazione con il proprio sistema di cassa,\noppure manualmente tramite una semplice web form.</p>\n\n<p>Il sistema di backend e l’attuale web application sono gestiti da SOGEI come\nfornitore di servizio del Ministero dei Beni Culturali e del Ministero\ndell’Istruzione. Il lavoro su Developers Italia si concentra in due direzioni:</p>\n\n<ul>\n  <li>\n    <p>Fornire documentazione, codice e supporto per gli <strong>esercenti che vogliono\nintegrarsi sulla piattaforma</strong>. Tutta la documentazione tecnica è presente\ninfatti in questa sezione, e tramite il forum è possibile avere risposta\nalle problematiche tecniche di integrazione.</p>\n  </li>\n  <li>\n    <p>Sviluppo di una <strong>nuova mobile app nativa</strong>, sotto licenza open-source, che\npotrà essere utilizza dai beneficiari per utilizzare il servizio. Al momento\nlo sviluppo non è ancora iniziato, ma è possibile intanto visionare il mockup\ninterattivo e fornire commenti.</p>\n  </li>\n</ul>\n\n<h2 id=\"documentazione\">Documentazione</h2>\n\n<p>Qui potete trovare la documentazione tecnica di accesso alle API per gli esercenti\nche si devono integrare con la piattaforma, e il mockup della nuova mobile app\nil cui sviluppo deve ancora cominciare.</p>\n\n<p><a href=\"http://guida-18app.readthedocs.io/it/latest/\">Documentazione dei webservice per esercenti</a></p>\n\n<p><a href=\"https://invis.io/RSDORU6E2\">Mockup della mobile app nativa</a></p>\n\n<h2 id=\"collaborazione\">Collaborazione</h2>\n\n<p>Abbiamo aperto un’area dedicata a 18app e Carta Docente sul nostro forum, in modo\nda poter avere un canale di supporto tecnico diretto.</p>\n\n<p><a href=\"https://forum.italia.it/c/18app-carta-docente\">Sezione del forum su 18app a Carta Docente</a></p>\n\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAJ",
      "_score": 1,
      "_source": {
        "title": "I want to work with you, how can I do it?",
        "text": "",
        "order": 5,
        "lang": "en",
        "id": "/faqs/en/40",
        "url": "/faqs/en/40.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAM",
      "_score": 1,
      "_source": {
        "title": "Which project will you add in the near future to this website?",
        "text": "",
        "order": 9,
        "lang": "en",
        "id": "/faqs/en/70",
        "url": "/faqs/en/70.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAR",
      "_score": 1,
      "_source": {
        "title": "Come scegliete i maintainer?",
        "text": "",
        "order": 30,
        "lang": "it",
        "id": "/faqs/it/30",
        "url": "/faqs/it/30.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAS",
      "_score": 1,
      "_source": {
        "title": "Voglio lavorare con voi, come posso fare?",
        "text": "",
        "order": 40,
        "lang": "it",
        "id": "/faqs/it/40",
        "url": "/faqs/it/40.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAU",
      "_score": 1,
      "_source": {
        "title": "Posso contribuire ad un progetto?",
        "text": "",
        "order": 50,
        "lang": "it",
        "id": "/faqs/it/50",
        "url": "/faqs/it/50.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCQ5sOiQ_CAHoh_Q",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Benvenuti in Developers Italia!",
        "subtitle": "Apre in beta la community italiana degli sviluppatori dei servizi pubblici digitali",
        "release-date": "2017-02-24 10:00:00 +0000",
        "tags": ["eventi", "sviluppatori"],
        "author": "Giovanni Bajo",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": ["/eventi/sviluppatori/2017/02/24/lancio.html"],
        "slug": "lancio",
        "ext": ".md",
        "excerpt": "<p>Developers Italia, creata in collaborazione tra <a href=\"http://agid.gov.it\">AgID</a> e il <a href=\"https://teamdigitale.governo.it\">Team per la Trasformazione Digitale</a>, è la community italiana di sviluppatori di servizi pubblici, una piattaforma tecnologica dove ospitare tutti i principali progetti tecnologici di Paese che prevede:</p>\n\n",
        "id": "/news/2017/02/24/lancio",
        "url": "/news/2017/02/24/lancio.html",
        "text": " Feb 24, 2017 Benvenuti in Developers Italia! Apre in beta la community italiana degli sviluppatori dei servizi pubblici digitali di Giovanni Bajo condividi su Twitter Developers Italia, creata in collaborazione tra AgID e il Team per la Trasformazione Digitale, è la community italiana di sviluppatori di servizi pubblici, una piattaforma tecnologica dove ospitare tutti i principali progetti tecnologici di Paese che prevede: uno spazio su GitHub per ospitare il codice sorgente e librerie open-source pronte all’uso e all’integrazione; un’area basata su ReadTheDocs per riscrivere la documentazione finalmente in formato moderno, pensata e scritta per la fruizione da tecnico a tecnico; una newsletter e uno spazio per le news, per essere avvertiti quando esce una nuova versione (invece che doverlo scoprire per sbaglio, magari a progetto finito…); un forum aperto basato su Discourse, dove poter liberamente discutere con colleghi in tutta Italia. ©Negative space via Unsplash CCBY Stiamo anche valutando un ambiente di sandboxing per le API, per avere una reference chiara e semplice, testare la connessione alle API direttamente dal browser, e scaricare “scheletri di client” già pronti. Crediamo che le iniziative tecnologiche non avranno mai successo perché imposte per legge, ma solo se utili per i cittadini, moderne, facili da integrare per gli sviluppatori. A tal fine vogliamo quindi creare un ambiente aperto dove offrire strumenti e documentazione, ricevere commenti e contributi, interagire con gli sviluppatori del settore pubblico e del settore privato, aumentare la qualità e la semplicità. La piattaforma oggi è un guscio da riempire e abbiamo bisogno del contributo di tutti. Entrate in Developers Italia e aiutateci a costruire le fondamenta dei nuovi servizi pubblici italiani. Per ulteriori approfondimenti, leggi anche il nostro post su Medium condividi su Twitter argomenti eventi sviluppatori ",
        "html": "<p>Developers Italia, creata in collaborazione tra <a href=\"http://agid.gov.it\">AgID</a> e il <a href=\"https://teamdigitale.governo.it\">Team per la Trasformazione Digitale</a>, è la community italiana di sviluppatori di servizi pubblici, una piattaforma tecnologica dove ospitare tutti i principali progetti tecnologici di Paese che prevede:</p>\n\n<ul>\n  <li>uno spazio su GitHub per ospitare il codice sorgente e librerie open-source pronte all’uso e all’integrazione;</li>\n  <li>un’area basata su ReadTheDocs per riscrivere la documentazione finalmente in formato moderno, pensata e scritta per la fruizione da tecnico a tecnico;</li>\n  <li>una newsletter e uno spazio per le news, per essere avvertiti quando esce una nuova versione (invece che doverlo scoprire per sbaglio, magari a progetto finito…);</li>\n  <li>un forum aperto basato su Discourse, dove poter liberamente discutere con colleghi in tutta Italia.</li>\n</ul>\n\n<p><img src=\"https://developers.italia.it/assets/images/independent-developer.jpg\" alt=\"Developers\" /></p>\n\n<p><a href=\"https://unsplash.com/photos/6g0KJWnBhxg\">©Negative space via Unsplash CCBY</a></p>\n\n<p>Stiamo anche valutando un ambiente di sandboxing per le API, per avere una reference chiara e semplice, testare la connessione alle API direttamente dal browser, e scaricare “scheletri di client” già pronti.</p>\n\n<p>Crediamo che le iniziative tecnologiche non avranno mai successo perché imposte per legge, ma solo se utili per i cittadini, moderne, facili da integrare per gli sviluppatori. A tal fine vogliamo quindi creare un ambiente aperto dove offrire strumenti e documentazione, ricevere commenti e contributi, interagire con gli sviluppatori del settore pubblico e del settore privato, aumentare la qualità e la semplicità.</p>\n\n<p>La piattaforma oggi è un guscio da riempire e abbiamo bisogno del contributo di tutti. Entrate in Developers Italia e aiutateci a costruire le fondamenta dei nuovi servizi pubblici italiani.</p>\n\n<p>Per ulteriori approfondimenti, leggi anche il nostro <a href=\"https://medium.com/team-per-la-trasformazione-digitale\">post su Medium</a></p>\n\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCh6sOiQ_CAHoh_b",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Ti presentiamo il nuovo Docs Italia!",
        "subtitle": "Un sito unico dove pubblicare i documenti tecnici e amministrativi della Pubblica Amministrazione",
        "release-date": "2018-03-07 15:00:00 +0000",
        "tags": ["developers", "docsitalia"],
        "author": "Francesco De Augustinis",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": [null],
        "slug": "ti-presentiamo-il-nuovo-docs-italia",
        "ext": ".md",
        "excerpt": "<p>Abbiamo pubblicato <a href=\"https://docs.developers.italia.it/\">una nuova release di Docs Italia</a>, la piattaforma per pubblicare <strong>i documenti tecnici e amministrativi</strong> della Pubblica Amministrazione in Italia. Un unico sito dove pubblicare documentazione tecnica, linee guida, leggi, circolari e qualsiasi tipo di documento legato ai servizi pubblici o ai progetti digitali della Pubblica Amministrazione.</p>\n\n",
        "id": "/news/2018/03/07/ti-presentiamo-il-nuovo-docs-italia",
        "url": "/news/2018/03/07/ti-presentiamo-il-nuovo-docs-italia.html",
        "text": " Mar 7, 2018 Ti presentiamo il nuovo Docs Italia! Un sito unico dove pubblicare i documenti tecnici e amministrativi della Pubblica Amministrazione di Francesco De Augustinis condividi su Twitter Abbiamo pubblicato una nuova release di Docs Italia, la piattaforma per pubblicare i documenti tecnici e amministrativi della Pubblica Amministrazione in Italia. Un unico sito dove pubblicare documentazione tecnica, linee guida, leggi, circolari e qualsiasi tipo di documento legato ai servizi pubblici o ai progetti digitali della Pubblica Amministrazione. Scopri il nuovo Docs Italia Come funziona Docs Italia Nella Guida a Docs Italia puoi scoprire come funziona la piattaforma e quali sono i vantaggi e le novità, come il sistema di versionamento o il processo di consultazione pubblica per i documenti amministrativi. Per vedere il nuovo Docs Italia Il modo migliore per scoprire il nuovo Docs Italia è avventurarsi nella homepage ed esplorare la documentazione già pubblicata, come il Codice per l’amministrazione digitale o la documentazione tecnica di ANPR. Partecipa Docs Italia aspetta il tuo contributo! Per iniziare a pubblicare i tuoi documenti su Docs Italia puoi leggere la style guide, che spiega in che formato realizzare i documenti tecnici e amministrativi, e la guida per iniziare a pubblicare. Perché Docs Italia? L’inizio di una rivoluzione Su un post su Medium vi raccontiamo perché è nato il nuovo Docs Italia: un progetto per cambiare il linguaggio dei progetti della Pubblica Amministrazione e renderli più efficaci e trasparenti. Inizia subito a pubblicare! Le amministrazioni che vogliono iniziare a pubblicare i propri documenti su Docs Italia possono consultare la guida alla pubblicazione. Scrivici per qualsiasi dubbio o… inizia a pubblicare i tuoi documenti! Ti aspettiamo su Docs Italia, a presto! Il team di Developers Italia condividi su Twitter argomenti developers docsitalia ",
        "html": "<p>Abbiamo pubblicato <a href=\"https://docs.developers.italia.it/\">una nuova release di Docs Italia</a>, la piattaforma per pubblicare <strong>i documenti tecnici e amministrativi</strong> della Pubblica Amministrazione in Italia. Un unico sito dove pubblicare documentazione tecnica, linee guida, leggi, circolari e qualsiasi tipo di documento legato ai servizi pubblici o ai progetti digitali della Pubblica Amministrazione.</p>\n\n<h2 id=\"scopri-il-nuovo-docs-italia\">Scopri il nuovo Docs Italia</h2>\n\n<ul>\n  <li>\n    <p><strong>Come funziona Docs Italia</strong>\nNella <a href=\"http://guida-docs-italia.readthedocs.io/it/latest/\">Guida a Docs Italia</a> puoi scoprire come funziona la piattaforma e quali sono <strong>i vantaggi e le novità</strong>, come <a href=\"http://guida-docs-italia.readthedocs.io/it/latest/index/appendice-1.html\">il sistema di versionamento</a> o <a href=\"http://cad.readthedocs.io/it/v2017-12-13/_rst/capo1_sezione3_art18.html?highlight=consultazione%20pubblica\">il processo di consultazione pubblica</a> per i documenti amministrativi.</p>\n  </li>\n  <li>\n    <p><strong>Per vedere il nuovo Docs Italia</strong>\nIl modo migliore per scoprire il nuovo Docs Italia è avventurarsi nella <a href=\"https://docs.developers.italia.it/\">homepage</a> ed esplorare la <strong>documentazione già pubblicata</strong>, come <a href=\"https://cad.readthedocs.io/it/v2017-12-13/\">il Codice per l’amministrazione digitale</a> o <a href=\"https://anpr.readthedocs.io/en/latest/\">la documentazione tecnica di ANPR</a>.</p>\n  </li>\n  <li>\n    <p><strong>Partecipa</strong>\nDocs Italia aspetta il tuo contributo! Per iniziare a pubblicare i tuoi documenti su Docs Italia puoi leggere <a href=\"https://forum.italia.it/t/nuova-style-guide-per-documenti-tecnici-e-amministrativi/2608\">la <em>style guide</em></a>, che spiega in che formato realizzare i documenti tecnici e amministrativi, e <a href=\"http://guida-docs-italia.readthedocs.io/it/latest/\">la guida per iniziare a pubblicare</a>.</p>\n  </li>\n  <li>\n    <p><strong>Perché Docs Italia? L’inizio di una rivoluzione</strong>\nSu <a href=\"https://medium.com/team-per-la-trasformazione-digitale/docs-italia-open-government-collaborazione-pubblica-amministrazione-progetti-linguaggio-b89ff330e21b\">un post su Medium</a> vi raccontiamo perché è nato il nuovo Docs Italia: un progetto per <strong>cambiare il linguaggio</strong> dei progetti della Pubblica Amministrazione e renderli più efficaci e trasparenti.</p>\n  </li>\n</ul>\n\n<h2 id=\"inizia-subito-a-pubblicare\">Inizia subito a pubblicare!</h2>\n\n<p>Le amministrazioni che vogliono iniziare a pubblicare i propri documenti su Docs Italia possono consultare <a href=\"http://guida-docs-italia.readthedocs.io/it/latest/index/come-partecipare.html\">la guida alla pubblicazione</a>. <a href=\"mailto:contatti@docs.italia.it\">Scrivici per qualsiasi dubbio</a> o… inizia a pubblicare i tuoi documenti!</p>\n\n<p>Ti aspettiamo su <a href=\"https://docs.developers.italia.it/\">Docs Italia</a>,</p>\n\n<p>a presto!</p>\n\n<p>Il team di Developers Italia</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wClosOiQ_CAHoh_h",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "Credits",
        "lang": "en",
        "layout": "credits",
        "subtitle": null,
        "slug": "credits",
        "ext": ".md",
        "tags": [],
        "excerpt": "\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/credits",
        "url": "/en/credits/",
        "text": " Credits ",
        "html": "\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCqssOiQ_CAHoh_l",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "Note Legali",
        "lang": "en",
        "layout": "page",
        "slug": "note-legali",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h3 id=\"note-legali\">Note Legali</h3>\n<p><a href=\"https://developers.italia.it\">https://developers.italia.it</a> è un sito che ha l’obiettivo di contribuire alla crescita e al coordinamento di una community di sviluppatori interessati allo sviluppo di codice strumentale al funzionamento dei servizi online della pubblica amministrazione.\nIl sito è gestito dall’Agenzia per l’Italia Digitale.</p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/note-legali",
        "url": "/en/note-legali/",
        "text": "",
        "html": "<h3 id=\"note-legali\">Note Legali</h3>\n<p><a href=\"https://developers.italia.it\">https://developers.italia.it</a> è un sito che ha l’obiettivo di contribuire alla crescita e al coordinamento di una community di sviluppatori interessati allo sviluppo di codice strumentale al funzionamento dei servizi online della pubblica amministrazione.\nIl sito è gestito dall’Agenzia per l’Italia Digitale.</p>\n\n<p>In taluni casi (forum di discussione) per accedere ai contenuti e/o fruire dei Servizi potrebbe essere necessario utilizzare delle credenziali rilasciate dai gestori di altri servizi (es: github o google) o registrarsi, richiedendo l’attribuzione di nuove credenziali.\nL’utente prende atto che l’Agenzia, nel corso dell’intero rapporto, lo identificherà quale titolare dei suoi diritti e doveri esclusivamente sulla base dell’identità digitale attribuitagli e rappresentata dalle credenziali (user ID/email e password) che avrà indicato e/o scelto di utilizzare. L’utente si impegna pertanto a custodire tali credenziali e a segnalare immediatamente all’Agenzia – qualora avesse scelto di registrarsi direttamente al Sito – all’indirizzo <a href=\"mailto:protocollo@pec.agid.gov.it\">protocollo@pec.agid.gov.it</a> l’eventuale perdita del controllo esclusivo sulle stesse, prendendo atto della circostanza che, in difetto di tale segnalazione e sino al momento del suo ricevimento, sarà responsabile di ogni azione e condotta posta in essere utilizzando tali credenziali (es: pubblicazione di un contenuto online, richiesta di un Servizio ecc.) e non potrà in alcun modo contestare la fruizione dei servizi o l’accesso ai contenuti connessi all’utilizzo delle citate credenziali.</p>\n\n<p>Qualora l’utente, attraverso taluni Servizi disponibili sul Sito (es. forum di discussione), possa procedere alla pubblicazione, diffusione o comunicazione di contenuti, si impegna a pubblicare, diffondere o comunicare esclusivamente contenuti inidonei a violare la legge e/o qualsivoglia diritto di terzi. \nIn tal caso, inoltre, l’utente dichiara e garantisce di disporre di tutti i diritti necessari alla pubblicazione dei contenuti (testi, immagini, fotografie e/o ritratti, filmati, materiale audiovisivo), avendo, eventualmente, preventivamente ottenuto, ove necessario, tutti i consensi e le liberatorie previsti dalla disciplina vigente, con particolare – ma non esclusivo – riferimento alla legge sul diritto d’autore e alla disciplina sulla privacy.\nL’Utente si impegna sin d’ora a manlevare e mantenere garantite ed indenni l’Agenzia per l’Italia digitale da ogni richiesta, anche risarcitoria, proposta e/o derivante, direttamente ovvero indirettamente, dall’utilizzo da parte dell’utente medesimo dei Servizi e/o dalla pubblicazione di qualsivoglia contenuto. Ai fini di tale manleva, si considererà imputabile all’utente qualsivoglia condotta posta in essere utilizzando le credenziali a quest’ultimo attribuite, salvo non ne venga comunicata la perdita alla Società in epoca anteriore alla citata condotta. \nResta inteso che l’Agenzia per l’Italia digitale si riserva il diritto di rimuovere in qualsiasi momento qualsiasi contenuto pubblicato dall’utente attraverso i servizi a fronte della segnalazione di una pretesa violazione di diritti di terzi o comunque a proprio insindacabile giudizio. \nL’Utente concede all’Agenzia per l’Italia digitale il diritto e la licenza, non soggetti ad alcun compenso – e come tali completamente gratuiti – e non esclusivi, di utilizzare, adattare, pubblicare, distribuire, riprodurre ed eseguire senza limitazioni territoriali e/o temporali quanto trasmesso, inviato e pubblicato dall’Utente attraverso i servizi. \nLe previsioni che precedono relative alla pubblicazione di contenuti attraverso il sito non si applicano alla pubblicazione di codice sorgente attraverso il servizio Github richiamato dal sito. Tale pubblicazione rimane assoggettata alle condizioni di utilizzo accettate dagli utenti all’atto dell’accesso alla relativa piattaforma di discussione.</p>\n\n<p>La titolarità di tutti i documenti e contenuti (testi, presentazioni, immagini, foto, video, ecc.) è dell’Agenzia per l’Italia Digitale.\nLa visualizzazione, il download e qualunque utilizzo dei dati pubblicati sul Sito comporta accettazione delle presenti note legali e delle condizioni della licenza con cui sono pubblicati.\nSalvo ove diversamente indicato, i contenuti pubblicati sul presente sito sono messi a disposizione con licenza CC–BY 3.0, il cui testo integrale è disponibile al seguente indirizzo: <a href=\"https://creativecommons.org/licenses/by/3.0/it/legalcode\">https://creativecommons.org/licenses/by/3.0/it/legalcode</a>.\nQuesto significa che, ove non diversamente specificato, i contenuti di questo sito sono liberamente distribuibili e riutilizzabili, a patto che sia sempre citata la fonte e – ove possibile – riportato l’indirizzo web della pagina originale.\nIl codice sorgente del Sito è invece disponibile qui sulla piattaforma Github e, pertanto, riutilizzabile nei limiti di cui alla relativa licenza.\nL’Agenzia per l’Italia Digitale si impegna costantemente per assicurare la qualità delle informazioni pubblicate sul sito, nonché la loro integrità, aggiornamento , completezza, tempestività , semplicità di consultazione e accessibilità.\nPer qualunque segnalazione o suggerimento è possibile scrivere all’indirizzo <a href=\"mailto:protocollo@pec.agid.gov.it\">protocollo@pec.agid.gov.it</a>.\nIn nessun caso l’Agenzia per l’Italia Digitale può essere ritenuta responsabile dei danni di qualsiasi natura causati direttamente o indirettamente dall’accesso al sito, dall’incapacità o impossibilità di accedervi.\nI collegamenti a siti esterni, indicati nel presente sito, sono forniti come semplice servizio agli utenti, con esclusione di ogni responsabilità sulla correttezza e sulla completezza dell’insieme dei collegamenti indicati.\nL’indicazione dei collegamenti non implica da parte dell’Agenzia per l’Italia Digitale alcun tipo di approvazione o condivisione di responsabilità in relazione alla legittimità, alla completezza e alla correttezza delle informazioni contenute nei siti indicati.</p>\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_o",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "Software",
        "subtitle": "Lorem ipsum dolor sit amet, consetetur sed diam volupta",
        "lang": "it",
        "layout": "software",
        "slug": "software",
        "ext": ".md",
        "tags": [],
        "excerpt": "\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/software",
        "url": "/en/software/",
        "text": "",
        "html": "\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_s",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "Cosa fare",
        "subtitle": "Le attività aperte nei repo di Developers Italia",
        "lang": "it",
        "layout": "github-issues",
        "slug": "cosa-fare",
        "ext": ".md",
        "tags": [],
        "excerpt": "<p>Hai voglia di aiutare ma non sai da dove cominciare? Tutti gli sviluppi che facciamo sono su GitHub <a href=\"https://github.com/italia\" title=\"Italia su Github\">@italia</a>, ma i progetti sono tanti e utilizzano tecnologie diverse. In questa pagina, raccogliamo tutte le issue aperte di tutti i progetti, e potrai quindi cercare un’attività con più facilità. Utilizza i filtri per orientarti più facilmente e trovare qualcosa a te più affine.</p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/cosa-fare",
        "url": "/it/cosa-fare/",
        "text": "",
        "html": "<p>Hai voglia di aiutare ma non sai da dove cominciare? Tutti gli sviluppi che facciamo sono su GitHub <a href=\"https://github.com/italia\" title=\"Italia su Github\">@italia</a>, ma i progetti sono tanti e utilizzano tecnologie diverse. In questa pagina, raccogliamo tutte le issue aperte di tutti i progetti, e potrai quindi cercare un’attività con più facilità. Utilizza i filtri per orientarti più facilmente e trovare qualcosa a te più affine.</p>\n\n<p><br /></p>\n\n<h2 class=\"u-textWeight-400 u-margin-top-l\" id=\"le-issue-aperte\">Le issue aperte</h2>\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_1",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "CIE",
        "subtitle": "Electronic Identity Card",
        "logo": "/assets/images/logo-cie@2x.png",
        "payoff": "Electronic Identity Card",
        "description": "The new electronic identity card is more than a simple piece of plastic: you can both connect and communicate via NFC, use it to cross ticket barriers or to obtain an SSL certificate connected to your identity\n",
        "lang": "en",
        "order": 9,
        "highlight": true,
        "comingsoon": true,
        "layout": "project",
        "github_team": "cie",
        "slug": "cie",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"coming-soon\">Coming soon…</h2>\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/cie",
        "url": "/en/cie/",
        "text": "",
        "html": "<h2 id=\"coming-soon\">Coming soon…</h2>\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_6",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "SPID",
        "subtitle": "Public System for Digital Identity",
        "logo": "/assets/images/logo-spid@2x.png",
        "payoff": "Public System for Digital Identity",
        "description": "SPID is the digital identity card for the citizens: a single credential system, with a verified identity, that can be integrated on public, but also private websites according to the SAML standard.\n",
        "maintainers": ["umbros"],
        "lang": "en",
        "order": 1,
        "highlight": true,
        "comingsoon": false,
        "layout": "project",
        "github_team": "spid",
        "socials": [{
          "name": "facebook",
          "icon": "facebook",
          "link": "https://www.facebook.com/groups/agid.spid/"
        }],
        "slug": "spid",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"intro\">Intro</h2>\n<p>SPID (Public System for Digital Identity) is the solution that allows the Italian citizens to access all online services of the Public Administration with a single Digital Identity (username and password) that can be used from computers, tablets and smartphones. Citizens can get SPID through a series of private companies under agreements (known as Identity Provider); once the verification procedure is completed (which certifies the identity of the applicant), you are released a set of credentials that can be used on all the websites (called Service Provider).</p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/spid",
        "url": "/en/spid/",
        "text": "",
        "html": "<h2 id=\"intro\">Intro</h2>\n<p>SPID (Public System for Digital Identity) is the solution that allows the Italian citizens to access all online services of the Public Administration with a single Digital Identity (username and password) that can be used from computers, tablets and smartphones. Citizens can get SPID through a series of private companies under agreements (known as Identity Provider); once the verification procedure is completed (which certifies the identity of the applicant), you are released a set of credentials that can be used on all the websites (called Service Provider).</p>\n\n<p>At the moment, the integration of SPID is allowed only on the websites of the Public Administration, but soon it will be disciplined and open also for the websites of private companies. The advantages of adopting SPID will be therefore so many: banks and insurance companies, for example, might recognize the citizen who wants to create an account or stipulate an insurance policy simply through the login.</p>\n\n<p><strong>Roadmap</strong></p>\n\n<p>We have scheduled for 2017 the following developments, for which we want to involve the community:</p>\n\n<ul>\n  <li>Creation of plugins for the main CMSes (Wordpress, Drupal, Joomla, etc.)</li>\n  <li>Integrations on mobiles (iOS, Android)</li>\n  <li>Testsuite of validation of the integration of SPID</li>\n  <li>Testing and validation of SPID</li>\n</ul>\n\n<p>A complete task list con be found in the actual live roadmap:</p>\n\n<p><a href=\"https://trello.com/b/PHF0ErvK/spid-roadmap\">Live roadmap</a></p>\n\n<h2 id=\"documentation\">Documentation</h2>\n\n<p>SPID uses an open protocol (SAML 2) that can be implemented by applying the official technical rules.</p>\n\n<p><a href=\"http://spid-regole-tecniche.readthedocs.io/en/latest/\">Technical rules</a></p>\n\n<h2 id=\"source-code\">Source code</h2>\n\n<p>The released code is still very little, we have big plans about it (see roadmap):</p>\n\n<p><a href=\"https://github.com/italia/spid-sp-access-button\">SPID button, with integrated IdP choice</a></p>\n\n<p><a href=\"https://github.com/italia/spid-idp-login-layout\">Standard IdP layout</a></p>\n\n<p><a href=\"https://github.com/italia/spid-sp-playbook\">Ansible playbook for SP</a></p>\n\n<p><strong>UI</strong></p>\n\n<p>We published some useful asset during the integration procedure:</p>\n\n<p><a href=\"https://github.com/italia/spid-graphics\">Icons, logos and assets</a></p>\n\n<p><a href=\"https://github.com/italia/spid-button\">SPID button (asset only)</a></p>\n\n<h2 id=\"contributing\">Contributing</h2>\n\n<p>We opened an area of discussion in our forum, to solve the technical problems of integration, and a public issue tracker will be soon available.</p>\n\n<p><a href=\"https://forum.italia.it/c/spid\">Forum for technical discussion</a></p>\n\n<p>We also host weekly videocalls on Jitsi; here you can find all information\nto join. Feel free to join if you are interested in following the\ndevelopment.</p>\n\n<p><a href=\"https://forum.italia.it/t/spid-weekly-meeting/276\">Weekly videocall</a></p>\n\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoh_8",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "ANPR",
        "logo": "/assets/images/logo-anpr@2x.png",
        "subtitle": "Anagrafe Nazionale della Popolazione Residente",
        "payoff": "L'anagrafe diventa unica e digitale",
        "description": "Un'unica anagrafe centrale, raggiungibile anche via API, che mantiene le informazioni aggiornate su residenza, stato di famiglia, e molto altro.",
        "lang": "it",
        "order": 4,
        "maintainers": ["carlo", "mirko"],
        "highlight": true,
        "comingsoon": false,
        "layout": "project",
        "github_team": "anpr",
        "slug": "anpr",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"intro\">Intro</h2>\n<p><strong>Vuoi avere aggiornamenti su ANPR? Iscriviti alla nostra <a href=\"#newsletter\">newsletter</a></strong></p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/anpr",
        "url": "/it/anpr/",
        "text": "",
        "html": "<h2 id=\"intro\">Intro</h2>\n<p><strong>Vuoi avere aggiornamenti su ANPR? Iscriviti alla nostra <a href=\"#newsletter\">newsletter</a></strong></p>\n\n<p>ANPR è un progetto storico: invece di avere più di 8.000 anagrafi dislocate nel territorio (in ciascun comune), l’Italia avrà finalmente una anagrafe centrale unica, che semplificherà tutti gli adempimenti.\nIn futuro speriamo di potervi dare funzionalità come poter comunicare una variazione di domicilio direttamente da un sito web, comodamente dal vostro salotto, oppure di scaricare un certificato di stato di famiglia.</p>\n\n<p>Ma questo è solo l’inizio: avete mai pensato perché dovete spesso chiedere dei certificati all’anagrafe? Semplice: ad oggi non esiste un’anagrafe unica centralizzata a cui gli enti pubblici possono rivolgersi per accedere alle informazioni senza doverle chiedere ogni volta ai cittadini. Con ANPR, tutto cambia.</p>\n\n<p>Ad oggi, l’accesso ad ANPR è riservato solo agli operatori anagrafici e ai software delle anagrafi comunali. Questa sezione è quindi dedicata a tutti coloro che stanno supportando i comuni nella fase di passaggio ad ANPR e ci stanno aiutando a realizzare questa visione. C’è ancora molto da fare e il contributo di tutti è importante.</p>\n\n<h2 id=\"documentazione\">Documentazione</h2>\n<p>Stiamo lavorando ad una revisione profonda della documentazione. Per ora, siamo riusciti a pubblicare in formato più facilmente consultabile tutte le tabelle e codici.</p>\n\n<p><a href=\"https://anpr.readthedocs.io\">Documentazione tecnica e tabelle di riferimento</a></p>\n\n<h2 id=\"collaborazione\">Collaborazione</h2>\n<p>Iscriviti a questa newsletter se vuoi ricevere aggiornamenti e novità su ANPR: comuni migrati, nuovo materiale, curiosità.</p>\n\n<p><a name=\"newsletter\"></a></p>\n\n\n<form class=\"Form Form--spaced u-padding-all-l u-background-grey-10 u-text-r-xs u-layout-prose u-margin-bottom-xl\"\n      action=\"https://a0x0b4.emailsp.com/frontend/subscribe.aspx\">\n\n        <div class=\"Form-field\">\n            <label class=\"Form-label is-required\" for=\"email\" >Email *</label>\n            <input class=\"Form-input\" id=\"email\" type=\"email\" name=\"email\" aria-required=\"true\" required placeholder=\"Inserisci la tua e-mail\">\n        </div>\n        <div class=\"Form-field\">\n            <label class=\"Form-label is-required\" for=\"campo3\">Gruppo</label>\n            <select class=\"Form-input u-text-r-s u-borderRadius-m\"\n            \t\tid=\"campo3\" name=\"campo3\" aria-required=\"true\" >\n            <option disabled selected></option>\n            <option value=\"\"></option>\n\t\t\t<option value=\"Comune\">Comune</option>\n\t\t\t<option value=\"SW_House\">Software House</option><option value=\"Cittadino\">Cittadino</option>\n          </select>\n       \t</div>\n        <fieldset class=\"Form-field Form-field--choose Grid-cell\">\n        \t<legend class=\"Form-legend is-required\">Privacy *</legend>\n        \t<label class=\"Form-label is-required\" for=\"privacy\">\n        \t<input type=\"checkbox\" class=\"Form-input\" id=\"privacy\" name=\"privacy\" aria-required=\"true\" required>\n        \t<span class=\"Form-fieldIcon\" role=\"presentation\"></span>\n        \tAccetto la <a target=\"_blank\" href=\"https://developers.italia.it/it/privacy-policy\">Privacy Policy</a>\n        \t</label>\n        </fieldset>\n    \t<div class=\"Form-field Grid-cell\">\n    \t\t<p class=\"u-text-r-xxs u-margin-bottom-m\" >Quando invii il modulo, controlla la tua inbox per confermare l'iscrizione</p>\n        \t<button type=\"submit\" class=\"Button Button--default u-text-xs\">Iscriviti</button>\n    \t</div>\n\n    <input type=\"hidden\" name=\"group\" value=\"16\" >\n\t<input type=\"hidden\" name=\"list\" value=\"3\">\n</form>\n\n\n\n<p>Abbiamo creato degli strumenti di collaborazione a vostra disposizione, tra cui un <em>issue tracker</em> e un forum dedicato alla discussione delle problematiche di integrazione.</p>\n\n<p><a href=\"https://github.com/italia/anpr/issues\">Issue tracker</a></p>\n\n<p><a href=\"https://forum.italia.it/c/anpr\">Forum di discussione</a></p>\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAP",
      "_score": 1,
      "_source": {
        "title": "Chi gestisce i progetti ospitati in Developers Italia?",
        "text": "",
        "order": 11,
        "lang": "it",
        "id": "/faqs/it/11",
        "url": "/faqs/it/11.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAQ",
      "_score": 1,
      "_source": {
        "title": "Qual è il ruolo dei maintainer?",
        "text": "",
        "order": 20,
        "lang": "it",
        "id": "/faqs/it/20",
        "url": "/faqs/it/20.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCcwsOiQ_CAHoh_S",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Pubblicata la roadmap di SPID",
        "subtitle": "Esce la prima roadmap di progetto di Developers Italia, per seguire il progetto e partecipare allo sviluppo",
        "release-date": "2017-05-25 16:00:00 +0000",
        "tags": ["roadmap", "progetti"],
        "author": "Giovanni Bajo",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": ["/roadmap/progetti/2017/05/25/pubblicata-roadmap-spid.html"],
        "slug": "pubblicata-roadmap-spid",
        "ext": ".md",
        "excerpt": "<p>Con molto piacere, questo è il link alla prima roadmap progettuale di Developers Italia: la <a href=\"https://trello.com/b/PHF0ErvK/spid-roadmap\">roadmap di SPID</a>. La abbiamo preparata in forma di bacheca di Trello.</p>\n\n",
        "id": "/news/2017/05/25/pubblicata-roadmap-spid",
        "url": "/news/2017/05/25/pubblicata-roadmap-spid.html",
        "text": " May 25, 2017 Pubblicata la roadmap di SPID Esce la prima roadmap di progetto di Developers Italia, per seguire il progetto e partecipare allo sviluppo di Giovanni Bajo condividi su Twitter Con molto piacere, questo è il link alla prima roadmap progettuale di Developers Italia: la roadmap di SPID. La abbiamo preparata in forma di bacheca di Trello. Contiamo di aggiornarla regolarmente via via che gli sviluppi procedono. Ovviamente le card che non sono già assegnate a qualcuno sono… libere :) Per le card in corso, pubblichiamo direttamente il link al repository GitHub dove si svolge lo sviluppo del task, in modo che chi vuole può dare un’occhiata e contribuire. Inoltre, a breve vorrei catalogare per ciascun repository le issue che sono più facili da svolgere per chi si avvicina al progetto, e filtrarle e pubblicarle live sul sito principale (developers.italia.it). La roadmap è lo strumento principe che ci consente di dichiarare apertamente quali sono i piani di sviluppo del progetto e quali sono le componenti dell’ecosistema software che pensiamo essere importanti. Ovviamente la roadmap è aperta a commenti e proposte da parte di tutti che valuteremo se accogliere nel piano ufficiale di sviluppo, cercando di canalizzare così le contribuzioni (fermo restando che se volete realizzare qualcosa anche fuori roadmap, non saremo certo noi a bloccarvi!). Penso sia la prima software roadmap della pubblica amministrazione in Italia, e tutti i viaggi cominciano con piccoli passi. Spero che ci sarà molto da camminare insieme :) condividi su Twitter argomenti roadmap progetti ",
        "html": "<p>Con molto piacere, questo è il link alla prima roadmap progettuale di Developers Italia: la <a href=\"https://trello.com/b/PHF0ErvK/spid-roadmap\">roadmap di SPID</a>. La abbiamo preparata in forma di bacheca di Trello.</p>\n\n<p>Contiamo di aggiornarla regolarmente via via che gli sviluppi procedono. Ovviamente le card che non sono già assegnate a qualcuno sono… libere :) Per le card in corso, pubblichiamo direttamente il link al repository GitHub dove si svolge lo sviluppo del task, in modo che chi vuole può dare un’occhiata e contribuire. Inoltre, a breve vorrei catalogare per ciascun repository le issue che sono più facili da svolgere per chi si avvicina al progetto, e filtrarle e pubblicarle live sul sito principale (developers.italia.it).</p>\n\n<p>La roadmap è lo strumento principe che ci consente di dichiarare apertamente quali sono i piani di sviluppo del progetto e quali sono le componenti dell’ecosistema software che pensiamo essere importanti. Ovviamente la roadmap è aperta a commenti e proposte da parte di tutti che valuteremo se accogliere nel piano ufficiale di sviluppo, cercando di canalizzare così le contribuzioni (fermo restando che se volete realizzare qualcosa anche fuori roadmap, non saremo certo noi a bloccarvi!).</p>\n\n<p>Penso sia la prima software roadmap della pubblica amministrazione in Italia, e tutti i viaggi cominciano con piccoli passi. Spero che ci sarà molto da camminare insieme :)</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCcwsOiQ_CAHoh_V",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Meetup su Hack.Developers, incontraci dall'11 al 19 Settembre",
        "subtitle": "6 incontri a giro per l'Italia, incontrando gli sviluppatori prima di Hack.Developers",
        "release-date": "2017-09-07 16:00:00 +0000",
        "tags": ["hackathon", "eventi", "sviluppatori"],
        "author": "Giovanni Bajo",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": ["/hackathon/eventi/sviluppatori/2017/09/07/hack-developers-meetup.html"],
        "slug": "hack-developers-meetup",
        "ext": ".md",
        "excerpt": "<p>Ciao a tutti,</p>\n\n<p>come già comunicato, il 7 e l’8 ottobre 2017 si terrà <a href=\"https://hack.developers.italia.it\">Hack.Developers</a>, il più grande code sprint mai realizzato in Italia, organizzato dal <a href=\"https://teamdigitale.governo.it\">Team per la Trasformazione Digitale</a>, in collaborazione con <a href=\"https://www.codemotionworld.com\">Codemotion</a>. Un evento che coinvolgerà <strong>20 città in contemporanea</strong> e circa <strong>80 community tech e di sviluppatori</strong> su tutto il territorio nazionale.</p>\n\n",
        "id": "/news/2017/09/07/hack-developers-meetup",
        "url": "/news/2017/09/07/hack-developers-meetup.html",
        "text": " Sep 7, 2017 Meetup su Hack.Developers, incontraci dall'11 al 19 Settembre 6 incontri a giro per l'Italia, incontrando gli sviluppatori prima di Hack.Developers di Giovanni Bajo condividi su Twitter Ciao a tutti, come già comunicato, il 7 e l’8 ottobre 2017 si terrà Hack.Developers, il più grande code sprint mai realizzato in Italia, organizzato dal Team per la Trasformazione Digitale, in collaborazione con Codemotion. Un evento che coinvolgerà 20 città in contemporanea e circa 80 community tech e di sviluppatori su tutto il territorio nazionale. In vista di questo evento, il nostro Team sarà presente nelle principali città italiane per incontrare e conoscere gli sviluppatori nel corso di Meetup di presentazione dell’hackathon, e coinvolgerli così nel progetto di trasformazione digitale del Paese. Ecco gli appuntamenti dei meetup e i link per registrarsi: Milano - 11 settembre, presso Mikamai/LinkMe Srl Registrati a Milano Napoli - 12 settembre, presso Hub Banco di Napoli - Intesa Sanpaolo Registrati a Napoli Torino - 14 settembre, presso Toolbox Coworking Registrati a Torino Firenze 15 settembre, presso Impact Hub Registrati a Firenze Bari 18 settembre, presso Impact Hub Registrati a Bari Roma 19 settembre, presso LUISS ENLABS Registrati a Roma Vi aspettiamo! condividi su Twitter argomenti hackathon eventi sviluppatori ",
        "html": "<p>Ciao a tutti,</p>\n\n<p>come già comunicato, il 7 e l’8 ottobre 2017 si terrà <a href=\"https://hack.developers.italia.it\">Hack.Developers</a>, il più grande code sprint mai realizzato in Italia, organizzato dal <a href=\"https://teamdigitale.governo.it\">Team per la Trasformazione Digitale</a>, in collaborazione con <a href=\"https://www.codemotionworld.com\">Codemotion</a>. Un evento che coinvolgerà <strong>20 città in contemporanea</strong> e circa <strong>80 community tech e di sviluppatori</strong> su tutto il territorio nazionale.</p>\n\n<p>In vista di questo evento, il nostro Team sarà presente nelle principali città italiane per incontrare e conoscere gli sviluppatori nel corso di Meetup di presentazione dell’hackathon, e coinvolgerli così nel progetto di trasformazione digitale del Paese.</p>\n\n<p>Ecco gli appuntamenti dei meetup e i link per registrarsi:</p>\n\n<ul>\n  <li>Milano - 11 settembre, presso Mikamai/LinkMe Srl <br /> <a href=\"http://bit.ly/2gPNLbe\">Registrati a Milano</a></li>\n  <li>Napoli - 12 settembre, presso Hub Banco di Napoli - Intesa Sanpaolo <br /> <a href=\"http://bit.ly/2w2NuDS\">Registrati a Napoli</a></li>\n  <li>Torino - 14 settembre, presso Toolbox Coworking <br /> <a href=\"http://bit.ly/2iZ9caB\">Registrati a Torino</a></li>\n  <li>Firenze 15 settembre, presso Impact Hub <br /> <a href=\"http://bit.ly/2vI9eda\">Registrati a Firenze</a></li>\n  <li>Bari 18 settembre, presso Impact Hub <br /> <a href=\"http://bit.ly/2gBXL4k\">Registrati a Bari</a></li>\n  <li>Roma 19 settembre, presso LUISS ENLABS <br /> <a href=\"http://bit.ly/2wCn67A\">Registrati a Roma</a></li>\n</ul>\n\n<p>Vi aspettiamo!</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCcwsOiQ_CAHoh_Z",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Hack.Developers, tutti i progetti vincitori del code-sprint",
        "subtitle": "Annunciati i progetti vincitori del premio Wise Turtle, sviluppati entro 30 giorni dalla fine di Hack.Developers",
        "release-date": "2017-11-08 09:00:00 +0000",
        "tags": ["hackathon", "eventi", "sviluppatori"],
        "author": "Giovanni Bajo",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": [null],
        "slug": "hack-developers-tutti-i-progetti-vincitori-del-code-sprint",
        "ext": ".md",
        "excerpt": "<p>Finalmente abbiamo la lista completa dei progetti di <a href=\"https://hack.developers.italia.it/\">Hack.Developers</a> che si sono aggiudicati un premio! Ai <a href=\"https://developers.italia.it/news/2017/10/23/hack-developers-ecco-i-vincitori-fast-rabbit.html\">due team primi classificati nella sezione Fast Rabbit</a> si sono aggiunti i nomi dei <strong>sei team vincitori della categoria Wise Turtle</strong>, dedicata ai progetti sviluppati entro la fine del mese successivo alle 48 ore di code-sprint.</p>\n\n",
        "id": "/news/2017/11/08/hack-developers-tutti-i-progetti-vincitori-del-code-sprint",
        "url": "/news/2017/11/08/hack-developers-tutti-i-progetti-vincitori-del-code-sprint.html",
        "text": " Nov 8, 2017 Hack.Developers, tutti i progetti vincitori del code-sprint Annunciati i progetti vincitori del premio Wise Turtle, sviluppati entro 30 giorni dalla fine di Hack.Developers di Giovanni Bajo condividi su Twitter Finalmente abbiamo la lista completa dei progetti di Hack.Developers che si sono aggiudicati un premio! Ai due team primi classificati nella sezione Fast Rabbit si sono aggiunti i nomi dei sei team vincitori della categoria Wise Turtle, dedicata ai progetti sviluppati entro la fine del mese successivo alle 48 ore di code-sprint. Ecco i contributi premiati: AloneInTheDark, dalla sede di San Francisco, ha sviluppato un microservizio per velocizzare la visualizzazione dei grafici prodotti dal Data &amp; Analytics Framework (progetto: daf-cacher) HAL 0x9000, dalla sede di Camerino, ha sviluppato una libreria per leggere e visualizzare il codice univoco di una Carta d’Identità Elettronica con Arduino, che consente a chiunque di sviluppare prodotti fisici e servizi che si basano sull’identificazione personale (progetto: cie-PN532) TPCWare, dalla sede di Roma, ha sviluppato un plugin per consentire agli sviluppatori di applicazioni web basate su .NET una facile integrazione del login con il sistema di identità digitale SPID (progetto: spid-dotnet-sdk) Microdevelopers, dalla sede di Milano, ha sviluppato un servizio per l’acquisizione di dati di Km4City/Replicate (piattaforma SmartCity del Comune di Firenze) all’interno del Data &amp; Analytics Framework (progetto: daf-replicate-ingestion) Fervento, dalla sede di Napoli, ha sviluppato strumenti per consentire la verifica di SLA utilizzando GitHub come strumento gratuito di ticketing (progetto: anpr-github-metrics) I 3 ignoti, dalla sede di Roma, hanno creato un prototipo di applicazione per visualizzare dati del Data &amp; Analytics Framework usando la libreria grafica D3.js (progetto: daf-dataportal-public) “Il codice prodotto è tanto e di alta qualità, ed è stato difficile scegliere sei pull request da riconoscere in particolare”, racconta sul canale Slack dell’Hackathon Riccardo Iaconelli, uno dei mentor del Team Digitale che ha preso parte alla selezione. Per questo anche gli altri lavori (qui trovi i dieci migliori) saranno valorizzati: “Ricordo che l’avventura continua per tutti! Faremo un merge di ogni contributo di valore nei prossimi giorni, chi ci ha lavorato sarà invitato nell’organizzazione GitHub Italia, e sarà dato accesso in scrittura ai developer che hanno fatto partire nuovi software, con la visibilità e le opportunità che ovviamente questo ruolo comporta. Ci saranno altri eventi per la comunità e molte altre occasioni per ritrovarsi e condividere idee e progetti”. Ti aspettiamo a Roma e… su Slack! L’avventura dell’Hackathon, infatti, è tutt’altro che finita. Il primo appuntamento è a Roma, il 21 novembre, quando tutti i team vincitori saranno premiati alla presenza di Diego Piacentini, il Commissario straordinario per l’attuazione dell’Agenda Digitale. Nel frattempo la community di sviluppatori nata con Hack.Developers continua a vivere: tutto il lavoro ricevuto tramite pull request sarà riconosciuto e tutto il contributo futuro verrà incoraggiato e valorizzato, con le regole classiche di una comunità di sviluppo open. Per questo lo Slack e gli altri strumenti di sviluppo utilizzati nell’hackathon rimarranno aperti e a disposizione della comunità, per diventare sempre di più un punto di riferimento per tutti coloro che vogliono contribuire alla digitalizzazione della PA. Un grazie speciale a tutti quelli che hanno partecipato a Hack.Developers, Il Team Developers Italia condividi su Twitter argomenti hackathon eventi sviluppatori ",
        "html": "<p>Finalmente abbiamo la lista completa dei progetti di <a href=\"https://hack.developers.italia.it/\">Hack.Developers</a> che si sono aggiudicati un premio! Ai <a href=\"https://developers.italia.it/news/2017/10/23/hack-developers-ecco-i-vincitori-fast-rabbit.html\">due team primi classificati nella sezione Fast Rabbit</a> si sono aggiunti i nomi dei <strong>sei team vincitori della categoria Wise Turtle</strong>, dedicata ai progetti sviluppati entro la fine del mese successivo alle 48 ore di code-sprint.</p>\n\n<p>Ecco i contributi premiati:</p>\n\n<ul>\n  <li><strong>AloneInTheDark</strong>, dalla sede di San Francisco, ha sviluppato un <a href=\"https://github.com/italia/daf-cacher/pull/2\">microservizio per velocizzare la visualizzazione dei grafici prodotti</a> dal Data &amp; Analytics Framework (progetto: <a href=\"https://github.com/italia/daf-cacher\">daf-cacher</a>)</li>\n  <li><strong>HAL 0x9000</strong>, dalla sede di Camerino, ha sviluppato <a href=\"https://github.com/italia/cie-PN532/pull/2\">una libreria per leggere e visualizzare il codice univoco</a> di una Carta d’Identità Elettronica con Arduino, che consente a chiunque di sviluppare prodotti fisici e servizi che si basano sull’identificazione personale (progetto: <a href=\"https://github.com/italia/cie-PN532\">cie-PN532</a>)</li>\n  <li><strong>TPCWare</strong>, dalla sede di Roma, ha sviluppato <a href=\"https://github.com/italia/spid-dotnet-sdk/pull/6\">un plugin</a> per consentire agli sviluppatori di applicazioni web basate su .NET una facile integrazione del login con il sistema di identità digitale SPID (progetto: <a href=\"https://github.com/italia/spid-dotnet-sdk\">spid-dotnet-sdk</a>)</li>\n  <li><strong>Microdevelopers</strong>, dalla sede di Milano, ha sviluppato <a href=\"https://github.com/italia/daf-replicate-ingestion/pull/8\">un servizio per l’acquisizione di dati</a> di Km4City/Replicate (piattaforma SmartCity del Comune di Firenze) all’interno del Data &amp; Analytics Framework (progetto: <a href=\"https://github.com/italia/daf-replicate-ingestion\">daf-replicate-ingestion</a>)</li>\n  <li><strong>Fervento</strong>, dalla sede di Napoli, ha sviluppato <a href=\"https://github.com/italia/anpr-github-metrics/pull/2\">strumenti per consentire la verifica di SLA</a> utilizzando GitHub come strumento gratuito di ticketing (progetto: <a href=\"https://github.com/italia/anpr-github-metrics\">anpr-github-metrics</a>)</li>\n  <li><strong>I 3 ignoti</strong>, dalla sede di Roma, hanno creato <a href=\"https://github.com/italia/anpr-github-metrics\">un prototipo di applicazione</a> per visualizzare dati del Data &amp; Analytics Framework usando la libreria grafica D3.js (progetto: <a href=\"https://github.com/italia/daf-dataportal-public\">daf-dataportal-public</a>)</li>\n</ul>\n\n<p>“<em>Il codice prodotto è tanto e di alta qualità, ed è stato difficile scegliere sei pull request da riconoscere in particolare</em>”, racconta sul canale Slack dell’Hackathon Riccardo Iaconelli, uno dei mentor del Team Digitale che ha preso parte alla <a href=\"https://hack.developers.italia.it/premi/\">selezione</a>.</p>\n\n<p>Per questo anche gli altri lavori (qui trovi <a href=\"https://hack.developers.italia.it/vincitori-premio-wise-turtle/\">i dieci migliori</a>) saranno valorizzati: “<em>Ricordo che l’avventura continua per tutti! Faremo un merge di ogni contributo di valore nei prossimi giorni, chi ci ha lavorato sarà invitato nell’organizzazione GitHub Italia, e sarà dato accesso in scrittura ai developer che hanno fatto partire nuovi software, con la visibilità e le opportunità che ovviamente questo ruolo comporta. Ci saranno altri eventi per la comunità e molte altre occasioni per ritrovarsi e condividere idee e progetti</em>”.</p>\n\n<h2 id=\"ti-aspettiamo-a-roma-e-su-slack\">Ti aspettiamo a Roma e… su Slack!</h2>\n\n<p>L’avventura dell’Hackathon, infatti, è <strong>tutt’altro che finita</strong>.</p>\n\n<p>Il primo appuntamento è a Roma, il 21 novembre, quando <a href=\"https://hack.developers.italia.it/cerimonia-di-chiusura/\">tutti i team vincitori saranno premiati</a> <strong>alla presenza di Diego Piacentini</strong>, il Commissario straordinario per l’attuazione dell’Agenda Digitale.</p>\n\n<p>Nel frattempo la community di sviluppatori nata con Hack.Developers continua a vivere: <strong>tutto il lavoro ricevuto tramite pull request</strong> sarà riconosciuto e <strong>tutto il contributo futuro</strong> verrà incoraggiato e valorizzato, con le regole classiche di una comunità di sviluppo open. Per questo lo Slack e gli altri strumenti di sviluppo utilizzati nell’hackathon rimarranno aperti e a disposizione della comunità, per diventare sempre di più un punto di riferimento per <strong>tutti coloro che vogliono contribuire alla digitalizzazione della PA</strong>.</p>\n\n<p>Un grazie speciale a tutti quelli che hanno partecipato a Hack.Developers,</p>\n\n<p>Il Team Developers Italia</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCh6sOiQ_CAHoh_c",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": ["news"],
        "layout": "post",
        "title": "Code hands-on&#58; laboratori aperti con Developers Italia per la Milano Digital Week",
        "subtitle": "Appuntamento il 16 marzo a Milano",
        "release-date": "2018-03-12 09:00:00 +0000",
        "tags": ["developers", "digitalweek"],
        "author": "Francesco De Augustinis",
        "image": "/assets/icons/logo-it.svg",
        "lang": "it",
        "redirect_from": [null],
        "slug": "code-hands-on-laboratori-aperti-per-la-milano-digital-week",
        "ext": ".md",
        "excerpt": "<p>In occasione della <a href=\"https://milanodigitalweek.com/\">Milano Digital Week</a>, il 16 marzo 2018 si terrà “<strong>Code hands-on: Laboratori aperti sui progetti di Developers Italia</strong>”.</p>\n\n",
        "id": "/news/2018/03/12/code-hands-on-laboratori-aperti-per-la-milano-digital-week",
        "url": "/news/2018/03/12/code-hands-on-laboratori-aperti-per-la-milano-digital-week.html",
        "text": " Mar 12, 2018 Code hands-on: laboratori aperti con Developers Italia per la Milano Digital Week Appuntamento il 16 marzo a Milano di Francesco De Augustinis condividi su Twitter In occasione della Milano Digital Week, il 16 marzo 2018 si terrà “Code hands-on: Laboratori aperti sui progetti di Developers Italia”. L’intero pomeriggio il Team Digitale, insieme a Codemotion e Agid, sarà a disposizione di tutti gli sviluppatori che vorranno approfondire gli strumenti tecnologici per sviluppare software per la Pubblica Amministrazione. Un’occasione da non perdere, per prendere confidenza con le attività del Team e i tanti progetti portati avanti dalla community di Developers Italia. Un laboratorio aperto a tutti I progetti al centro della giornata saranno: DAF - La piattaforma nazionale per Data Science e Open Data SPID - Sistema Pubblico di Identità Digitale PagoPA - Nodo di pagamento verso la Pubblica Amministrazione CIE - Carta d’Identità Elettronica 18App - La piattaforma per la gestione del bonus economico I toolkit per il design web dei siti della Pubblica Amministrazione I laboratori sono aperti a tutti e la partecipazione è gratuita: basta solo un portatile e la registrazione tramite il portale Eventbrite. L’evento si terrà presso la sede di TIM Wcap, in via Magolfa, 9, Milano. Ecco il programma della giornata: h14:45 - 15:00 Presentazione del Team Digitale, del Piano Triennale e di Developers Italia e dei progetti di Data Science h15:00 - 15:30 Presentazione dettagliata/tecnica DAF (La piattaforma nazionale per Data Science e Open Data), dei vari strumenti per Data Science, e descrizione di una serie di challenge / esercizi / first good issues h15:30 Inizio laboratorio Data Science con supporto del Team Digitale h17:30 - 17:45 Presentazione del Team Digitale, del Piano Triennale e di Developers Italia e dei progetti rivolti agli sviluppatori h 17:45 - 18:15 Presentazione dettagliata/tecnica progetti Sviluppo Software e dei vari strumenti software, e descrizione di una serie di challenge / esercizi / first good issues h18:15 Inizio laboratorio Sviluppo Software con supporto del Team Digitale 20:00 Aperitivo Networking &amp; Free Hacking fino alle 21:00 Ti aspettiamo a Code hands-on! Registrati subito, ci vediamo il 16 marzo a Milano. A presto! Il team Developers Italia condividi su Twitter argomenti developers digitalweek ",
        "html": "<p>In occasione della <a href=\"https://milanodigitalweek.com/\">Milano Digital Week</a>, il 16 marzo 2018 si terrà “<strong>Code hands-on: Laboratori aperti sui progetti di Developers Italia</strong>”.</p>\n\n<p>L’intero pomeriggio il <a href=\"https://teamdigitale.governo.it/\">Team Digitale</a>, insieme a <a href=\"https://codemotionworld.com/\">Codemotion</a> e <a href=\"https://www.agid.gov.it/\">Agid</a>, sarà a disposizione di tutti gli sviluppatori che vorranno approfondire gli strumenti tecnologici per sviluppare software per la Pubblica Amministrazione. Un’occasione da non perdere, per prendere confidenza con <strong>le attività del Team</strong> e i tanti progetti portati avanti dalla community di <a href=\"https://developers.italia.it/\">Developers Italia</a>.</p>\n\n<h2 id=\"un-laboratorio-aperto-a-tutti\">Un laboratorio aperto a tutti</h2>\n\n<p>I progetti al centro della giornata saranno:</p>\n\n<ul>\n  <li><a href=\"https://teamdigitale.governo.it/it/projects/daf.htm\">DAF</a> - La piattaforma nazionale per Data Science e Open Data</li>\n  <li><a href=\"https://www.spid.gov.it\">SPID</a> - Sistema Pubblico di Identità Digitale</li>\n  <li><a href=\"https://teamdigitale.governo.it/it/projects/pagamenti-digitali.htm\">PagoPA</a> - Nodo di pagamento verso la Pubblica Amministrazione</li>\n  <li><a href=\"https://developers.italia.it/it/cie/\">CIE</a> - Carta d’Identità Elettronica</li>\n  <li><a href=\"https://developers.italia.it/it/18app/\">18App</a> - La piattaforma per la gestione del bonus economico</li>\n  <li>I <a href=\"https://italia.github.io/design-web-toolkit/\">toolkit</a> per il design web dei siti della Pubblica Amministrazione</li>\n</ul>\n\n<p>I laboratori sono aperti a tutti e <strong>la partecipazione è gratuita</strong>: basta solo un portatile e <a href=\"https://www.eventbrite.it/e/biglietti-code-hands-on-laboratori-aperti-sui-progetti-di-developers-italia-43749135843\">la registrazione tramite il portale Eventbrite</a>. L’evento si terrà presso la sede di TIM Wcap, in via Magolfa, 9, Milano.</p>\n\n<p>Ecco il programma della giornata:</p>\n\n<p><strong>h14:45 - 15:00</strong> Presentazione del Team Digitale, del Piano Triennale e di Developers Italia e dei progetti di Data Science</p>\n\n<p><strong>h15:00 - 15:30</strong> Presentazione dettagliata/tecnica DAF (La piattaforma nazionale per Data Science e Open Data), dei vari strumenti per Data Science, e descrizione di una serie di challenge / esercizi / first good issues</p>\n\n<p><strong>h15:30</strong> Inizio laboratorio Data Science con supporto del Team Digitale</p>\n\n<p><strong>h17:30 - 17:45</strong> Presentazione del Team Digitale, del Piano Triennale e di Developers Italia e dei progetti rivolti agli sviluppatori</p>\n\n<p><strong>h 17:45 - 18:15</strong> Presentazione dettagliata/tecnica progetti Sviluppo Software e dei vari strumenti software, e descrizione di una serie di challenge / esercizi / first good issues</p>\n\n<p><strong>h18:15</strong> Inizio laboratorio Sviluppo Software con supporto del Team Digitale</p>\n\n<p><strong>20:00</strong> Aperitivo</p>\n\n<p>Networking &amp; Free Hacking fino alle <strong>21:00</strong></p>\n\n<h2 id=\"ti-aspettiamo-a-code-hands-on\">Ti aspettiamo a Code hands-on!</h2>\n\n<p><a href=\"https://www.eventbrite.it/e/biglietti-code-hands-on-laboratori-aperti-sui-progetti-di-developers-italia-43749135843\">Registrati subito</a>, ci vediamo il 16 marzo a Milano.</p>\n\n<p>A presto!</p>\n\n<p>Il team Developers Italia</p>\n",
        "type": "posts"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wCmVsOiQ_CAHoh_i",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "FAQ",
        "lang": "en",
        "layout": "faqs",
        "pills": [{
          "title": "tag",
          "link": "#"
        }, {
          "title": "label",
          "link": "#"
        }],
        "slug": "faq",
        "ext": ".md",
        "tags": [],
        "excerpt": "\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/faq",
        "url": "/en/faq/",
        "text": "",
        "html": "\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_w",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "Privacy Policy",
        "lang": "it",
        "layout": "page",
        "slug": "privacy-policy",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h3 id=\"privacy-policy\">Privacy Policy</h3>\n<p>In questa pagina si descrivono le modalità e le condizioni del trattamento dei dati personali degli utenti (di seguito, anche gli Utenti) che consultano e utilizzano il sito: <a href=\"http://developers.italia.it\">http://developers.italia.it</a> (di seguito, anche il Sito).\nL’informativa è resa ai sensi dell’art. 13 del D. Lgs. n. 196/2003 - Codice in materia di protezione dei dati personali a tutti gli Utenti che, interagendo con il Sito, forniscono al gestore dello stesso i propri dati personali.\nLa validità dell’informativa contenuta nella presente pagina è limitata al solo Sito e non si estende ad altri siti web eventualmente consultabili mediante collegamento ipertestuale.</p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/privacy-policy",
        "url": "/it/privacy-policy/",
        "text": "",
        "html": "<h3 id=\"privacy-policy\">Privacy Policy</h3>\n<p>In questa pagina si descrivono le modalità e le condizioni del trattamento dei dati personali degli utenti (di seguito, anche gli Utenti) che consultano e utilizzano il sito: <a href=\"http://developers.italia.it\">http://developers.italia.it</a> (di seguito, anche il Sito).\nL’informativa è resa ai sensi dell’art. 13 del D. Lgs. n. 196/2003 - Codice in materia di protezione dei dati personali a tutti gli Utenti che, interagendo con il Sito, forniscono al gestore dello stesso i propri dati personali.\nLa validità dell’informativa contenuta nella presente pagina è limitata al solo Sito e non si estende ad altri siti web eventualmente consultabili mediante collegamento ipertestuale.</p>\n\n<p>Il Titolare del trattamento per i dati raccolti attraverso il Sito è AgID - Agenzia per l’Italia Digitale, con sede in via Liszt 21 - 00144 Roma, indirizzo email <a href=\"mailto:protocollo@pec.agid.gov.it\">protocollo@pec.agid.gov.it</a>.\nEventuali soggetti terzi ai quali i dati potrebbero essere comunicati per l’esecuzione di operazioni di trattamento connesse con le finalità specificate nella presente informativa, saranno preventivamente designati dal Titolare quali Responsabili del trattamento ai sensi dell’art. 29 del Codice in materia di protezione dei dati personali.\nI dati personali degli utenti diversi da quelli che l’utente pubblicherà direttamente sul sito nell’apposita area di discussione non formeranno oggetto di discussione.</p>\n\n<p>Tutti i dati personali forniti attraverso il Sito saranno trattati in modo lecito e secondo correttezza al fine di fornire i servizi richiesti nonché di rispondere alle comunicazioni ed alle domande degli Utenti, sempre nel perseguimento degli scopi istituzionali dell’Agenzia così come previsti dalla Legge.</p>\n\n<p>I dati personali sono trattati con strumenti automatizzati per il tempo strettamente necessario a conseguire gli scopi per cui sono stati raccolti secondo quanto previsto dall’art. 11, lett. e) del Codice privacy. L’Agenzia adotta tutte le misure di sicurezza previste dal Codice privacy per proteggere i dati raccolti, al fine di scongiurare i rischi di perdita o furto dei dati, accessi non autorizzati, usi illeciti e non corretti.\nGli Utenti possono esercitare in qualsiasi momento i diritti previsti dall’art. 7 del Codice privacy, al fine di ottenere la conferma dell’esistenza o meno dei loro dati personali e di conoscerne il contenuto e l’origine, verificarne l’esattezza o chiederne l’integrazione o l’aggiornamento, oppure la rettificazione. Ai sensi della medesima disposizione l’Utente potrà inoltre chiedere la cancellazione, la trasformazione in forma anonima o il blocco dei dati trattati in violazione di legge, nonché opporsi in ogni caso, per motivi legittimi, al loro trattamento.\nLe richieste vanno inviate al seguente indirizzo: <a href=\"mailto:protocollo@pec.agid.gov.it\">protocollo@pec.agid.gov.it</a>. Attraverso il medesimo indirizzo, l’Utente potrà chiedere inoltre la lista aggiornata di tutti i Responsabili del trattamento nominati dal Titolare.\nLa presente Privacy Policy è soggetta ad aggiornamenti; gli Utenti sono pertanto invitati a verificarne periodicamente il contenuto.</p>\n\n<h3 id=\"cookies-policy\">Cookies policy</h3>\n<p>I cookies sono piccoli file di testo che i siti visitati inviano al terminale dell’Utente, dove vengono memorizzati, per poi essere ritrasmessi agli stessi siti alla visita successiva.\nIl sito utilizza:</p>\n<ul>\n  <li>\n    <p>cookies analytics utilizzati per raccogliere informazioni, in forma aggregata, sul numero degli Utenti e su come gli stessi visitano il Sito. Il sito dell’Agenzia dell’Italia Digitale si avvale del servizio Google Analytics, la cui cookie policy può essere visionata a <a href=\"https://developers.google.com/analytics/devguides/collection/analyticsjs/cookie-usage\">questo link</a>. Al fine di rispettare la privacy dei nostri utenti, il servizio è utilizzato con la modalità “_anonymizeIp” che consente di mascherare gli indirizzi IP degli utenti che navigano sul sito internet: <a href=\"https://support.google.com/analytics/answer/2763052?hl=it\">maggiori informazioni sulla funzionalità</a>. I dati sono raccolti all’unico fine di elaborare informazioni statistiche anonime sull’uso del Sito e per verificare il corretto funzionamento dello stesso.\nI cookies utilizzati dal Sito non consentono la raccolta di informazioni personali relative all’utente e si cancellano automaticamente con la chiusura del browser di navigazione.\nI dati di navigazione sono cancellati subito dopo la relativa elaborazione statistica e in ogni caso non vengono conservati per oltre 7 giorni dal momento della raccolta, salvo che la loro ulteriore conservazione non si renda necessaria per l’accertamento di reati.\nI cookies non sono utilizzati per attività di profilazione dell’Utente.\nL’Utente può scegliere di abilitare o disabilitare i cookies intervenendo sulle impostazioni del proprio browser di navigazione secondo le istruzioni rese disponibili dai relativi fornitori ai link di seguito indicati.</p>\n\n    <ul>\n      <li><a href=\"https://support.google.com/chrome/answer/95647?co=GENIE.Platform%3DDesktop&amp;hl=it\">Chrome</a></li>\n      <li><a href=\"https://support.mozilla.org/it/kb/Attivare%20e%20disattivare%20i%20cookie\">Firefox</a></li>\n      <li><a href=\"https://support.apple.com/kb/ph19214?locale=it_IT\">Safari</a></li>\n      <li><a href=\"https://support.microsoft.com/it-it/help/17442/windows-internet-explorer-delete-manage-cookies\">Internet Explorer</a></li>\n      <li><a href=\"http://help.opera.com/Windows/10.00/it/cookies.html\">Opera</a></li>\n    </ul>\n  </li>\n</ul>\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_y",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "title": "Software",
        "subtitle": "Lorem ipsum dolor sit amet, consetetur sed diam volupta",
        "lang": "it",
        "layout": "software",
        "slug": "software",
        "ext": ".md",
        "tags": [],
        "excerpt": "\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/software",
        "url": "/it/software/",
        "text": "",
        "html": "\n",
        "type": "pages"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDgfsOiQ_CAHoh_0",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "ANPR",
        "logo": "/assets/images/logo-anpr@2x.png",
        "subtitle": "National Registry of Resident Population",
        "payoff": "The registry becomes one and digital",
        "description": "A single centralised registry, accessible by an API, which holds the up-to-date information about address, civil state, etc.\n",
        "lang": "en",
        "order": 4,
        "maintainers": ["carlo", "mirko"],
        "highlight": true,
        "comingsoon": false,
        "layout": "project",
        "github_team": "anpr",
        "slug": "anpr",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h3 id=\"intro\">Intro</h3>\n<p>ANPR is a memorable project: instead of having more than 8,000 registries spread over the entire\nnational territory (in evey municipality), Italy will have finally a single centralised registry\nwhich will simplify all the interactions with the Public Administration.</p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/en/anpr",
        "url": "/en/anpr/",
        "text": "",
        "html": "<h3 id=\"intro\">Intro</h3>\n<p>ANPR is a memorable project: instead of having more than 8,000 registries spread over the entire\nnational territory (in evey municipality), Italy will have finally a single centralised registry\nwhich will simplify all the interactions with the Public Administration.</p>\n\n<p>In the future we hope to provide more features like update your residency’s address or download a\nFamily Status Declaration straight from the website.</p>\n\n<p>This is only the beginning: did you ever asked yourself why you need to request certificates at the\nregistry in your municipality? Simple: at today a single centralised registry where the public\noffices can access your information doesn’t exists at all. With ANPR it will completely different.</p>\n\n<p>At today the access to the ANPR is reserved only to the public administration and their software.\nSo this section is dedicated to everyone is giving support to municipalities to migrate to ANPR and\nis helping us to fulfill our vision. There’s a lot of work to do and the contribution of the\ncommunity is important.</p>\n\n<h3 id=\"documentation\">Documentation</h3>\n<p>We are working on a deep refactoring of all the documentation. For now we achived on publishing\nonly the current documentation in a format more easy to read and query of all the table and error\ncodes.</p>\n\n<p><a href=\"http://anpr.readthedocs.io/it/latest/\">Table and error codes</a></p>\n\n<h3 id=\"collaboration\">Collaboration</h3>\n<p>We built some collaboration tools for you including an <em>issue tracker</em> and a forum dedicated to\ndiscuss all the problems on integrating ANPR.</p>\n\n<p><a href=\"https://github.com/italia/anpr/issues\">Issue tracker</a></p>\n\n<p><a href=\"https://forum.italia.it/c/anpr\">Forum</a></p>\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoh__",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "dati.gov.it",
        "subtitle": "I dati aperti della pubblica amministrazione",
        "logo": "/assets/images/logo-dati.gov.it@2x.png",
        "payoff": "I dati aperti della pubblica amministrazione",
        "description": "Dati.gov.it e’ il catalogo nazionale dei dati aperti delle pubbliche amministrazioni italiane. Nasce con l’obiettivo di aggregare in un unico portale la maggior parte dei dati aperti esposti dalle varie amministrazioni sia locali che nazionali.\n",
        "lang": "it",
        "order": 4,
        "highlight": false,
        "comingsoon": false,
        "layout": "project",
        "maintainers": ["alessandro", "fabiana", "giorgia", "marcello"],
        "socials": [{
          "name": "twitter",
          "icon": "twitter",
          "link": "//twitter.com/datigovit"
        }, {
          "name": "youtube",
          "icon": "youtube",
          "link": "//www.youtube.com/channel/UCHsqR2YhxeKgFT4rAKVcAAQ"
        }],
        "slug": "datigov",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"intro\">Intro</h2>\n<p>Trasparenza, riutilizzo, partecipazione sono alcune delle parole cardine che guidano il processo di apertura del dato e vengono ereditate dalla  comunità del software libero, che produce da anni un modello di sviluppo di codice software di alta qualità basato su principi di condivisione ed apertura.</p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/datigov",
        "url": "/it/datigov/",
        "text": "",
        "html": "<h2 id=\"intro\">Intro</h2>\n<p>Trasparenza, riutilizzo, partecipazione sono alcune delle parole cardine che guidano il processo di apertura del dato e vengono ereditate dalla  comunità del software libero, che produce da anni un modello di sviluppo di codice software di alta qualità basato su principi di condivisione ed apertura.</p>\n\n<p>Il nostro obiettivo è quello di <strong>evolvere l’attuale portale online</strong> da catalogo dei dati aperti ad un sistema che offra strumenti e servizi sviluppati in condivisione con la comunità che quindi ne estenda le potenzialità.</p>\n\n<p>Come per tutti i progetti di Developers Italia, il portale dei dati aperti segue un modello di sviluppo basato su un <strong>processo collaborativo</strong> tipico delle comunità degli sviluppatori. Gli strumenti che vogliamo utilizzare per strutturare il processo di sviluppo sono:</p>\n\n<ul>\n  <li>Una roadmap di sviluppo agile e pubblica</li>\n  <li>Codice sorgente aperto fin dall’inizio</li>\n  <li>Un sistema di tracciamento degli errori pubblico</li>\n  <li>Documentazione del codice e delle API chiaro</li>\n</ul>\n\n<h2 id=\"documentazione\">Documentazione</h2>\n\n<p>Qui puoi trovare la documentazione tecnica attualmente disponibile sia sul documento architetturale, sia sulle linee guida tecniche per i cataloghi dati che includono la specifica DCAT-AP_IT:</p>\n\n<p><a href=\"https://docs.google.com/document/d/1dCfbpwmkl-U2kreykRY8YXJct6GOe-r_3qjism5wI2Y/edit\">Documento d’architettura dell’evoluzione di dati.gov.it</a></p>\n\n<p><a href=\"http://linee-guida-cataloghi-dati-profilo-dcat-ap-it.readthedocs.io\">Le linee guida tecniche per i cataloghi dati</a></p>\n\n<h2 id=\"codice-sorgente\">Codice sorgente</h2>\n\n<p>Qui puoi trovare l’attuale codice sorgente basato su DKAN (Drupal), e a breve pubblicheremo un documento per aiutarti a\ncreare l’ambiente di sviluppo per contribuire:</p>\n\n<p><a href=\"https://github.com/FormezPA/dkan\">Repo GitHub attuale dati.gov.it</a></p>\n\n<p>Qui invece trovi i repositori relativi all’evoluzione di dati.gov.it come da documento architetturale:</p>\n\n<p><a href=\"https://github.com/italia/dati.gov.it\">Repo GitHub evoluzione dati.gov.it</a></p>\n\n<p><a href=\"https://github.com/italia/dati-frontendserver\">Nuovo frontend server</a></p>\n\n<h2 id=\"collaborazione\">Collaborazione</h2>\n\n<p>Abbiamo aperto già da tempo una mailing-list per trattare i temi di dati e opendata, per cui puoi trovare là\nl’archivio delle precedenti discussioni e iscriverti per partecipare. Inoltre, abbiamo anche predisposto\nun tracker pubblico su GitHub:</p>\n\n<p><a href=\"https://groups.google.com/a/teamdigitale.governo.it/forum/#!forum/data\">Mailing-list OpenData &amp; Analytics</a></p>\n\n<p><a href=\"https://github.com/italia/dati.gov.it/issues\">Issue tracking del progetto</a></p>\n\n<p><a href=\"https://github.com/italia/dati.gov.it/projects\">Pianificazione dello sviluppo</a></p>\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAE",
      "_score": 1,
      "_source": {
        "draft": false,
        "categories": [],
        "toc": true,
        "title": "SPID",
        "subtitle": "Sistema Pubblico di Identità Digitale",
        "logo": "/assets/images/logo-spid@2x.png",
        "payoff": "Sistema Pubblico di Identità Digitale",
        "description": "Lo SPID è una credenziale unica di accesso, con identità verificata, che può essere integrata secondo lo standard SAML su siti pubblici ma anche privati.\n",
        "maintainers": ["umbros"],
        "lang": "it",
        "order": 1,
        "highlight": true,
        "comingsoon": false,
        "layout": "project",
        "github_team": "spid",
        "socials": [{
          "name": "facebook",
          "icon": "facebook",
          "link": "https://www.facebook.com/groups/agid.spid/"
        }],
        "slug": "spid",
        "ext": ".md",
        "tags": [],
        "excerpt": "<h2 id=\"intro\">Intro</h2>\n<p>SPID (Sistema Pubblico di Identità Digitale) è la soluzione che permette ai cittadini italiani di accedere a tutti i servizi online della Pubblica Amministrazione con un’unica Identità Digitale utilizzabile da computer, tablet e smartphone.\nIl cittadino può ottenere SPID tramite i Gestori di Identità (detti Identity Provider); una volta completata\nla procedura di verifica (che certifica l’identità del richiedente), vengono rilasciate un set di credenziali che possono essere utilizzate su tutti i siti (chiamati Service Provider).</p>\n\n",
        "release-date": "2018-06-13 15:25:05 +0000",
        "id": "/it/spid",
        "url": "/it/spid/",
        "text": "",
        "html": "<h2 id=\"intro\">Intro</h2>\n<p>SPID (Sistema Pubblico di Identità Digitale) è la soluzione che permette ai cittadini italiani di accedere a tutti i servizi online della Pubblica Amministrazione con un’unica Identità Digitale utilizzabile da computer, tablet e smartphone.\nIl cittadino può ottenere SPID tramite i Gestori di Identità (detti Identity Provider); una volta completata\nla procedura di verifica (che certifica l’identità del richiedente), vengono rilasciate un set di credenziali che possono essere utilizzate su tutti i siti (chiamati Service Provider).</p>\n\n<p>L’integrazione di SPID è consentita sia per i siti Pubblica Amministrazione, sia per i siti e servizi online dei privati. I vantaggi nell’adottare SPID sono quindi molteplici: le banche e le assicurazioni, per esempio, potrebbero riconoscere il cittadino che vuole creare un conto o stipulare una polizza semplicemente facendogli fare login.</p>\n\n<p><strong>Roadmap</strong></p>\n\n<p>Sono in seguenti sviluppi che coinvolgono anche la community:</p>\n\n<ul>\n  <li>Creazione di plugin per i principali CMS (Wordpress, Drupal, Joomla, ecc.)</li>\n  <li>Scheletri di integrazione in ambito mobile (iOS, Android)</li>\n  <li>Testsuite di validazione dell’integrazione di SPID</li>\n  <li>Ambiente di testing e validazione di SPID</li>\n</ul>\n\n<h2 id=\"documentazione\">Documentazione</h2>\n<p>SPID utilizza un protocollo aperto (SAML 2) che può essere implementato applicando le regole tecniche ufficiali.</p>\n\n<p><a href=\"http://spid-regole-tecniche.readthedocs.io/en/latest/\">Regole tecniche</a></p>\n\n<h2 id=\"codice-sorgente\">Codice sorgente</h2>\n<p>Ancora il codice pubblicato è molto poco, ma abbiamo grandi piani al riguardo (vedi roadmap):</p>\n\n<p><a href=\"https://github.com/italia/spid-sp-access-button\">Bottone SPID di accesso, con scelta dell’IdP integrata</a></p>\n\n<p><a href=\"https://github.com/italia/spid-idp-login-layout\">Layout standard di IdP</a></p>\n\n<p><a href=\"https://github.com/italia/spid-sp-playbook\">Playbook Ansible per SP</a></p>\n\n<p><strong>Grafica</strong></p>\n\n<p>Abbiamo pubblicato un po’ di asset che tornano comodi durante l’integrazione:</p>\n\n<p><a href=\"https://github.com/italia/spid-graphics\">Icone, loghi e grafiche SPID</a></p>\n\n<p><a href=\"https://github.com/italia/spid-button\">Bottone SPID (solo asset)</a></p>\n\n<h2 id=\"collaborazione\">Collaborazione</h2>\n<p>Abbiamo aperto un’area di discussione nel nostro forum, per risolvere le problematiche tecniche di integrazione,\ne a breve sarà disponibile anche un issue tracker pubblico.</p>\n\n<p><a href=\"https://forum.italia.it/c/spid\">Forum di discussione tecnica</a></p>\n\n<p>Facciamo anche delle call settimanali su Jitsi, qui trovato le informazioni\nper partecipare. Chiunque sia interessato a seguire lo sviluppo può entrare:</p>\n\n<p><a href=\"https://forum.italia.it/t/spid-weekly-meeting/276\">Videocall settimanale</a></p>\n\n",
        "type": "projects"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAF",
      "_score": 1,
      "_source": {
        "title": "What's the goal of this website?",
        "text": "",
        "order": 1,
        "lang": "en",
        "id": "/faqs/en/1",
        "url": "/faqs/en/1.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAH",
      "_score": 1,
      "_source": {
        "title": "What's the meaning of \"project's maintainer\"?",
        "text": "",
        "order": 3,
        "lang": "en",
        "id": "/faqs/en/20",
        "url": "/faqs/en/20.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAK",
      "_score": 1,
      "_source": {
        "title": "Can I contribute to a project?",
        "text": "",
        "order": 6,
        "lang": "en",
        "id": "/faqs/en/50",
        "url": "/faqs/en/50.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAL",
      "_score": 1,
      "_source": {
        "title": "I've released an open source software which can be useful to the community. Can I add it to this website?\n",
        "text": "",
        "order": 8,
        "lang": "en",
        "id": "/faqs/en/60",
        "url": "/faqs/en/60.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAO",
      "_score": 1,
      "_source": {
        "title": "Chi gestisce questo sito?",
        "text": "",
        "order": 10,
        "lang": "it",
        "id": "/faqs/it/10",
        "url": "/faqs/it/10.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAT",
      "_score": 1,
      "_source": {
        "title": "Quali progetti sono ospitati su Developers Italia?",
        "text": "",
        "order": 5,
        "lang": "it",
        "id": "/faqs/it/5",
        "url": "/faqs/it/5.yml",
        "html": "",
        "type": "faqs"
      }
    },
    {
      "_index": "jekyll-20180613152506",
      "_type": "post",
      "_id": "AWP5wDggsOiQ_CAHoiAV",
      "_score": 1,
      "_source": {
        "title": "Ho rilasciato un software open-source che può essere utile alla comunità. Posso aggiungerlo a questo sito?",
        "text": "",
        "order": 60,
        "lang": "it",
        "id": "/faqs/it/60",
        "url": "/faqs/it/60.yml",
        "html": "",
        "type": "faqs"
      }
    }
  ]
}